Repository: Elorth-HC/hardchip-localization
Catalog: src/Areas/ChallengeRuntime/Texts/ChallengeReportTexts.*.resx
Languages: de, fr, it, ja, ro, ru, zh_hans

source: (best Block solution)
de: (beste Block-Lösung)
fr: (meilleure solution de blocs)
it: (miglior soluzione in Blocchi)
ja: （最適なブロックソリューション）
ro: (cea mai bună soluție de blocuri)
ru: (лучшее по блокам решение)
zh_hans: （最佳块数解决方案）

# EfficientP
source: Efficient+
de: Effizient+
fr: Efficace+
it: Efficiente+
ja: 効率的+
ro: Eficient+
ru: Эффективно+
zh_hans: 高效+

# TicksReport
source: Ticks
ja: ティック
ro: Cicluri
ru: Такты
zh_hans: 时钟周期

# FastPP
source: Fast++
de: Schnell++
fr: Rapide++
it: Veloce++
ja: 高速++
ro: Rapid++
ru: Быстро++
zh_hans: 快速++

# BlocksUsedTheFewerTheBetterNComplexSatisfactoryEfficient
source: Blocks used. The fewer the better. Complex -> Satisfactory -> Efficient
de: Verwendete Blöcke. Je weniger, desto besser. Komplex -> Zufriedenstellend -> Effizient
fr: Blocs utilisés. Moins il y en a, mieux c'est. Complex -> Satisfaisant -> Efficace
it: Blocchi utilizzati. Meno sono, meglio è. Complesso -> Soddisfacente -> Efficiente
ja: 使用したブロック数。少ないほど良い。 複雑 → 標準 → 効率的
ro: Blocuri utilizate. Cu cât mai puține, cu atât mai bine. Complex -> Satisfăcător -> Eficient
ru: Использовано блоков. Чем меньше, тем лучше. Усложнено -> Удовлетворительно -> Эффективно
zh_hans: 使用的块数量。越少越好。 复杂 -> 合格 -> 高效

source: Modify
de: Ändern
fr: Modifier
it: Modifica
ja: 変更する
ro: Modifică
ru: Изменить
zh_hans: 修改

source: Blocks:
de: Blöcke:
fr: Blocs:
it: Blocchi:
ja: ブロック:
ro: Blocuri:
ru: Блоки:
zh_hans: 块数：

source: Advanced
de: Fortgeschritten
fr: Avancé
it: Avanzato
ja: 高度
ro: Avansat
ru: Усовершенствованно
zh_hans: 进阶

source: Best Volume solution, click to compare
de: Klicke, um die beste Volumen-Lösung zu vergleichen
fr: Meilleure solution de volume, cliquez pour comparer. Clic droit pour définir à actuelle.
it: Miglior soluzione in Volume, clicca per confrontare
ja: 最適なボリューム解決策。クリックして比較。右クリックで現在の設定にします。
ro: Cea mai bună soluție de volum, faceți clic pentru a compara. Clic dreapta pentru a seta ca curent.
ru: Лучшее по объёму решение, нажмите, чтобы сравнить. Правый клик, чтобы установить как текущее.
zh_hans: 最佳体积解决方案，点击比较。右键设为当前。

source: Efficient
de: Effizient
fr: Efficace
it: Efficiente
ja: 効率的
ro: Eficient
ru: Эффективно
zh_hans: 高效

source: Functional -> Satisfactory -> Streamlined
de: Funktional -> Zufriedenstellend -> Optimiert
fr: Fonctionnel -> Satisfaisant -> Optimisé
it: Funzionale -> Soddisfacente -> Ottimizzato
ja: 機能的 → 標準 → 最適
ro: Funcțional -> Satisfăcător -> Raționalizat
ru: Функционально -> Удовлетворительно -> Оптимизировано
zh_hans: 可用 -> 合格 -> 精简

# VolumeUsedTheSmallerTheBetterNLargeSatisfactoryCompact
source: Volume used. The smaller the better. Large -> Satisfactory -> Compact
de: Genutztes Volumen. Je kleiner, desto besser. Groß -> Zufriedenstellend -> Kompakt
fr: Volume utilisé. Plus il est petit, mieux c'est. Large -> Satisfaisant -> Compact
ja: 使用した体積。小さいほど良いです。 大きい → 標準 → コンパクト
ro: Volum utilizat. Cu cât mai mic, cu atât mai bine. Mare -> Satisfăcător -> Compact
ru: Использовано объёма. Чем меньше, тем лучше. Громоздко -> Удовлетворительно -> Компактно
zh_hans: 占用的体积。越小越好。 庞大 -> 合格 -> 紧凑

# TicksUsedTheFewerTheBetterNSlowSatisfactoryFast
source: Ticks used. The fewer the better. Slow -> Satisfactory -> Fast
de: Verwendete Ticks. Je weniger, desto besser. Langsam -> Zufriedenstellend -> Schnell
fr: Ticks utilisés. Moins il y en a, mieux c'est. Lent -> Satisfaisant -> Rapide
ja: 使用したティック数。少ないほど良いです。 遅い → 標準 → 速い
ro: Cicluri utilizate. Cu cât mai puține, cu atât mai bine. Lent -> Satisfăcător -> Rapid
ru: Использовано тактов. Чем меньше, тем лучше. Медленно -> Удовлетворительно -> Быстро
zh_hans: 使用的时钟周期。越少越好。 缓慢 -> 合格 -> 快速

source: Volume:
de: Volumen:
ja: ボリューム:
ro: Volum:
ru: Объём:
zh_hans: 体积：

source: Satisfactory
de: Zufriedenstellend
fr: Satisfaisant
it: Soddisfacente
ja: 標準
ro: Satisfăcător
ru: Удовлетворительно
zh_hans: 合格

# Grade01
source: Grade{0}:
de: Bewertung{0}:
fr: Note{0}:
it: Grado{0}:
ja: 評価{0}:
ro: Nota{0}:
ru: Категория{0}:
zh_hans: 评级{0}：

source: Best Tick solution, click to compare
de: Klicke, um die beste Tick-Lösung zu vergleichen
fr: Meilleure solution de ticks, cliquez pour comparer. Clic droit pour définir à actuelle.
it: Miglior soluzione in Tick, clicca per confrontare
ja: 最適なティックソリューション。クリックして比較。右クリックで現在の設定にします。
ro: Cea mai bună soluție de cicluri, faceți clic pentru a compara. Clic dreapta pentru a seta ca curent.
ru: Лучшее по тактам решение, нажмите, чтобы сравнить. Правый клик, чтобы установить как текущее.
zh_hans: 最佳时钟周期解决方案，点击比较。右键设为当前。

source: Compact
de: Kompakt
it: Compatto
ja: コンパクト
ru: Компактно
zh_hans: 紧凑

source: Complex
de: Komplex
fr: Complexe
it: Complesso
ja: 複雑
ru: Усложнено
zh_hans: 复杂

# MOSReport
source: MOS
ru: МОП

# EfficientPP
source: Efficient++
de: Effizient++
fr: Efficace++
it: Efficiente++
ja: 効率的++
ro: Eficient++
ru: Эффективно++
zh_hans: 高效++

source: (best Volume solution)
de: (beste Volumen-Lösung)
fr: (meilleure solution de volume)
it: (miglior soluzione in Volume)
ja: （最適なボリュームソリューション）
ro: (cea mai bună soluție de volum)
ru: (лучшее по объёму решение)
zh_hans: （最佳体积解决方案）

source: Functional
de: Funktional
fr: Fonctionnel
it: Funzionale
ja: 機能的
ro: Funcțional
ru: Функционально
zh_hans: 可用

# PerformanceReport
source: {0} performance report
de: {0}-Leistungsbericht
fr: {0} rapport de performance
it: {0} rapporto performance
ja: {0} パフォーマンスレポート
ro: Raport de performanță {0}
ru: {0} - отчет о производительности
zh_hans: {0} 性能报告

# VolumeReport
source: Volume
de: Volumen
ja: ボリューム
ro: Volum
ru: Объём
zh_hans: 体积

# ReducedPP
source: Reduced++
de: Reduziert++
fr: Réduit++
it: Risotto++
ja: 削減++
ro: Redus++
ru: Уменьшено++
zh_hans: 低++

# MOSUsedTheFewerTheBetterNHighSatisfactoryReduced
source: MOS used. The fewer the better. High -> Satisfactory -> Reduced
de: Verwendete MOS. Je weniger, desto besser. Hoch -> Zufriedenstellend -> Reduziert
fr: MOS utilisés. Moins il y en a, mieux c'est. Élevé -> Satisfaisant -> Réduit
it: MOS utilizzati. Meno sono, meglio è. Alto -> Soddisfacente -> Ridotto
ja: 使用されたMOS。少ないほど良い。 高い → 標準 → 減少
ro: MOS utilizat. Cu cât mai puțin, cu atât mai bine. Ridicat -> Satisfăcător -> Redus
ru: Использовано МОП. Чем меньше, тем лучше. Много -> Удовлетворительно -> Уменьшено
zh_hans: 使用的 MOS数。越少越好。 偏多 -> 合格 -> 精简

source: MOS:
ru: МОП:
zh_hans: MOS数：

# FastP
source: Fast+
de: Schnell+
fr: Rapide+
it: Veloce+
ja: 高速+
ro: Rapid+
ru: Быстро+
zh_hans: 快速+

source: Large
de: Groß
it: Grande
ja: 大きい
ro: Mare
ru: Громоздко
zh_hans: 庞大

source: Ticks:
ja: ティック:
ro: Cicluri:
ru: Такты:
zh_hans: 时钟周期数：

source: Photo mode
de: Fotomodus
fr: Mode photo
it: Modalità foto
ja: フォトモード
ro: Mod fotografie
ru: Фото-режим
zh_hans: 拍照模式

# CompactP
source: Compact+
de: Kompakt+
it: Compatto+
ja: コンパクト+
ru: Компактно+
zh_hans: 紧凑+

source: Save Blueprint
de: Blaupause speichern
fr: Enregistrer le blueprint
it: Salva progetto
ja: ブループリントを保存
ro: Salvează planul
ru: Сохранить чертёж
zh_hans: 保存蓝图

# ReducedP
source: Reduced+
de: Reduziert+
fr: Réduit+
it: Ridotto+
ja: 縮小+
ro: Redus+
ru: Уменьшено+
zh_hans: 低+

source: (best Mos solution)
de: (beste MOS-Lösung)
fr: (meilleure solution de MOS)
it: (miglior soluzione in MOS)
ja: （最適なMOSソリューション）
ro: (cea mai bună soluție MOS)
ru: (лучшее по количеству МОП решение)
zh_hans: （最佳 MOS 数解决方案）

source: Masterpiece
de: Meisterwerk
fr: Chef-d'œuvre
it: Capolavoro
ja: 傑作
ro: Capodoperă
ru: Шедевр
zh_hans: 杰作

source: Chip checked!
de: Chip geprüft!
fr: Puce vérifiée!
it: Chip verificato!
ja: チップを確認しました！
ro: Chip verificat!
ru: Чип проверен!
zh_hans: 芯片已检测！

source: Export Blueprint to a new HCDrive file into the clipboard
de: Blaupause als neue HCDrive-Datei in die Zwischenablage exportieren
fr: Exporter le blueprint vers un nouveau fichier HCDrive dans le presse-papiers
it: Esporta il progetto su un nuovo file HCDrive negli appunti
ja: ブループリントを新しいHCDriveファイルとしてクリップボードにエクスポートする
ro: Exportă planul într-un fișier HCDrive nou în clipboard
ru: Экспортировать чертёж в новый файл HCDrive в буфер обмена
zh_hans: 将蓝图导出为新的 HCDrive 文件到剪贴板

source: Reduced
de: Reduziert
fr: Réduit
it: Ridotto
ja: 縮小
ro: Redus
ru: Уменьшено
zh_hans: 低

source: Data unavailable
de: Daten nicht verfügbar
fr: Données indisponibles
it: Dati non disponibili
ja: データは利用できません
ro: Date indisponibile
ru: Данные недоступны
zh_hans: 数据不可用

source: Best Block solution, click to compare
de: Klicke, um die beste Block-Lösung zu vergleichen
fr: Meilleure solution de blocs, cliquez pour comparer. Clic droit pour définir à actuelle.
it: Miglior soluzione in Blocchi, clicca per confrontare
ja: 最適なブロック解決策。クリックして比較。右クリックで現在の設定にします。
ro: Cea mai bună soluție de blocuri, faceți clic pentru a compara. Clic dreapta pentru a seta ca curent.
ru: Лучшее по количеству блоков решение, нажмите, чтобы сравнить. Правый клик, чтобы установить как текущее.
zh_hans: 最佳块数解决方案，点击比较。右键设为当前。

source: Last chip checked
de: Letzter Chip geprüft
fr: Puce vérifiée
it: Ultimo chip verificato
ja: 最後に確認したチップ
ro: Ultimul chip verificat
ru: Последний проверенный чип
zh_hans: 上次检测的芯片

source: (best Tick solution)
de: (beste Tick-Lösung)
fr: (meilleure solution de ticks)
it: (miglior soluzione in Tick)
ja: （最適なティックソリューション）
ro: (cea mai bună soluție de cicluri)
ru: (лучшее по тактам решение)
zh_hans: （最佳时钟周期解决方案）

source: Streamlined
de: Optimiert
fr: Optimisé
ja: 最適
ro: Raționalizat
ru: Оптимизировано
zh_hans: 精简

# CompactPP
source: Compact++
de: Kompakt++
it: Compatto++
ja: コンパクト++
ru: Компактно++
zh_hans: 紧凑++

source: Best Mos solution, click to compare
de: Klicke, um die beste MOS-Lösung zu vergleichen
fr: Meilleure solution de MOS, cliquez pour comparer. Clic droit pour définir à actuelle.
it: Miglior soluzione in MOS, clicca per confrontare
ja: 最適なMOSソリューション。クリックして比較。右クリックで現在の設定にします。
ro: Cea mai bună soluție MOS, faceți clic pentru a compara. Clic dreapta pentru a seta ca curent.
ru: Лучшее по количеству МОП решение, нажмите, чтобы сравнить. Правый клик, чтобы установить как текущее.
zh_hans: 最佳 MOS 数解决方案，点击比较。右键设为当前。

source: Fast
de: Schnell
fr: Rapide
it: Veloce
ja: 高速
ro: Rapid
ru: Быстро
zh_hans: 快速

source: None
de: Keine
fr: Aucun
it: Nome
ja: なし
ro: Niciunul
ru: Нет
zh_hans: 无

source: High
de: Hoch
fr: Élevé
it: Alto
ja: 高い
ro: Ridicat
ru: Много
zh_hans: 高

source: Slow
de: Langsam
fr: Lent
it: Lento
ja: 低速
ro: Lent
ru: Медленно
zh_hans: 缓慢

source: completed successfully.
de: erfolgreich abgeschlossen.
fr: complété.
it: completata con successo.
ja: 正常に完了しました。
ro: finalizat cu succes.
zh_hans: 成功完成。
