Repository: Elorth-HC/hardchip-localization
Catalog: src/Areas/HCDrives/Texts/HCDrivesTexts.*.resx
Languages: de, es, fr, it, ru, zh_hans

# NoHCDriveMessage
source: No HCDrive inserted! HCDrives are compressed files that contain chips, stages, and blueprints. Meant to be shared easily. Ensure a HCDrive file or link to a file is in the clipboard and press LOAD.
de: Kein HCDrive eingelegt! HCDrives sind komprimierte Dateien, die Chips, Stages und Blaupausen enthalten und sich leicht teilen lassen. Stell sicher, dass eine HCDrive-Datei oder ein Link zur Datei in der Zwischenablage ist, und drück LADEN.
es: ¡Ningún HCDrive insertado! Los HCDrive son archivos comprimidos que contienen chips, fases y planos. Están pensados para compartirse fácilmente. Asegúrate de que un archivo HCDrive o un enlace al archivo esté en el portapapeles y pulsa CARGAR.
fr: Aucun HCDrive inséré ! Les HCDrives sont des fichiers compressés qui contiennent des puces, des niveaux et des blueprints. Conçus pour être partagés facilement. Assurez-vous qu'un fichier HCDrive ou un lien vers un fichier se trouve dans le presse-papiers puis appuyez sur CHARGER.
it: Nessun HCDrive inserito! Gli HCDrive sono file compressi che contengono chip, fasi e progetti. Creati per essere condivisibili facilmente. Assicurati che un file HCDrive o un collegamento ad un file siano negli appunti e premi CARICA.
ru: Нет вставленного HCDrive! HCDrive - это сжатые файлы, содержащие чипы, уровни и чертежи. Предназначены для удобного обмена. Убедитесь, что файл HCDrive или ссылка на него находится в буфере обмена, и нажмите ЗАГРУЗИТЬ.
zh_hans: 未插入 HCDrive！ HCDrive 是包含芯片、关卡和蓝图的 压缩文件。便于轻松分享。 确保剪贴板中有 HCDrive 文件 或文件链接，然后按加载。

# LoadHCDriveFailedMessage
source: No valid HCDrive inserted! Ensure a HCDrive file is in the clipboard and press the Load button.
de: Ungültiges HCDrive eingelegt! Stell sicher, dass eine HCDrive-Datei in der Zwischenablage liegt und drück den Lade-Button.
es: ¡No se insertó un HCDrive válido! Asegúrate de que un archivo HCDrive esté en el portapapeles y pulsa el botón Cargar.
fr: HCDrive non valide inséré ! Assurez-vous qu'un fichier HCDrive se trouve dans le presse-papiers et appuyez sur le bouton CHARGER.
it: Nessun HCDrive valido inserito! Assicurati che un file HCDrive sia negli appunti e premi il pulsante carica.
ru: HCDrive не обнаружен! Убедитесь, что файл HCDrive находится в буфере обмена, и нажмите кнопку ЗАГРУЗИТЬ.
zh_hans: 未插入有效的 HCDrive！ 确保剪贴板中有 HCDrive 文件， 然后按加载按钮。

# StageToExportMessage
source: Community Stage ready to be exported: - Label: {0} - Description: {1} Press EXPORT to create a stage HCDrive.
de: Community-Stage bereit zum Exportieren: - Label: {0} - Beschreibung: {1} Drück EXPORT, um ein Stage-HCDrive zu erstellen.
es: Fase de la comunidad lista para exportar: - Etiqueta: {0} - Descripción: {1} Pulsa EXPORTAR para crear un HCDrive de fase.
fr: Niveau communautaire prêt à l'export : - Libellé : {0} - Description : {1} Appuyez sur EXPORTER pour créer un HCDrive de niveau.
it: La fase della community è pronto per essere importato: - Etichetta: {0} - Descrizione: {1} Premi ESPORTA per creare un HCDrive.
ru: Пользовательский уровень готов к экспортированию: - Название: {0} - Описание: {1} Нажмите ЭКСПОРТИРОВАТЬ, чтобы создать HCDrive с уровнем.
zh_hans: 社区关卡准备导出： - 标签：{0} - 描述：{1} 按导出创建关卡 HCDrive。

# ChipToExportMessage
source: Chip ready to be exported: - Label: {0} - Description: {1} Press EXPORT to create a chip HCDrive.
de: Chip bereit zum Exportieren: - Label: {0} - Beschreibung: {1} Drück EXPORT, um ein Chip-HCDrive zu erstellen.
es: Chip listo para exportar: - Etiqueta: {0} - Descripción: {1} Pulsa EXPORTAR para crear un HCDrive de chip.
fr: Puce prête à l'export : - Libellé : {0} - Description : {1} Appuyez sur EXPORTER pour créer un HCDrive de puce.
it: Chip pronto per essere esportato: - Etichetta: {0} - Descrizione: {1} Premi ESPORTA per creare un chip HCDrive.
ru: Чип готов к экспортированию: - Название: {0} - Описание: {1} Нажмите ЭКСПОРТИРОВАТЬ, чтобы создать HCDrive с чипом.
zh_hans: 芯片准备导出： - 标签：{0} - 描述：{1} 按导出创建芯片 HCDrive。

# BlueprintToExportMessage
source: Blueprint ready to be exported: - Label: {0} - Description: {1} Press EXPORT to create a blueprint HCDrive.
de: Blaupause bereit zum Exportieren: - Label: {0} - Beschreibung: {1} Drück EXPORT, um ein Blaupausen-HCDrive zu erstellen.
es: Plano listo para exportar: - Etiqueta: {0} - Descripción: {1} Pulsa EXPORTAR para crear un HCDrive de plano.
fr: Blueprint prêt à l'export : - Libellé : {0} - Description : {1} Appuyez sur EXPORTER pour créer un HCDrive de Blueprint.
it: Progetto pronto per essere esportato: - Etichetta: {0} - Descrizione: {1} Premi ESPORTA per creare un progetto HCDrive.
ru: Чертёж готов к экспортированию: - Название: {0} - Описание: {1} Нажмите ЭКСПОРТИРОВАТЬ, чтобы создать HCDrive с чертежом.
zh_hans: 蓝图准备导出： - 标签：{0} - 描述：{1} 按导出创建蓝图 HCDrive。

# StageToImportMessage
source: Valid HCDrive inserted. Community Stage detected: - Label: {0} - Description: {1} Press INSTALL to finalize installation of the stage.
de: Gültiges HCDrive eingelegt. Community-Stage erkannt: - Label: {0} - Beschreibung: {1} Drück INSTALLIEREN, um die Stage zu installieren.
es: HCDrive válido insertado. Fase de la comunidad detectada: - Etiqueta: {0} - Descripción: {1} Pulsa INSTALAR para finalizar la instalación de la fase.
fr: HCDrive valide inséré. Niveau communautaire détecté : - Libellé : {0} - Description : {1} Appuyez sur INSTALLER pour finaliser l'installation du niveau.
it: HCDrive valido inserito. Fase della community rilevata: - Etichetta: {0} - Descrizione: {1} Premi INSTALLA per completare l'installazione.
ru: HCDrive вставлен. Найден пользовательский уровень: - Название: {0} - Описание: {1} Нажмите УСТАНОВИТЬ, чтобы завершить установку уровня.
zh_hans: 已插入有效的 HCDrive。检测到社区关卡： - 标签：{0} - 描述：{1} 按安装完成关卡的安装。

# ChipToImportMessage
source: Valid HCDrive inserted. Chip detected: - Label: {0} - Description: {1} Press INSTALL to finalize installation of the chip.
de: Gültiges HCDrive eingelegt. Chip erkannt: - Label: {0} - Beschreibung: {1} Drück INSTALLIEREN, um den Chip zu installieren.
es: HCDrive válido insertado. Chip detectado: - Etiqueta: {0} - Descripción: {1} Pulsa INSTALAR para finalizar la instalación del chip.
fr: HCDrive valide inséré. Puce détectée : - Libellé : {0} - Description : {1} Appuyez sur INSTALLER pour finaliser l'installation de la puce.
it: HCDrive valido inserito. Chip rilevato: - Etichetta: {0} - Descrizione: {1} Premi INSTALLA per completare l'installazione del chip.
ru: HCDrive вставлен. Найден чип: - Название: {0} - Описание: {1} Нажмите УСТАНОВИТЬ, чтобы завершить установку чипа.
zh_hans: 已插入有效的 HCDrive。检测到芯片： - 标签：{0} - 描述：{1} 按安装完成芯片的安装。

# BlueprintToImportMessage
source: Valid HCDrive inserted. Blueprint detected: - Label: {0} - Description: {1} Press INSTALL to finalize installation of the blueprint.
de: Gültiges HCDrive eingelegt. Blaupause erkannt: - Label: {0} - Beschreibung: {1} Drück INSTALLIEREN, um die Blaupause zu installieren.
es: HCDrive válido insertado. Plano detectado: - Etiqueta: {0} - Descripción: {1} Pulsa INSTALAR para finalizar la instalación del plano.
fr: HCDrive valide inséré. Blueprint détecté : - Libellé : {0} - Description : {1} Appuyez sur INSTALLER pour finaliser l'installation du Blueprint.
it: HCDrive valido inserito. Progetto rilevato: - Etichetta: {0} - Descrizione: {1} Premi INSTALLA per completare l'installazione del progetto.
ru: HCDrive вставлен. Найден чертёж: - Название: {0} - Описание: {1} Нажмите УСТАНОВИТЬ, чтобы завершить установку чертежа.
zh_hans: 已插入有效的 HCDrive。检测到蓝图： - 标签：{0} - 描述：{1} 按安装完成蓝图的安装。

# ExportSuccessMessage
source: Export successful. A new HCDrive is in the clipboard! You can now share it by pasting it in explorer or any other software supporting image content.
de: Export erfolgreich. Ein neues HCDrive befindet sich in der Zwischenablage! Du kannst es jetzt teilen, indem du es in einen Explorer oder jede andere Software einfügst, die Bild- inhalte unterstützt.
es: Exportación completada. ¡Un nuevo HCDrive está en el portapapeles! Ahora puedes compartirlo pegándolo en el explorador o en cualquier otro programa que admita pegar archivos.
fr: Export réussi. Un nouveau HCDrive est dans le presse-papiers ! Vous pouvez le partager en le collant dans un explorateur ou tout autre logiciel acceptant le contenu image.
it: Esportazione avvenuta con successo. Un nuovo HCDrive è negli appunti! Ora puoi condividerlo incollandolo su Esplora Risorse o qualsiasi altro programma che supporti le immagini.
ru: Экспортирование успешно завершено. Новый HCDrive уже в буфере обмена! Теперь Вы можете поделиться им, вставив его в проводник или любое другое приложение, поддерживающее вставку изображений.
zh_hans: 导出成功。 新的 HCDrive 已在剪贴板中！你现在可以 通过粘贴到资源管理器或任何其他 支持图像内容的软件来分享它。

# InstallFailedMessage
source: Installation failed. HCDrive content might be corrupted or incompatible.
de: Installation fehlgeschlagen. Der HCDrive-Inhalt könnte beschädigt oder inkompatibel sein.
es: Instalación fallida. El contenido del HCDrive podría estar dañado o ser incompatible.
fr: Installation échouée. Le contenu du HCDrive est peut-être corrompu ou incompatible.
it: Installazione fallita. Il contenuto dell'HCDrive potrebbe essere corrotto o incompatibile.
ru: Установка не удалась. Содержимое HCDrive может быть повреждено или несовместимо.
zh_hans: 安装失败。 HCDrive 内容可能已损坏或不兼容。

# InstallSuccessMessage
source: Installation successful. HCDrive content has been installed!
de: Installation erfolgreich. HCDrive-Inhalt wurde installiert!
es: Instalación completada. ¡El contenido del HCDrive se ha instalado!
fr: Installation réussie. Le contenu du HCDrive a été installé !
it: Installazione avvenuta con successo. Il contenuto dell'HCDrive è stato installato!
ru: Установка успешно завершена. Содержимое HCDrive установлено!
zh_hans: 安装成功。 HCDrive 内容已安装！
