Repository: Elorth-HC/hardchip-localization
Catalog: src/Areas/Campaign/Texts/FabricatorTerminalTexts.*.resx
Languages: de, es, fr, it, ja, ro, ru, zh_hans

# GenericFabricateLog
source: g90Initiating fabrication sequence for [CHIPNAME] chip... g90 g90Loading design specifications from database... [OK] g90Design verification and compliance check... [OK] g90Preparing silicon wafer... [OK] g94Applying photoresist layer... [OK] g90 g90Starting lithography process for base layer... g92UV exposure complete... [OK] g93Developing photoresist... [OK] g93High-temperature annealing... [OK] g90 g90Final lithography for top metal layer... g91UV exposure and development... [OK] g92Final etching and cleaning... [OK] g90 g90Assembly of chip onto package... g92Wire bonding of chip leads... [OK] g93Encapsulation and curing... [OK] g90Packaging and labeling... [OK] g90 g92Fabrication process complete. g90 g90[CHIPNAME] chip is ready. g90Fabrication log saved. Batch ID: 2224A[BATCHID]X.
de: g90Starte Fertigungssequenz für [CHIPNAME]-Chip... g90 g90Lade Designspezifikationen aus Datenbank... [OK] g90Entwurfsprüfung und Konformitätskontrolle... [OK] g90Bereite Siliziumwafer vor... [OK] g94Trage Photoresistschicht auf... [OK] g90 g90Starte Lithografieprozess für Basisschicht... g92UV-Belichtung abgeschlossen... [OK] g93Entwickle Photoresist... [OK] g93Hochtemperatur-Tempern... [OK] g90 g90Abschließende Lithografie für obere Metallschicht... g91UV-Belichtung und Entwicklung... [OK] g92Endätzung und Reinigung... [OK] g90 g90Montiere Chip auf Paket... g92Drahtbonden der Chipkontakte... [OK] g93Verguss und Aushärtung... [OK] g90Verpacken und Etikettieren... [OK] g90 g92Fertigungsprozess abgeschlossen. g90 g90[CHIPNAME]-Chip ist bereit. g90Fertigungsprotokoll gespeichert. Chargen-ID: 2224A[BATCHID]X.
es: g90Iniciando secuencia de fabricación para chip [CHIPNAME]... g90 g90Cargando especificaciones de diseño de la base de datos... [OK] g90Verificación de diseño y comprobación de cumplimiento... [OK] g90Preparando oblea de silicio... [OK] g94Aplicando capa de fotorresistencia... [OK] g90 g90Iniciando proceso de litografía para capa base... g92Exposición UV completada... [OK] g93Revelado de fotorresistencia... [OK] g93Recocido a alta temperatura... [OK] g90 g90Litografía final para capa metálica superior... g91Exposición UV y revelado... [OK] g92Grabado final y limpieza... [OK] g90 g90Montaje del chip en el encapsulado... g92Soldadura de cables del chip... [OK] g93Encapsulado y curado... [OK] g90Empaquetado y etiquetado... [OK] g90 g92Proceso de fabricación completado. g90 g90Chip [CHIPNAME] está listo. g90Registro de fabricación guardado. ID de lote: 2224A[BATCHID]X.
fr: g90Initialisation de la séquence de fabrication pour la puce [CHIPNAME]... g90 g90Chargement des spécifications de conception depuis la base de données... [OK] g90Vérification de la conception et contrôle de conformité... [OK] g90Préparation de la tranche de silicium... [OK] g94Application de la couche de photorésine... [OK] g90 g90Démarrage du processus de lithographie pour la couche de base... g92Exposition UV terminée... [OK] g93Développement de la photorésine... [OK] g93Recuit à haute température... [OK] g90 g90Lithographie finale pour la couche métallique supérieure... g91Exposition UV et développement... [OK] g92Gravure finale et nettoyage... [OK] g90 g90Assemblage de la puce sur le boîtier... g92Connexion des fils de la puce... [OK] g93Encapsulation et polymérisation... [OK] g90Conditionnement et étiquetage... [OK] g90 g92Processus de fabrication terminé. g90 g90La puce [CHIPNAME] est prête. g90Journal de fabrication sauvegardé. Numéro de lot : 2224A[BATCHID]X.
it: g90Inizzializzazione sequenza di fabbricazione per il chip [CHIPNAME]... g90 g90Caricamento specifiche del progetto dal database... [OK] g90Verifica del progetto controllo di conformità... [OK] g90Preparazione wafer di silicio... [OK] g94Applicazione strato di fotoresistore... [OK] g90 g90Inizio processo di litografia per lo strato di base... g92Esposizione UV completata... [OK] g93Sviluppo fotoresistore... [OK] g93Trattamento ad alta temperatura... [OK] g90 g90Litografia finale per lo strato metallico superiore... g91Esposizione UV finale e sviluppo... [OK] g92Incisione finale e pulizia... [OK] g90 g90Assemblaggio del chip nella confezione... g92Collegamento dei fili ai conduttori del chip... [OK] g93Incapsulazione e indurimento... [OK] g90Imballaggio ed etichettamento... [OK] g90 g92Processo di fabbricazione completato. g90 g90Il chip [CHIPNAME] è pronto. g90Registro di fabbricazione salvato. ID Lotto: 2224A[BATCHID]X.
ja: g90[CHIPNAME]チップの製造シーケンスを開始しています... g90 g90データベースから設計仕様を読み込み中... [OK] g90設計検証および適合性チェック... [OK] g90シリコンウェハを準備中... [OK] g94フォトレジスト層を塗布中... [OK] g90 g90ベース層のリソグラフィ工程を開始しています... g92UV露光完了... [OK] g93フォトレジストを現像中... [OK] g93高温アニール... [OK] g90 g90上部金属層の最終リソグラフィ... g91UV露光および現像... [OK] g92最終エッチングおよび洗浄... [OK] g90 g90チップをパッケージに実装中... g92チップ端子のワイヤボンディング... [OK] g93封止および硬化... [OK] g90梱包およびラベリング... [OK] g90 g92製造プロセスが完了しました。 g90 g90[CHIPNAME]チップの準備ができました。 g90製造ログを保存しました。バッチID: 2224A[BATCHID]X。
ro: g90Inițiere secvență de fabricație pentru cipul [CHIPNAME]... g90 g90Încărcare specificații de design din baza de date... [OK] g90Verificarea designului și controlul conformității... [OK] g90Pregătire wafer de siliciu... [OK] g94Aplicare strat de fotoresistat... [OK] g90 g90Începerea procesului de litografie pentru stratul de bază... g92Expunere UV completă... [OK] g93Developare fotoresistat... [OK] g93Recoacere la temperatură înaltă... [OK] g90 g90Litografia finală pentru stratul metalic superior... g91Expunere UV și developare... [OK] g92Gravare finală și curățare... [OK] g90 g90Asamblarea cipului pe pachet... g92Legarea cu fire a terminalelor cipului... [OK] g93Încapsulare și întărire... [OK] g90Ambalare și etichetare... [OK] g90 g92Procesul de fabricație finalizat. g90 g90Cipul [CHIPNAME] este gata. g90Jurnalul de fabricație salvat. ID lot: 2224A[BATCHID]X.
ru: g90Запуск процесса производства чипа [CHIPNAME]... g90 g90Загрузка спецификаций из базы данных... [OK] g90Проверка дизайна и соответствия требованиям... [OK] g90Подготовка кремниевой пластины... [OK] g94Нанесение фоторезиста... [OK] g90 g90Начало процесса литографии для базового слоя... g92УФ-облучение завершено... [OK] g93Проявка фоторезиста... [OK] g93Высокотемпературный отжиг... [OK] g90 g90Финальная литография для верхнего металлического слоя... g91УФ-облучение и проявка... [OK] g92Финальная травка и очистка... [OK] g90 g90Сборка микросхемы... g92Установка контактных выводов... [OK] g93Инкапсуляция и отверждение... [OK] g90Упаковка и маркировка... [OK] g90 g92Процесс производства завершен. g90 g90Чип [CHIPNAME] готов. g90Журнал производства сохранен. Номер партии: 2224A[BATCHID]X.
zh_hans: g90正在启动 [CHIPNAME] 芯片的制造序列... g90 g90从数据库加载设计规格... [正常] g90设计验证和合规检查... [正常] g90准备硅晶圆... [正常] g94涂覆光刻胶层... [正常] g90 g90开始基层光刻工艺... g92紫外线曝光完成... [正常] g93显影光刻胶... [正常] g93高温退火... [正常] g90 g90顶层金属层最终光刻... g91紫外线曝光和显影... [正常] g92最终蚀刻和清洗... [正常] g90 g90将芯片组装到封装上... g92芯片引线键合... [正常] g93封装和固化... [正常] g90包装和标签... [正常] g90 g92制造流程完成。 g90 g90[CHIPNAME] 芯片已就绪。 g90制造日志已保存。批次 ID: 2224A[BATCHID]X.

# LookAtChip
source: g99 r90ERROR_CODE: ?x?????? look on top of the fabricator table
de: g99 r90ERROR_CODE: ?x?????? schau auf den Fabrikator-Tisch
es: g99 r90ERROR_CODE: ?x?????? mira encima de la mesa del fabricador
fr: g99 r90CODE_ERREUR : ?x?????? regarde sur le dessus de la table du fabricateur
it: g99 r90CODICE_ERRORE: ?x?????? guarda sopra il tavolo del fabbricatore
ja: g99 r90エラーコード: ?x?????? ファブリケーターのテーブルの上を見てください
ro: g99 r90ERROR_CODE: ?x?????? privește pe partea de sus a mesei fabricatorului
ru: g99 r90КОД_ОШИБКИ: ?x?????? посмотрите на поверхность стола фабрикатора
zh_hans: g99 r90ERROR_CODE: ?x?????? 看制造机台面上方
