Repository: Elorth-HC/hardchip-localization
Catalog: src/Areas/Campaign/Texts/FabricatorTerminalTexts.*.resx
Languages: de, es, fr, it, ja, ro, ru, zh_hans

# FirstScreenEver
source: g90========================================================================= g90Autonomous Fabricator v546.1.7430 g90========================================================================= g90 g96Booting up... g90 g92Power System [OK] g92Physical Integrity [OK] g92Core Systems [OK] g92External control interfaces... [OK] r95Material Bank 1 [OFFLINE] r95Material Bank 2 [OFFLINE] g90 y95WARNING: Material banks unavailable. Buffered materials available for limited operations only. g90 g39Boot sequence complete. Fabricator status: PARTIALLY OPERATIONAL g90 g90Received design specifications for BYPASS chip. g90Ready to start fabrication process.
de: g90========================================================================= g90Autonomer Fabrikator v546.1.7430 g90========================================================================= g90 g96Starte... g90 g92Stromversorgung [OK] g92Strukturelle Integrität [OK] g92Kernsysteme [OK] g92Externe Steuerungsschnittstellen... [OK] r95Materialbank 1 [OFFLINE] r95Materialbank 2 [OFFLINE] g90 y95WARNUNG: Materialbanken nicht verfügbar. Gepufferte Materialien nur für eingeschränkte Vorgänge verfügbar. g90 g39Startsequenz abgeschlossen. Fabrikatorstatus: TEILWEISE BETRIEBSBEREIT g90 g90Designspezifikationen für BYPASS-Chip empfangen. g90Bereit, den Fertigungsprozess zu starten.
es: g90========================================================================= g90Autonomous Fabricator v546.1.7430 g90========================================================================= g90 g96Iniciando... g90 g92Power System [OK] g92Physical Integrity [OK] g92Core Systems [OK] g92External control interfaces... [OK] r95Material Bank 1 [OFFLINE] r95Material Bank 2 [OFFLINE] g90 y95ADVERTENCIA: Bancos de material no disponibles. Materiales en búfer disponibles solo para operaciones limitadas. g90 g39Secuencia de arranque completada. Estado del fabricador: PARCIALMENTE OPERATIVO g90 g90Especificaciones de diseño recibidas para chip BYPASS. g90Listo para iniciar el proceso de fabricación.
fr: g90========================================================================= g90Fabricateur autonome v546.1.7430 g90========================================================================= g90 g96Démarrage en cours... g90 g92Système d'alimentation [OK] g92Intégrité physique [OK] g92Systèmes centraux [OK] g92Interfaces de contrôle externes... [OK] r95Banque de matériaux 1 [HORS LIGNE] r95Banque de matériaux 2 [HORS LIGNE] g90 y95AVERTISSEMENT : banques de matériaux indisponibles. Matériaux mis en mémoire tampon disponibles uniquement pour des opérations limitées. g90 g39Séquence de démarrage terminée. État du fabricateur : PARTIELLEMENT OPÉRATIONNEL g90 g90Spécifications de conception reçues pour la puce BYPASS. g90Prêt à démarrer le processus de fabrication.
it: g90========================================================================= g90Fabbricatore autonomo v546.1.7430 g90========================================================================= g90 g96Accensione... g90 g92Sistemi di alimentazione [OK] g92Integrità fisica [OK] g92Sistemi primari [OK] g92Interfaccia di controllo esterna... [OK] r95Banca materiali 1 [OFFLINE] r95Banca materiali 2 [OFFLINE] g90 y95ATTENZIONE: Banche materiali non disponibili. Materiali di scorta disponibili solo per operazioni limitate. g90 g39Sequenza di accensione completata. Stato fabbricatore: PARZIALMENTE OPERATIVO g90 g90Ricevute specifiche per il progetto del chip BYPASS . g90Pronto per cominciare il processo di fabbricazione.
ja: g90========================================================================= g90自律型ファブリケーター v546.1.7430 g90========================================================================= g90 g96起動中... g90 g92電源システム [OK] g92物理的完全性 [OK] g92コアシステム [OK] g92外部制御インターフェース... [OK] r95マテリアルバンク 1 [オフライン] r95マテリアルバンク 2 [オフライン] g90 y95警告: マテリアルバンクが利用できません。バッファ済みマテリアルは限定的な操作にのみ使用可能です。 g90 g39起動シーケンス完了。ファブリケーター状態: 部分稼働 g90 g90BYPASSチップの設計仕様を受信しました。 g90製造プロセスを開始する準備ができました。
ro: g90========================================================================= g90Fabricator Autonom v546.1.7430 g90========================================================================= g90 g96Pornire în curs... g90 g92Sistem de Alimentare [OK] g92Integritate Fizică [OK] g92Sisteme de Bază [OK] g92Interfețe de control extern... [OK] r95Bancă de Materiale 1 [OFFLINE] r95Bancă de Materiale 2 [OFFLINE] g90 y95AVERTISMENT: Băncile de materiale indisponibile. Materiale din buffer disponibile doar pentru operațiuni limitate. g90 g39Secvența de pornire completă. Starea fabricatorului: PARȚIAL OPERAȚIONAL g90 g90S-au primit specificațiile de design pentru cipul BYPASS. g90Gata să înceapă procesul de fabricație.
ru: g90========================================================================= g90Автономный Фабрикатор v546.1.7430 g90========================================================================= g90 g96Загрузка... g90 g92Энергосистема [OK] g92Физическая целостность [OK] g92Основные системы [OK] g92Внешние интерфейсы управления... [OK] r95Хранилище Материалов 1 [ОТКЛЮЧЕНО] r95Хранилище Материалов 2 [ОТКЛЮЧЕНО] g90 y95ПРЕДУПРЕЖДЕНИЕ: Хранилища Материалов недоступны. Имеющиеся материалы доступны только для ограниченных операций. g90 g39Процесс загрузки завершен. Статус фабрикатора: ЧАСТИЧНО РАБОТАЕТ g90 g90Получены спецификации для чипа BYPASS. g90Готов к запуску процесса производства.
zh_hans: g90========================================================================= g90Autonomous Fabricator v546.1.7430 g90========================================================================= g90 g96正在启动... g90 g92电源系统 [正常] g92物理完整性 [正常] g92核心系统 [正常] g92外部控制接口... [正常] r95材料库 1 [离线] r95材料库 2 [离线] g90 y95警告：材料库不可用。仅有缓冲材料可用于有限操作。 g90 g39启动序列完成。制造机状态：部分运行 g90 g90已收到 BYPASS 芯片的设计规格。 g90准备开始制造流程。

# StatusStep0
source: g90Running diagnostics... g90 g91Autonomous Fabricator v546.1.7430 g92 Power System [OK] g92 Physical Integrity [OK] g92 Core Systems [OK] r95 Material Bank 1 [OFFLINE] r95 Material Bank 2 [OFFLINE] g90 y95WARNING: Material banks unavailable. Buffered materials available for limited operations only. g90 g39Fabricator status: PARTIALLY OPERATIONAL
de: g90Führe Diagnose aus... g90 g91Autonomer Fabrikator v546.1.7430 g92 Stromversorgung [OK] g92 Strukturelle Integrität [OK] g92 Kernsysteme [OK] r95 Materialbank 1 [OFFLINE] r95 Materialbank 2 [OFFLINE] g90 y95WARNUNG: Materialbanken nicht verfügbar. Gepufferte Materialien nur für eingeschränkte Vorgänge verfügbar. g90 g39Fabrikatorstatus: TEILWEISE BETRIEBSBEREIT
es: g90Ejecutando diagnóstico... g90 g91Fabricador Autónomo v546.1.7430 g91Autonomous Fabricator v546.1.7430 g92 Power System [OK] g92 Physical Integrity [OK] g92 Core Systems [OK] r95 Material Bank 1 [OFFLINE] r95 Material Bank 2 [OFFLINE] g90 y95ADVERTENCIA: Bancos de material no disponibles. Materiales en búfer disponibles solo para operaciones limitadas. g90 g39Estado del fabricador: PARCIALMENTE OPERATIVO
fr: g90Diagnostic en cours... g90 g91Fabricateur autonome v546.1.7430 g92 Système d'alimentation [OK] g92 Intégrité physique [OK] g92 Systèmes centraux [OK] r95 Banque de matériaux 1 [HORS LIGNE] r95 Banque de matériaux 2 [HORS LIGNE] g90 y95AVERTISSEMENT : banques de matériaux indisponibles. Matériaux mis en mémoire tampon disponibles uniquement pour des opérations limitées. g90 g39État du fabricateur : PARTIELLEMENT OPÉRATIONNEL
it: g90Avvio diagnostica... g90 g91Fabbricatore autonomo v546.1.7430 g92Sistemi di alimentazione [OK] g92Integrità fisica [OK] g92Sistemi primari [OK] r95Banca materiali 1 [OFFLINE] r95Banca materiali 2 [OFFLINE] g90 y95ATTENZIONE: Banche materiali non disponibili. Materiali di scorta disponibili solo per operazioni limitate. g90 g39Stato fabbricatore: PARZIALMENTE OPERATIVO
ja: g90診断を実行中... g90 g91自律型ファブリケーター v546.1.7430 g92 電源システム [OK] g92 物理的完全性 [OK] g92 コアシステム [OK] r95 マテリアルバンク 1 [オフライン] r95 マテリアルバンク 2 [オフライン] g90 y95警告: マテリアルバンクは利用できません。バッファ済みマテリアルは限定的な操作にのみ使用可能です。 g90 g39ファブリケーター状態: 部分的に稼働中
ro: g90Rulare diagnostice... g90 g91Fabricator Autonom v546.1.7430 g92 Sistem de Alimentare [OK] g92 Integritate Fizică [OK] g92 Sisteme de Bază [OK] r95 Bancă de Materiale 1 [OFFLINE] r95 Bancă de Materiale 2 [OFFLINE] g90 y95AVERTISMENT: Băncile de materiale indisponibile. Materiale din buffer disponibile doar pentru operațiuni limitate. g90 g39Starea fabricatorului: PARȚIAL OPERAȚIONAL
ru: g90Запуск диагностики... g90 g91Автономный Фабрикатор v546.1.7430 g92 Энергосистема [OK] g92 Физическая целостность [OK] g92 Основные системы [OK] r95 Хранилище Материалов 1 [ОТКЛЮЧЕНО] r95 Хранилище Материалов 2 [ОТКЛЮЧЕНО] g90 y95ПРЕДУПРЕЖДЕНИЕ: Хранилища Материалов недоступны. Имеющиеся материалы доступны только для ограниченных операций. g90 g39Статус фабрикатора: ЧАСТИЧНО РАБОТАЕТ
zh_hans: g90正在运行诊断... g90 g91Autonomous Fabricator v546.1.7430 g92 电源系统 [正常] g92 物理完整性 [正常] g92 核心系统 [正常] r95 材料库 1 [离线] r95 材料库 2 [离线] g90 y95警告：材料库不可用。仅有缓冲材料可用于有限操作。 g90 g39制造机状态：部分运行

# StatusStep1
source: g90Running diagnostics... g90 g91Autonomous Fabricator v546.1.7430 g92 Power System [OK] g92 Physical Integrity [OK] g92 Core Systems [OK] g92 Material Bank 1 [ONLINE] r95 Material Bank 2 [OFFLINE] g90 y95WARNING: Material Bank 2 unavailable. Limited operations only. g90 g39Fabricator status: PARTIALLY OPERATIONAL
de: g90Führe Diagnose aus... g90 g91Autonomer Fabrikator v546.1.7430 g92 Stromversorgung [OK] g92 Strukturelle Integrität [OK] g92 Kernsysteme [OK] g92 Materialbank 1 [ONLINE] r95 Materialbank 2 [OFFLINE] g90 y95WARNUNG: Materialbank 2 nicht verfügbar. Vorgänge eingeschränkt. g90 g39Fabrikatorstatus: TEILWEISE BETRIEBSBEREIT
es: g90Ejecutando diagnóstico... g90 g91Autonomous Fabricator v546.1.7430 g92 Power System [OK] g92 Physical Integrity [OK] g92 Core Systems [OK] g92 Material Bank 1 [ONLINE] r95 Material Bank 2 [OFFLINE] g90 y95ADVERTENCIA: Banco de Material 2 no disponible. Solo operaciones limitadas. g90 g39Estado del fabricador: PARCIALMENTE OPERATIVO
fr: g90Diagnostic en cours... g90 g91Fabricateur autonome v546.1.7430 g92 Système d'alimentation [OK] g92 Intégrité physique [OK] g92 Systèmes centraux [OK] g92 Banque de matériaux 1 [EN LIGNE] r95 Banque de matériaux 2 [HORS LIGNE] g90 y95AVERTISSEMENT : Banque de matériaux 2 indisponible. Opérations limitées uniquement. g90 g39État du fabricateur : PARTIELLEMENT OPÉRATIONNEL
it: g90Avvio diagnostica... g90 g91Fabbricatore autonomo v546.1.7430 g92Sistemi di alimentazione [OK] g92Integrità fisica [OK] g92Sistemi primari [OK] g92Banca materiali 1 [ONLINE] r95Banca materiali 2 [OFFLINE] g90 y95ATTENZIONE: Banca materiali 2 non disponibile. Solo operazioni limitate. g90 g39Stato fabbricatore: PARZIALMENTE OPERATIVO
ja: g90診断を実行中... g90 g91自律型ファブリケーター v546.1.7430 g92 電源システム [OK] g92 機体の完全性 [OK] g92 コアシステム [OK] g92 マテリアルバンク 1 [オンライン] r95 マテリアルバンク 2 [オフライン] g90 y95警告: マテリアルバンク 2 は利用できません。限定的な操作のみ可能です。 g90 g39ファブリケーターの状態: 部分稼働中
ro: g90Rulare diagnostice... g90 g91Fabricator Autonom v546.1.7430 g92 Sistem de Alimentare [OK] g92 Integritate Fizică [OK] g92 Sisteme de Bază [OK] g92 Bancă de Materiale 1 [ONLINE] r95 Bancă de Materiale 2 [OFFLINE] g90 y95AVERTISMENT: Banca de Materiale 2 indisponibilă. Doar operațiuni limitate. g90 g39Starea fabricatorului: PARȚIAL OPERAȚIONAL
ru: g90Запуск диагностики... g90 g91Автономный Фабрикатор v546.1.7430 g92 Энергосистема [OK] g92 Физическая целостность [OK] g92 Основные системы [OK] g92 Хранилище Материалов 1 [РАБОТАЕТ] r95 Хранилище Материалов 2 [ОТКЛЮЧЕНО] g90 y95ПРЕДУПРЕЖДЕНИЕ: Хранилище Материалов 2 недоступно. Доступны только ограниченные операции. g90 g39Статус фабрикатора: ЧАСТИЧНО РАБОТАЕТ
zh_hans: g90正在运行诊断... g90 g91Autonomous Fabricator v546.1.7430 g92 电源系统 [正常] g92 物理完整性 [正常] g92 核心系统 [正常] g92 材料库 1 [在线] r95 材料库 2 [离线] g90 y95警告：材料库 2 不可用。仅限有限操作。 g90 g39制造机状态：部分运行

# StatusStep0Shorted
source: r95Material Bank 1 [OFFLINE] r95Material Bank 2 [OFFLINE] g90Fabricator status: PARTIALLY OPERATIONAL
de: r95Materialbank 1 [OFFLINE] r95Materialbank 2 [OFFLINE] g90Fabrikatorstatus: TEILWEISE BETRIEBSBEREIT
fr: r95Banque de matériaux 1 [HORS LIGNE] r95Banque de matériaux 2 [HORS LIGNE] g90État du fabricateur : PARTIELLEMENT OPÉRATIONNEL
it: r95Banca materiali 1 [OFFLINE] r95Banca materiali 2 [OFFLINE] g90Stato fabbricatore: PARZIALMENTE OPERATIVO
ja: r95マテリアルバンク 1 [オフライン] r95マテリアルバンク 2 [オフライン] g90ファブリケーターのステータス: 部分的に稼働中
ro: r95Bancă de Materiale 1 [OFFLINE] r95Bancă de Materiale 2 [OFFLINE] g90Starea fabricatorului: PARȚIAL OPERAȚIONAL
ru: r95Хранилище Материалов 1 [ОТКЛЮЧЕНО] r95Хранилище Материалов 2 [ОТКЛЮЧЕНО] g90Статус фабрикатора: ЧАСТИЧНО РАБОТАЕТ
zh_hans: r95材料库 1 [离线] r95材料库 2 [离线] g90制造机状态：部分运行

# StatusStep1Shorted
source: g92Material Bank 1 [ONLINE] r95Material Bank 2 [OFFLINE] g90Fabricator status: PARTIALLY OPERATIONAL
de: g92Materialbank 1 [ONLINE] r95Materialbank 2 [OFFLINE] g90Fabrikatorstatus: TEILWEISE BETRIEBSBEREIT
es: g92Banco de Material 1 [EN LÍNEA] r95Banco de Material 2 [FUERA DE LÍNEA] g90Estado del fabricador: PARCIALMENTE OPERATIVO
fr: g92Banque de matériaux 1 [EN LIGNE] r95Banque de matériaux 2 [HORS LIGNE] g90État du fabricateur : PARTIELLEMENT OPÉRATIONNEL
it: g92Banca materiali 1 [ONLINE] r95Banca materiali 2 [OFFLINE] g90Stato fabbricatore: PARZIALMENTE OPERATIVO
ja: g92マテリアルバンク 1 [オンライン] r95マテリアルバンク 2 [オフライン] g90ファブリケーターのステータス: 部分的に稼働中
ro: g92Bancă de Materiale 1 [ONLINE] r95Bancă de Materiale 2 [OFFLINE] g90Starea fabricatorului: PARȚIAL OPERAȚIONAL
ru: g92Хранилище Материалов 1 [РАБОТАЕТ] r95Хранилище Материалов 2 [ОТКЛЮЧЕНО] g90Статус фабрикатора: ЧАСТИЧНО РАБОТАЕТ
zh_hans: g92材料库 1 [在线] r95材料库 2 [离线] g90制造机状态：部分运行

# StatusStep2Shorted
source: g92Material Bank 1 [ONLINE] g92Material Bank 2 [ONLINE] g90Fabricator status: OPERATIONAL
de: g92Materialbank 1 [ONLINE] g92Materialbank 2 [ONLINE] g90Fabrikatorstatus: BETRIEBSBEREIT
fr: g92Banque de matériaux 1 [EN LIGNE] g92Banque de matériaux 2 [EN LIGNE] g90État du fabricateur : OPÉRATIONNEL
it: g92Banca materiali 1 [ONLINE] g95Banca materiali 2 [ONLINE] g39Stato fabbricatore: OPERATIVO
ja: g92マテリアルバンク 1 [オンライン] g92マテリアルバンク 2 [オンライン] g90ファブリケーターのステータス: 稼働中
ro: g92Bancă de Materiale 1 [ONLINE] g92Bancă de Materiale 2 [ONLINE] g90Starea fabricatorului: OPERAȚIONAL
ru: g92Хранилище Материалов 1 [РАБОТАЕТ] g92Хранилище Материалов 2 [РАБОТАЕТ] g90Статус фабрикатора: РАБОТАЕТ
zh_hans: g92材料库 1 [在线] g92材料库 2 [在线] g90制造机状态：运行正常

# StatusStep2
source: g90Running diagnostics... g90 g91Autonomous Fabricator v546.1.7430 g92 Power System [OK] g92 Physical Integrity [OK] g92 Core Systems [OK] g92 Material Bank 1 [ONLINE] g95 Material Bank 2 [ONLINE] g90 g39Fabricator status: OPERATIONAL
de: g90Führe Diagnose aus... g90 g91Autonomer Fabrikator v546.1.7430 g92 Stromversorgung [OK] g92 Strukturelle Integrität [OK] g92 Kernsysteme [OK] g92 Materialbank 1 [ONLINE] g95 Materialbank 2 [ONLINE] g90 g39Fabrikatorstatus: BETRIEBSBEREIT
es: g90Ejecutando diagnóstico... g90 g91Autonomous Fabricator v546.1.7430 g92 Power System [OK] g92 Physical Integrity [OK] g92 Core Systems [OK] g92 Material Bank 1 [ONLINE] g95 Material Bank 2 [ONLINE] g90 g39Fabricator status: OPERATIONAL
fr: g90Diagnostic en cours... g90 g91Fabricateur autonome v546.1.7430 g92 Système d'alimentation [OK] g92 Intégrité physique [OK] g92 Systèmes centraux [OK] g92 Banque de matériaux 1 [EN LIGNE] g95 Banque de matériaux 2 [EN LIGNE] g90 g39État du fabricateur : OPÉRATIONNEL
it: g90Avvio diagnostica... g90 g91Fabbricatore autonomo v546.1.7430 g92Sistemi di alimentazione [OK] g92Integrità fisica [OK] g92Sistemi primari [OK] g92Banca materiali 1 [ONLINE] g95Banca materiali 2 [ONLINE] g90 g39Stato fabbricatore: OPERATIVO
ja: g90診断を実行中... g90 g91自律型ファブリケーター v546.1.7430 g92 電源システム [OK] g92 物理的完全性 [OK] g92 コアシステム [OK] g92 マテリアルバンク 1 [オンライン] g95 マテリアルバンク 2 [オンライン] g90 g39ファブリケーターのステータス: 稼働中
ro: g90Rulare diagnostice... g90 g91Fabricator Autonom v546.1.7430 g92 Sistem de Alimentare [OK] g92 Integritate Fizică [OK] g92 Sisteme de Bază [OK] g92 Bancă de Materiale 1 [ONLINE] g95 Bancă de Materiale 2 [ONLINE] g90 g39Starea fabricatorului: OPERAȚIONAL
ru: g90Запуск диагностики... g90 g91Автономный Фабрикатор v546.1.7430 g92 Энергосистема [OK] g92 Физическая целостность [OK] g92 Основные системы [OK] g92 Хранилище Материалов 1 [РАБОТАЕТ] g95 Хранилище Материалов 2 [РАБОТАЕТ] g90 g39Статус фабрикатора: РАБОТАЕТ
zh_hans: g90正在运行诊断... g90 g91Autonomous Fabricator v546.1.7430 g92 电源系统 [正常] g92 物理完整性 [正常] g92 核心系统 [正常] g92 材料库 1 [在线] g95 材料库 2 [在线] g90 g39制造机状态：运行正常

# FabricateMore
source: g90Fabrication process complete.
de: g90Fertigungsprozess abgeschlossen.
es: g90Proceso de fabricación completado.
fr: g90Processus de fabrication terminé.
it: g90Processo di fabbricazione completato.
ja: g90製造プロセスが完了しました。
ro: g90Procesul de fabricație finalizat.
ru: g90Процесс производства завершен.
zh_hans: g90制造流程完成。

# ReceivedInverter
source: g90Received design specifications for INVERTER chip. g90Ready to start fabrication process.
de: g90Designspezifikationen für INVERTER-Chip empfangen. g90Bereit, den Fertigungsprozess zu starten.
es: g90Especificaciones de diseño recibidas para chip INVERSOR. g90Listo para iniciar el proceso de fabricación.
fr: g90Spécifications de conception reçues pour la puce INVERTER. g90Prêt à démarrer le processus de fabrication.
it: g90Ricevute le specifiche per il progetto del chip INVERTITORE. g90Pronto per iniziare il processo di fabbricazione.
ja: g90INVERTERチップの設計仕様を受領しました。 g90製造プロセスを開始する準備ができました。
ro: g90S-au primit specificațiile de design pentru cipul INVERTER. g90Gata să înceapă procesul de fabricație.
ru: g90Получены спецификации для чипа INVERTER. g90Готов к запуску процесса производства.
zh_hans: g90已收到 INVERTER 芯片的设计规格。 g90准备开始制造流程。

# ReceivedAdder
source: g90Received design specifications for 8BIT ADDER chip. g90Ready to start fabrication process.
de: g90Designspezifikationen für 8-BIT-ADDER-Chip empfangen. g90Bereit, den Fertigungsprozess zu starten.
es: g90Especificaciones de diseño recibidas para chip SUMADOR DE 8 BITS. g90Listo para iniciar el proceso de fabricación.
fr: g90Spécifications de conception reçues pour la puce ADDER 8 bits. g90Prêt à démarrer le processus de fabrication.
it: g90Ricevute le specifiche per il progetto del chip SOMMATORE 8BIT. g90Pronto per iniziare il processo di fabbricazione.
ja: g90 8ビット加算器チップの設計仕様を受領しました。 g90 製造プロセスを開始する準備ができました。
ro: g90S-au primit specificațiile de design pentru cipul ADDER 8BIT. g90Gata să înceapă procesul de fabricație.
ru: g90Получены спецификации для чипа 8BIT ADDER. g90Готов к запуску процесса производства.
zh_hans: g90已收到 8BIT ADDER 芯片的设计规格。 g90准备开始制造流程。

# ReceivedALU
source: g90Received design specifications for ALU chip. g90Ready to start fabrication process.
de: g90Designspezifikationen für ALU-Chip empfangen. g90Bereit, den Fertigungsprozess zu starten.
es: g90Especificaciones de diseño recibidas para chip ALU. g90Listo para iniciar el proceso de fabricación.
fr: g90Spécifications de conception reçues pour la puce ALU. g90Prêt à démarrer le processus de fabrication.
it: g90Ricevute le specifiche per il progetto del chip ALU 8BIT. g90Pronto per iniziare il processo di fabbricazione.
ja: g90ALUチップの設計仕様を受領しました。 g90製造プロセスを開始する準備ができました。
ro: g90S-au primit specificațiile de design pentru cipul ALU. g90Gata să înceapă procesul de fabricație.
ru: g90Получены спецификации для чипа ALU. g90Готов к запуску процесса производства.
zh_hans: g90已收到 ALU 芯片的设计规格。 g90准备开始制造流程。
