Repository: Elorth-HC/hardchip-localization
Catalog: src/Areas/Campaign/Texts/WorkstationTerminalTexts.*.resx
Languages: de, es, fr, it, ja, ro, ru, zh_hans

# ReceivedBypassRequirement
source: g90Received requirements for BYPASS chip. g90Ready to start design process.
de: g90Anforderungen für BYPASS-Chip empfangen. g90Bereit, den Designprozess zu starten.
es: g90Requisitos recibidos para el chip BYPASS. g90Listo para iniciar el proceso de diseño.
fr: g90Spécifications reçues pour la puce BYPASS. g90Prêt à commencer le processus de conception.
it: g90Ricevute le specifiche del chip BYPASS. g90Pronto per iniziare il processo di progettazione.
ja: BYPASSチップの要件を受領しました。 設計プロセスを開始する準備ができました。
ro: g90Am primit cerințele pentru chip-ul BYPASS. g90Gata să încep procesul de proiectare.
ru: g90Получены требования для чипа BYPASS. g90Готов к запуску процесса проектирования.
zh_hans: g90已收到 BYPASS 芯片的需求。 g90准备开始设计流程。

# StartBypass
source: g90========================================================================= g90Rapid Prototyping Workstation v0.55.677 g90========================================================================= g90 g35Booting up... g90 g92Power System [OK] g92Physical Integrity [OK] y92Fabricator PARTIALY ONLINE r95Chip Database FAIL, data corrupted r99error: data corrupted, formating database... g90 g90Received requirements for BYPASS Chip. r99error: no chip found in the database! g90 g95Processing received requirements parts for BYPASS chip... g92 TRACES requirements g92 INPUT/OUTPUT requirements g92 CROSSING TRACES requirements g92All requirements parts uploaded g90 y39Workstation environment set up for BYPASS chip semi-conductor engineering.
de: g90========================================================================= g90Rapid Prototyping Workstation v0.55.677 g90========================================================================= g90 g35Starte... g90 g92Stromversorgung [OK] g92Strukturelle Integrität [OK] y92Fabrikator TEILWEISE ONLINE r95Chip-Datenbank FEHLER, Daten beschädigt r99Fehler: Daten beschädigt, formatiere Datenbank... g90 g90Anforderungen für BYPASS-Chip empfangen. r99Fehler: Kein Chip in der Datenbank gefunden! g90 g95Verarbeite empfangene Anforderungsteile für BYPASS-Chip... g92 TRACES requirements g92 INPUT/OUTPUT requirements g92 CROSSING TRACES requirements g92Alle Anforderungsteile hochgeladen g90 y39Workstation-Umgebung für BYPASS-Chip-Halbleiterentwicklung eingerichtet.
es: g90========================================================================= g90Rapid Prototyping Workstation v0.55.677 g90========================================================================= g90 g35Iniciando... g90 g92Power System [OK] g92Physical Integrity [OK] y92Fabricator PARTIALY ONLINE r95Chip Database FAIL, data corrupted r99error: datos corruptos, formateando base de datos... g90 g90Requisitos recibidos para el chip BYPASS. r99error: ¡ningún chip encontrado en la base de datos! g90 g95Procesando los requisitos recibidos para el chip BYPASS... g92 TRACES requirements g92 INPUT/OUTPUT requirements g92 CROSSING TRACES requirements g92Todas las partes de requisitos cargadas g90 y39Entorno de estación de trabajo preparado para la ingeniería de semiconductores del chip BYPASS.
fr: g90========================================================================= g90Station de travail de prototypage rapide v0.55.677 g90========================================================================= g90 g35Démarrage en cours... g90 g92Système d'alimentation [OK] g92Intégrité physique [OK] y92Fabricateur PARTIELLEMENT EN LIGNE r95Base de données de puces ÉCHEC, données corrompues r99erreur : données corrompues, formatage de la base de données... g90 g90Spécifications reçues pour la puce BYPASS. r99erreur : aucune puce trouvée dans la base de données ! g90 g95Traitement des parties de spécifications reçues pour la puce BYPASS... g92 Exigences de TRACES g92 Exigences d'ENTRÉE/SORTIE g92 Exigences de TRACES CROISÉES g92Toutes les parties des exigences téléchargées g90 y39Environnement de la station de travail configuré pour l'ingénierie des semi-conducteurs de la puce BYPASS.
it: g90========================================================================= g90Postazione da lavoro rapida per prototipi v0.55.677 g90========================================================================= g90 g35Accensione... g90 g92Sistemi di alimentazione [OK] g92Integrità fisica [OK] y92Fabbricatore PARZIALMENTE ONLINE r95Database dei chip GUASTO, dati corrotti r99Errore: dati corrotti, formattazione database... g90 g90Requisiti ricevuti per il chip BYPASS.
ja: g90========================================================================= g90ラピッドプロトタイピング・ワークステーション v0.55.677 g90========================================================================= g90 g35起動中... g90 g92電源システム [OK] g92物理的完全性 [OK] y92ファブリケーター 部分的にオンライン r95チップデータベース 失敗、データが破損 r99エラー: データが破損、データベースをフォーマット中... g90 g90BYPASSチップの要件を受信しました。 r99エラー: データベースにチップが見つかりません! g90 g95BYPASSチップの受信要件パーツを処理中... g92 TRACES 要件 g92 入力/出力 要件 g92 CROSSING TRACES 要件 g92すべての要件パーツをアップロードしました g90 y39BYPASSチップの半導体エンジニアリング向けにワークステーション環境を設定しました。
ro: g90========================================================================= g90Stația de Prototipare Rapidă v0.55.677 g90========================================================================= g90 g35Se pornește... g90 g92Sistem de Alimentare [OK] g92Integritate Fizică [OK] y92Fabricator PARȚIAL ONLINE r95Baza de Date Chip EȘEC, date corupte r99eroare: date corupte, se formatează baza de date... g90 g90Am primit cerințele pentru Chip-ul BYPASS. r99eroare: niciun chip găsit în baza de date! g90 g95Se procesează părțile cerințelor primite pentru chip-ul BYPASS... g92 cerințe TRACES g92 cerințe INPUT/OUTPUT g92 cerințe CROSSING TRACES g92Toate părțile cerințelor încărcate g90 y39Mediul stației de lucru configurat pentru ingineria semiconductorilor chip-ului BYPASS.
ru: g90========================================================================= g90Станция Быстрого Прототипирования v0.55.677 g90========================================================================= g90 g35Загрузка... g90 g92Энергосистема [OK] g92Физическая целостность [OK] y92Фабрикатор ЧАСТИЧНО РАБОТАЕТ r95База данных чипов ОТКАЗ, данные повреждены r99ошибка: данные повреждены, форматирование базы данных... g90 g90Получены требования для чипа BYPASS. r99ошибка: в базе данных не найдено чипа! g90 g95Обработка полученных частей требований для чипа BYPASS... g92 требования для TRACES g92 требования для INPUT/OUTPUT g92 требования для CROSSING TRACES g92Все части требований загружены g90 y39Среда рабочей станции настроена для полупроводникового проектирования чипа BYPASS.
zh_hans: g90========================================================================= g90Rapid Prototyping Workstation v0.55.677 g90========================================================================= g90 g35正在启动... g90 g92电源系统 [正常] g92物理完整性 [正常] y92制造机部分在线 r95芯片数据库故障，数据损坏 r99错误：数据损坏，正在格式化数据库... g90 g90已收到 BYPASS 芯片的需求。 r99错误：数据库中未找到芯片！ g90 g95正在处理 BYPASS 芯片的需求组件... g92 连线需求 g92 输入/输出需求 g92 交叉连线需求 g92所有需求组件已上传 g90 y39工作站环境已为 BYPASS 芯片半导体工程设置完成。

# BypassDone
source: g90BYPASS chip design: COMPLETED g90 g92Powering up Fabricator [OK] g90Sending design to Fabricator... g17..... g90Done.
de: g90BYPASS-Chip-Design: ABGESCHLOSSEN g90 g92Fahre Fabricator hoch [OK] g90Sende Design an Fabricator... g17..... g90Erledigt.
es: g90Diseño del chip BYPASS: COMPLETADO g90 g92Energizando Fabricator [OK] g90Enviando diseño al Fabricator... g17..... g90Hecho.
fr: g90Conception de la puce BYPASS : TERMINÉE g90 g92Mise sous tension du Fabricateur [OK] g90Envoi de la conception au Fabricateur... g17..... g90Terminé.
it: g90Progetto del chip BYPASS: COMPLETATO g90 g92Fabbricatore [ATTIVO] g90Invio del progetto al fabbricatore... g17..... g90Fatto.
ja: g90BYPASSチップ設計: 完了 g90 g92Fabricator を起動中 [OK] g90設計を Fabricator に送信中... g17..... g90完了。
ro: g90Proiectul chip-ului BYPASS: COMPLETAT g90 g92Se pornește Fabricatorul [OK] g90Se trimite proiectul la Fabricator... g17..... g90Terminat.
ru: g90Проектирование чипа BYPASS: ЗАВЕРШЕНО g90 g92Включение Фабрикатора [OK] g90Отправка спецификации в Фабрикатор... g17..... g90Завершено.
zh_hans: g90BYPASS 芯片设计：完成 g90 g92启动制造机 [正常] g90正在向制造机发送设计... g17..... g90完成。

# ReceivedALURequirementFailed
source: g90Received requirements for ALU chip. r95ERROR_CODE: 0x052001 Workstation is not ready, Material Banks are OFFLINE.
de: g90Anforderungen für ALU-Chip empfangen. r95ERROR_CODE: 0x052001 Workstation nicht bereit, Materialbanken OFFLINE.
es: g90Requisitos recibidos para el chip ALU. r95ERROR_CODE: 0x052001 La estación de trabajo no está lista, los Material Banks están OFFLINE.
fr: g90Spécifications reçues pour la puce ALU. r95CODE_ERREUR : 0x052001 Station de travail non prête, banques de matériaux HORS LIGNE.
it: g90Ricevute le specifiche del chip ALU. r95CODICE_ERRORE: 0x052001 La postazione di lavoro non è pronta, le banche materiali sono OFFLINE.
ja: g90ALUチップの要件を受信しました。 r95ERROR_CODE: 0x052001 ワークステーションの準備ができていません。Material Banks はOFFLINEです。
ro: g90Am primit cerințele pentru chip-ul ALU. r95CODUL_ERORII: 0x052001 Stația de lucru nu este gata, Băncile de Materiale sunt OFFLINE.
ru: g90Получены требования для чипа ALU. r95КОД_ОШИБКИ: 0x052001 Рабочая станция не готова, Хранилища Материалов ОТКЛЮЧЕНЫ.
zh_hans: g90已收到 ALU 芯片的需求。 r95ERROR_CODE: 0x052001 工作站未就绪，材料库离线。

# ReceivedALURequirement
source: g90Received requirements for ALU chip. g90Ready to start design process.
de: g90Anforderungen für ALU-Chip empfangen. g90Bereit, den Designprozess zu starten.
es: g90Requisitos recibidos para el chip ALU. g90Listo para iniciar el proceso de diseño.
fr: g90Spécifications reçues pour la puce ALU. g90Prêt à commencer le processus de conception.
it: g90Ricevute le specifiche del chip ALU. g90Pronto per iniziare il processo di progettazione.
ja: g90ALUチップの要件を受領しました。 g90設計プロセスを開始する準備ができました。
ro: g90Am primit cerințele pentru chip-ul ALU. g90Gata să încep procesul de proiectare.
ru: g90Получены требования для чипа ALU. g90Готов к запуску процесса проектирования.
zh_hans: g90已收到 ALU 芯片的需求。 g90准备开始设计流程。

# ReceivedInverterRequirement
source: g90Received requirements for INVERTER chip. g90Ready to start design process.
de: g90Anforderungen für INVERTER-Chip empfangen. g90Bereit, den Designprozess zu starten.
es: g90Requisitos recibidos para el chip INVERTER. g90Listo para iniciar el proceso de diseño.
fr: g90Spécifications reçues pour la puce INVERTER. g90Prêt à commencer le processus de conception.
it: g90Ricevute le specifiche del chip INVERTITORE. g90Pronto per iniziare il processo di progettazione.
ja: g90INVERTERチップの要件を受領しました。 g90設計プロセスを開始する準備ができました。
ro: g90Am primit cerințele pentru chip-ul INVERTER. g90Gata să încep procesul de proiectare.
ru: g90Получены требования для чипа INVERTER. g90Готов к запуску процесса проектирования.
zh_hans: g90已收到 INVERTER 芯片的需求。 g90准备开始设计流程。

# StartInverter
source: g90========================================================================= g90Rapid Prototyping Workstation v0.55.677 g90========================================================================= g90 y92Primary Material Banks [OFFLINE] y95Secondary Material Bank [OFFLINE] y92Fabricator PARTIALY ONLINE g90 g90Received requirements for INVERTER Chip. r99error: no chip found in the database! g90 g95Processing received requirements parts for INVERTER chip... g92 PMOS requirements g92 NMOS requirements g92 NOT requirements g92All requirements parts uploaded g90 y39Workstation environment set up for INVERTER chip semi-conductor engineering.
de: g90========================================================================= g90Rapid Prototyping Workstation v0.55.677 g90========================================================================= g90 y92Primäre Materialbanken [OFFLINE] y95Sekundäre Materialbank [OFFLINE] y92Fabrikator TEILWEISE ONLINE g90 g90Anforderungen für INVERTER-Chip empfangen. r99Fehler: Kein Chip in der Datenbank gefunden! g90 g95Verarbeite empfangene Anforderungsteile für INVERTER-Chip... g92 PMOS requirements g92 NMOS requirements g92 NOT requirements g92Alle Anforderungsteile hochgeladen g90 y39Workstation-Umgebung für INVERTER-Chip-Halbleiterentwicklung eingerichtet.
es: g90========================================================================= g90Rapid Prototyping Workstation v0.55.677 g90========================================================================= g90 y92Primary Material Banks [OFFLINE] y95Secondary Material Bank [OFFLINE] y92Fabricator PARTIALY ONLINE g90 g90Requisitos recibidos para el chip INVERTER. r99error: ¡ningún chip encontrado en la base de datos! g90 g95Procesando los requisitos recibidos para el chip INVERTER... g92 PMOS requirements g92 NMOS requirements g92 NOT requirements g92Todas las partes de requisitos cargadas g90 y39Entorno de estación de trabajo preparado para la ingeniería de semiconductores del chip INVERTER.
fr: g90========================================================================= g90Station de travail de prototypage rapide v0.55.677 g90========================================================================= g90 y92Banques de matériaux principales [HORS LIGNE] y95Banque de matériaux secondaire [HORS LIGNE] y92Fabricateur PARTIELLEMENT EN LIGNE g90 g90Spécifications reçues pour la puce INVERTER. r99erreur : aucune puce trouvée dans la base de données ! g90 g95Traitement des parties de spécifications reçues pour la puce INVERTER... g92 Exigences PMOS g92 Exigences NMOS g92 Exigences NOT g92Toutes les parties des exigences téléchargées g90 y39Environnement de la station de travail configuré pour l'ingénierie des semi-conducteurs de la puce INVERTER.
it: g90========================================================================= g90Postazione da lavoro rapida per prototipi v0.55.677 g90========================================================================= g90 y92Banca materiali primaria [OFFLINE] y95Banca materiali secondaria [OFFLINE] y92Fabbricatore PARZIALMENTE ONLINE g90 g90Ricevuti i requisiti per chip INVERTITORE 8BIT. r99Errore: errore nessun chip trovato nel database! g90 g95Elaborazione requisiti ricevuti delle parti per il chip INVERTITORE... g92 requisiti PMOS g92 requisiti NMOS g92 requisiti porta logica NOT g92Tutte le parti richieste caricate g90 y39Ambiente postazione da lavoro pronto per lo sviluppo con semi-conduttori dell'INVERTITORE.
ja: g90========================================================================= g90ラピッドプロトタイピング・ワークステーション v0.55.677 g90========================================================================= g90 y92一次材料バンク [オフライン] y95二次材料バンク [オフライン] y92ファブリケーター 部分的にオンライン g90 g90INVERTERチップの要件を受信しました。 r99error: データベースにチップが見つかりません！ g90 g95INVERTERチップの受信した要件パーツを処理中... g92 PMOS要件 g92 NMOS要件 g92 NOT要件 g92すべての要件パーツをアップロードしました g90 y39INVERTERチップの半導体エンジニアリング向けにワークステーション環境をセットアップしました。
ro: g90========================================================================= g90Stația de Prototipare Rapidă v0.55.677 g90========================================================================= g90 y92Băncile de Materiale Primare [OFFLINE] y95Banca de Materiale Secundară [OFFLINE] y92Fabricator PARȚIAL ONLINE g90 g90Am primit cerințele pentru Chip-ul INVERTER. r99eroare: niciun chip găsit în baza de date! g90 g95Se procesează părțile cerințelor primite pentru chip-ul INVERTER... g92 cerințe PMOS g92 cerințe NMOS g92 cerințe NOT g92Toate părțile cerințelor încărcate g90 y39Mediul stației de lucru configurat pentru ingineria semiconductorilor chip-ului INVERTER.
ru: g90========================================================================= g90Станция Быстрого Прототипирования v0.55.677 g90========================================================================= g90 y92Основное Хранилище Материалов [ОТКЛЮЧЕНО] y95Вторичное Хранилище Материалов [ОТКЛЮЧЕНО] y92Фабрикатор ЧАСТИЧНО РАБОТАЕТ g90 g90Получены требования для чипа INVERTER. r99ошибка: чип не найден в базе данных! g90 g95Обработка полученных частей требований для чипа INVERTER... g92 требования для PMOS g92 требования для NMOS g92 требования для NOT g92Все части требований загружены g90 y39Среда рабочей станции настроена для полупроводникового проектирования чипа INVERTER.
zh_hans: g90========================================================================= g90Rapid Prototyping Workstation v0.55.677 g90========================================================================= g90 y92主材料库 [离线] y95副材料库 [离线] y92制造机部分在线 g90 g90已收到 INVERTER 芯片的需求。 r99错误：数据库中未找到芯片！ g90 g95正在处理 INVERTER 芯片的需求组件... g92 PMOS 需求 g92 NMOS 需求 g92 NOT 需求 g92所有需求组件已上传 g90 y39工作站环境已为 INVERTER 芯片半导体工程设置完成。

# InverterDone
source: g90INVERTER chip design: COMPLETED g90 g92Fabricator [ONLINE] g90Sending design to Fabricator... g17..... g90Done.
de: g90INVERTER-Chip-Design: ABGESCHLOSSEN g90 g92Fabricator [ONLINE] g90Sende Design an Fabricator... g17..... g90Erledigt.
es: g90Diseño del chip INVERTER: COMPLETADO g90 g92Fabricator [ONLINE] g90Enviando diseño al Fabricator... g17..... g90Hecho.
fr: g90Conception de la puce INVERTER : TERMINÉE g90 g92Fabricateur [EN LIGNE] g90Envoi de la conception au Fabricateur... g17..... g90Terminé.
it: g90Progetto chip INVERTITORE: COMPLETATO g90 g92Fabbricatore [ONLINE] g90Invio del progetto al fabbricatore... g17..... g90Fatto.
ja: g90INVERTERチップ設計: 完了 g90 g92Fabricator [オンライン] g90設計をFabricatorに送信中... g17..... g90完了。
ro: g90Proiectul chip-ului INVERTER: COMPLETAT g90 g92Fabricator [ONLINE] g90Se trimite proiectul la Fabricator... g17..... g90Terminat.
ru: g90Проектирование чипа INVERTER: ЗАВЕРШЕНО g90 g92Фабрикатор [РАБОТАЕТ] g90Отправка спецификации в Фабрикатор... g17..... g90Завершено.
zh_hans: g90INVERTER 芯片设计：完成 g90 g92制造机 [在线] g90正在向制造机发送设计... g17..... g90完成。

# ReceivedAdderRequirement
source: g90Received requirements for 8bit Adder chip. g90Ready to start design process.
de: g90Anforderungen für 8-BIT-ADDER-Chip empfangen. g90Bereit, den Designprozess zu starten.
es: g90Requisitos recibidos para el chip 8BIT ADDER. g90Listo para iniciar el proceso de diseño.
fr: g90Spécifications reçues pour la puce ADDER 8 bits. g90Prêt à commencer le processus de conception.
it: g90Ricevute le specifiche del chip SOMMATORE 8BIT. g90Pronto per iniziare il processo di progettazione.
ja: g90 8ビット加算器チップの要件を受領しました。 g90 設計プロセスを開始する準備ができました。
ro: g90Am primit cerințele pentru chip-ul Adder 8bit. g90Gata să încep procesul de proiectare.
ru: g90Получены требования для чипа 8BIT ADDER. g90Готов к запуску процесса проектирования.
zh_hans: g90已收到 8位加法器芯片的需求。 g90准备开始设计流程。
