Repository: Elorth-HC/hardchip-localization
Catalog: src/Areas/Campaign/Texts/WorkstationTerminalTexts.*.resx
Languages: de, es, fr, it, ja, ro, ru, zh_hans

# StartAdder
source: g90========================================================================= g90Rapid Prototyping Workstation v0.55.677 g90========================================================================= g90 g92Primary Material Banks [ONLINE] y95Secondary Material Bank [OFFLINE] y92Fabricator PARTIALY ONLINE g90 g90Received requirements for 8BIT ADDER chip. r99error: no chip found in the database! g90 g95Processing received requirements parts for 8BIT ADDER chip... g92 NOT gate requirements g92 NAND gate requirements g92 AND gate requirements g92 OR gate requirements g92 XOR gate requirements g92 Bit Full Adder requirements g92 4bit Adder requirements g92 8bit Adder requirements g92All requirements parts uploaded g90 y39Workstation environment set up for 8BIT ADDER semi-conductor engineering.
de: g90========================================================================= g90Rapid Prototyping Workstation v0.55.677 g90========================================================================= g90 g92Primäre Materialbanken [ONLINE] y95Sekundäre Materialbank [OFFLINE] y92Fabrikator TEILWEISE ONLINE g90 g90Anforderungen für 8-BIT-ADDER-Chip empfangen. r99Fehler: Kein Chip in der Datenbank gefunden! g90 g95Verarbeite empfangene Anforderungsteile für 8-BIT-ADDER-Chip... g92 NOT gate requirements g92 NAND gate requirements g92 AND gate requirements g92 OR gate requirements g92 XOR gate requirements g92 Bit Full Adder requirements g92 4bit Adder requirements g92 8bit Adder requirements g92Alle Anforderungsteile hochgeladen g90 y39Workstation-Umgebung für 8-BIT-ADDER-Halbleiterentwicklung eingerichtet.
es: g90========================================================================= g90Rapid Prototyping Workstation v0.55.677 g90========================================================================= g90 g92Primary Material Banks [ONLINE] y95Secondary Material Bank [OFFLINE] y92Fabricator PARTIALY ONLINE g90 g90Requisitos recibidos para el chip 8BIT ADDER. r99error: ¡ningún chip encontrado en la base de datos! g90 g95Procesando los requisitos recibidos para el chip 8BIT ADDER... g92 NOT gate requirements g92 NAND gate requirements g92 AND gate requirements g92 OR gate requirements g92 XOR gate requirements g92 Bit Full Adder requirements g92 4bit Adder requirements g92 8bit Adder requirements g92Todas las partes de requisitos cargadas g90 y39Entorno de estación de trabajo preparado para la ingeniería de semiconductores del 8BIT ADDER.
fr: g90========================================================================= g90Station de travail de prototypage rapide v0.55.677 g90========================================================================= g90 g92Banques de matériaux principales [EN LIGNE] y95Banque de matériaux secondaire [HORS LIGNE] y92Fabricateur PARTIELLEMENT EN LIGNE g90 g90Spécifications reçues pour la puce 8BIT ADDER. r99erreur : aucune puce trouvée dans la base de données ! g90 g95Traitement des parties de spécifications reçues pour la puce 8BIT ADDER... g92 Exigences de porte NOT g92 Exigences de porte NAND g92 Exigences de porte AND g92 Exigences de porte OR g92 Exigences de porte XOR g92 Exigences de Full Adder bit g92 Exigences de l'additionneur 4 bits g92 Exigences de l'additionneur 8 bits g92Toutes les parties des exigences téléchargées g90 y39Environnement de la station de travail configuré pour l'ingénierie des semi-conducteurs de la puce 8BIT ADDER.
it: g90========================================================================= g90Postazione da lavoro rapida per prototipi v0.55.677 g90========================================================================= g90 g92Banca materiali primaria [ONLINE] y95Banca materiali secondaria [OFFLINE] y92Fabbricatore PARZIALMENTE ONLINE g90 g90Ricevuti i requisiti per chip SOMMATORE 8BIT. r99Errore: errore nessun chip trovato nel database! g90 g95Elaborazione requisiti ricevuti delle parti per il chip SOMMATORE 8BIT... g92 requisiti porta logica NOT g92 requisiti porta logica NAND g92 requisiti porta logica AND g92 requisiti porta logica OR g92 requisiti porta logica XOR g92 requisiti SOMMATORE COMPLETO BIT g92 requisiti SOMMATORE 4BIT g92 requisiti SOMMATORE 8BIT g92Tutte le parti richieste caricate g90 y39Ambiente postazione da lavoro pronto per lo sviluppo con semi-conduttori del SOMMATORE 8BIT.
ja: g90========================================================================= g90ラピッドプロトタイピング・ワークステーション v0.55.677 g90========================================================================= g90 g92主要マテリアルバンク [オンライン] y95副次マテリアルバンク [オフライン] y92ファブリケーター 部分的にオンライン g90 g908BIT ADDERチップの要件を受信しました。 r99エラー: データベースにチップが見つかりません！ g90 g958BIT ADDERチップの受信要件パーツを処理中... g92 NOTゲート要件 g92 NANDゲート要件 g92 ANDゲート要件 g92 ORゲート要件 g92 XORゲート要件 g92 ビット・フルアダー要件 g92 4bitアダー要件 g92 8bitアダー要件 g92すべての要件パーツをアップロードしました g90 y398BIT ADDERの半導体エンジニアリング向けにワークステーション環境をセットアップしました。
ro: g90========================================================================= g90Stația de Prototipare Rapidă v0.55.677 g90========================================================================= g90 g92Băncile de Materiale Primare [ONLINE] y95Banca de Materiale Secundară [OFFLINE] y92Fabricator PARȚIAL ONLINE g90 g90Am primit cerințele pentru chip-ul 8BIT ADDER. r99eroare: niciun chip găsit în baza de date! g90 g95Se procesează părțile cerințelor primite pentru chip-ul 8BIT ADDER... g92 cerințe poartă NOT g92 cerințe poartă NAND g92 cerințe poartă AND g92 cerințe poartă OR g92 cerințe poartă XOR g92 cerințe Bit Full Adder g92 cerințe 4bit Adder g92 cerințe 8bit Adder g92Toate părțile cerințelor încărcate g90 y39Mediul stației de lucru configurat pentru ingineria semiconductorilor chip-ului 8BIT ADDER.
ru: g90========================================================================= g90Станция Быстрого Прототипирования v0.55.677 g90========================================================================= g90 g92Основное Хранилище Материалов [РАБОТАЕТ] y95Вторичное Хранилище Материалов [ОТКЛЮЧЕНО] y92Фабрикатор ЧАСТИЧНО РАБОТАЕТ g90 g90Получены требования для чипа 8BIT ADDER. r99ошибка: чип не найден в базе данных! g90 g95Обработка полученных частей требований для чипа 8BIT ADDER... g92 требования для NOT gate g92 требования для NAND gate g92 требования для AND gate g92 требования для OR gate g92 требования для XOR gate g92 требования для Bit Full Adder g92 требования для 4bit Adder g92 требования для 8bit Adder g92Все части требований загружены g90 y39Среда рабочей станции настроена для полупроводникового проектирования чипа 8BIT ADDER.
zh_hans: g90========================================================================= g90Rapid Prototyping Workstation v0.55.677 g90========================================================================= g90 g92主材料库 [在线] y95副材料库 [离线] y92制造机部分在线 g90 g90已收到 8BIT ADDER 芯片的需求。 r99错误：数据库中未找到芯片！ g90 g95正在处理 8BIT ADDER 芯片的需求组件... g92 NOT 门需求 g92 NAND 门需求 g92 AND 门需求 g92 OR 门需求 g92 XOR 门需求 g92 位全加器需求 g92 4位加法器需求 g92 8位加法器需求 g92所有需求组件已上传 g90 y39工作站环境已为 8BIT ADDER 半导体工程设置完成。

# AdderDone
source: g908BIT ADDER chip design: COMPLETED g90 g92Fabricator [ONLINE] g90Sending design to Fabricator... g17..... g90Done.
de: g908-BIT-ADDER-Chip-Design: ABGESCHLOSSEN g90 g92Fabricator [ONLINE] g90Sende Design an Fabricator... g17..... g90Erledigt.
es: g90Diseño del chip 8BIT ADDER: COMPLETADO g90 g92Fabricator [ONLINE] g90Enviando diseño al Fabricator... g17..... g90Hecho.
fr: g908BIT ADDER : conception de la puce TERMINÉE g90 g92Fabricateur [EN LIGNE] g90Envoi de la conception au Fabricateur... g17..... g90Terminé.
it: g90Progetto del chip SOMMATORE 8BIT: COMPLETATO g90 g92Fabbricatore [ATTIVO] g90Invio del progetto al fabbricatore... g17..... g90Fatto.
ja: g908BIT ADDERチップ設計：完了 g90 g92Fabricator [オンライン] g90設計をFabricatorに送信中... g17..... g90完了。
ro: g90Proiectul chip-ului 8BIT ADDER: COMPLETAT g90 g92Fabricator [ONLINE] g90Se trimite proiectul la Fabricator... g17..... g90Terminat.
ru: g90Проектирование чипа 8BIT ADDER: ЗАВЕРШЕНО g90 g92Фабрикатор [РАБОТАЕТ] g90Отправка спецификации в Фабрикатор... g17..... g90Готово.
zh_hans: g908BIT ADDER 芯片设计：完成 g90 g92制造机 [在线] g90正在向制造机发送设计... g17..... g90完成。

# StartALU
source: g90========================================================================= g90Rapid Prototyping Workstation v0.55.677 g90========================================================================= g90 g92Primary Material Banks [ONLINE] g95Secondary Material Bank [ONLINE] g92Fabricator ONLINE g90 g90Received requirements for 8BIT ALU chip. r99error: no chip found in the database! g90 g95Processing received requirements parts for 8BIT ALU chip... g92 XOR gate requirements g92 NOR8 gate requirements g92 8bit Adder requirements g92 Signed Number Representation requirements g92 Inverter+1 requirements g92 Subtracter requirements g92 8bit ALU requirements g92All requirements parts uploaded g90 y39Workstation environment set up for 8BIT ALU semi-conductor engineering.
de: g90========================================================================= g90Rapid Prototyping Workstation v0.55.677 g90========================================================================= g90 g92Primäre Materialbanken [ONLINE] g95Sekundäre Materialbank [ONLINE] g92Fabrikator ONLINE g90 g90Anforderungen für 8-BIT-ALU-Chip empfangen. r99Fehler: Kein Chip in der Datenbank gefunden! g90 g95Verarbeite empfangene Anforderungsteile für 8-BIT-ALU-Chip... g92 XOR gate requirements g92 NOR8 gate requirements g92 8bit Adder requirements g92 Signed Number Representation requirements g92 Inverter+1 requirements g92 Subtracter requirements g92 8bit ALU requirements g92Alle Anforderungsteile hochgeladen g90 y39Workstation-Umgebung für 8-BIT-ALU-Halbleiterentwicklung eingerichtet.
es: g90========================================================================= g90Rapid Prototyping Workstation v0.55.677 g90========================================================================= g90 g92Primary Material Banks [ONLINE] g95Secondary Material Bank [ONLINE] g92Fabricator ONLINE g90 g90Requisitos recibidos para el chip 8BIT ALU. r99error: ¡ningún chip encontrado en la base de datos! g90 g95Procesando los requisitos recibidos para el chip 8BIT ALU... g92 XOR gate requirements g92 NOR8 gate requirements g92 8bit Adder requirements g92 Signed Number Representation requirements g92 Inverter+1 requirements g92 Subtracter requirements g92 8bit ALU requirements g92Todas las partes de requisitos cargadas g90 y39Entorno de estación de trabajo preparado para la ingeniería de semiconductores del 8BIT ALU.
fr: g90========================================================================= g90Station de travail de prototypage rapide v0.55.677 g90========================================================================= g90 g92Banques de matériaux principales [EN LIGNE] g95Banque de matériaux secondaire [EN LIGNE] g92Fabricateur EN LIGNE g90 g90Spécifications reçues pour la puce 8BIT ALU. r99erreur : aucune puce trouvée dans la base de données ! g90 g95Traitement des parties de spécifications reçues pour la puce 8BIT ALU... g92 Exigences de porte XOR g92 Exigences de porte NOR8 g92 Exigences de l'additionneur 8 bits g92 Exigences de représentation des nombres signés g92 Exigences Inverter+1 g92 Exigences du soustracteur g92 Exigences 8BIT ALU g92Toutes les parties des exigences téléchargées g90 y39Environnement de la station de travail configuré pour l'ingénierie des semi-conducteurs de la puce 8BIT ALU.
it: g90========================================================================= g90Postazione da lavoro rapida per prototipi v0.55.677 g90========================================================================= g90 g92Banca materiali primaria [ONLINE] g95Banca materiali secondaria[ONLINE] g92Fabbricatore ONLINE g90 g90Ricevuti i requisiti per chip ALU 8BIT. r99Errore: errore nessun chip trovato nel database! g90 g95Elaborazione requisiti ricevuti delle parti per il chip ALU 8BIT... g92 requisiti porta logica XOR g92 requisiti porta logica NOR8 g92 requisiti SOMMATORE 8BIT g92 requisiti rappresentazione numeri con segno g92 requisiti invertitore+1 g92 requisiti sottrattore g92 requisiti ALU 8BIT g92Tutte le parti richieste caricate g90 y39Ambiente postazione da lavoro pronto per lo sviluppo con semi-conduttori dell'ALU 8BIT.
ja: g90========================================================================= g90ラピッドプロトタイピング・ワークステーション v0.55.677 g90========================================================================= g90 g92主要材料バンク [オンライン] g95副材料バンク [オンライン] g92ファブリケーター オンライン g90 g90 8BIT ALUチップの要件を受信しました。 r99エラー: データベースにチップが見つかりません! g90 g95 8BIT ALUチップの受信要件パーツを処理中... g92 XORゲート要件 g92 NOR8ゲート要件 g92 8ビット加算器要件 g92 符号付き数表現要件 g92 インバータ+1要件 g92 減算器要件 g92 8ビットALU要件 g92すべての要件パーツをアップロードしました g90 y39 8BIT ALU半導体エンジニアリング用にワークステーション環境をセットアップしました。
ro: g90========================================================================= g90Stația de Prototipare Rapidă v0.55.677 g90========================================================================= g90 g92Băncile de Materiale Primare [ONLINE] g95Banca de Materiale Secundară [ONLINE] g92Fabricator ONLINE g90 g90Am primit cerințele pentru chip-ul 8BIT ALU. r99eroare: niciun chip găsit în baza de date! g90 g95Se procesează părțile cerințelor primite pentru chip-ul 8BIT ALU... g92 cerințe poartă XOR g92 cerințe poartă NOR8 g92 cerințe 8bit Adder g92 cerințe Reprezentare Număr cu Semn g92 cerințe Inverter+1 g92 cerințe Subtracter g92 cerințe 8bit ALU g92Toate părțile cerințelor încărcate g90 y39Mediul stației de lucru configurat pentru ingineria semiconductorilor chip-ului 8BIT ALU.
ru: g90========================================================================= g90Станция Быстрого Прототипирования v0.55.677 g90========================================================================= g90 g92Основное Хранилище Материалов [РАБОТАЕТ] g95Вторичное Хранилище Материалов [РАБОТАЕТ] g92Фабрикатор [РАБОТАЕТ] g90 g90Получены требования для чипа 8BIT ALU. r99ошибка: чип не найден в базе данных! g90 g95Обработка полученных частей требований для чипа 8BIT ALU... g92 требования для XOR gate g92 требования для NOR8 gate g92 требования для 8bit Adder g92 требования для Signed Number Representation g92 требования для Inverter+1 g92 требования для Subtracter g92 требования для 8bit ALU g92Все части требований загружены g90 y39Среда рабочей станции настроена для полупроводникового проектирования чипа 8BIT ALU.
zh_hans: g90========================================================================= g90Rapid Prototyping Workstation v0.55.677 g90========================================================================= g90 g92主材料库 [在线] g95副材料库 [在线] g92制造机在线 g90 g90已收到 8BIT ALU 芯片的需求。 r99错误：数据库中未找到芯片！ g90 g95正在处理 8BIT ALU 芯片的需求组件... g92 XOR 门需求 g92 NOR8 门需求 g92 8位加法器需求 g92 有符号数表示需求 g92 反相器+1 需求 g92 减法器需求 g92 8位 ALU 需求 g92所有需求组件已上传 g90 y39工作站环境已为 8BIT ALU 半导体工程设置完成。

# ALUDone
source: g908BIT ALU chip design: COMPLETED g90 g92Fabricator [ONLINE] g90Sending design to Fabricator... g17..... g90Done.
de: g908-BIT-ALU-Chip-Design: ABGESCHLOSSEN g90 g92Fabricator [ONLINE] g90Sende Design an Fabricator... g17..... g90Erledigt.
es: g90Diseño del chip 8BIT ALU: COMPLETADO g90 g92Fabricator [ONLINE] g90Enviando diseño al Fabricator... g17..... g90Hecho.
fr: g908BIT ALU : conception de la puce TERMINÉE g90 g92Fabricateur [EN LIGNE] g90Envoi de la conception au Fabricateur... g17..... g90Terminé.
it: g90Progetto del chip ALU 8BIT: COMPLETATO g90 g92Fabbricatore [ATTIVO] g90Invio del progetto al fabbricatore... g17..... g90Fatto.
ja: g908BIT ALUチップ設計：完了 g90 g92Fabricator [オンライン] g90設計をFabricatorに送信中... g17..... g90完了。
ro: g90Proiectul chip-ului 8BIT ALU: COMPLETAT g90 g92Fabricator [ONLINE] g90Se trimite proiectul la Fabricator... g17..... g90Terminat.
ru: g90Проектирование чипа 8BIT ALU: ЗАВЕРШЕНО g90 g92Фабрикатор [РАБОТАЕТ] g90Отправка спецификации в Фабрикатор... g17..... g90Завершено.
zh_hans: g908BIT ALU 芯片设计：完成 g90 g92制造机 [在线] g90正在向制造机发送设计... g17..... g90完成。
