Repository: Elorth-HC/hardchip-localization
Catalog: src/Areas/ChipMaps/Texts/ChipMapsTexts.*.resx
Languages: de, es, fr, it, ru, zh_hans

source: completion
de: Abschluss
es: Completado
fr: Achèvement
it: completamento
ru: прогресс
zh_hans: 完成度

source: Unlock next section
de: Schalte den nächsten Abschnitt frei
es: Desbloquear la siguiente sección
fr: Déverrouiller
it: Sblocca la prossima sezione
ru: Разблокировать следующий раздел
zh_hans: 解锁下一部分

source: Chip ready!
de: Chip bereit!
es: ¡Chip listo!
fr: Puce prête!
it: Chip pronto!
ru: Чип готов!
zh_hans: 芯片就绪！

source: Fabricate
de: Fertige
es: Fabricar
fr: Fabriquer
it: Fabbrica
ru: Изготовить
zh_hans: 制造

source: Incomplete chip
de: Unvollständiger Chip
es: Chip incompleto
fr: Puce incomplète
it: Chip incompleto
ru: Незаконченный чип
zh_hans: 芯片未完成

# Status
source: Status: {0} Grade: {1}
de: Status: {0} Bewertung: {1}
es: Estado: {0} Calificación: {1}
fr: Statut: {0} Grade: {1}
it: Stato: {0} Grado: {1}
ru: Статус: {0} Категория: {1}
zh_hans: 状态：{0} 评级：{1}

source: Subtraction
de: Subtraktion
es: Sustracción
fr: Soustraction
it: Sottrazione
ru: Вычитание
zh_hans: 减法

source: Logic gates
de: Logikgatter
es: Compuertas lógicas
fr: Portes logiques
it: Porte logiche
ru: Логические элементы
zh_hans: 逻辑门

# Additions
source: Addition
de: Additionen
es: Sumas
fr: Ajouts
it: Addizione
ru: Сложение
zh_hans: 加法

source: Bonus Stages
de: Bonus-Level
es: Fases extra
fr: Étapes bonus
it: Fasi aggiuntive
ru: Дополнительные уровни
zh_hans: 额外关卡

source: Logic gates 3
de: Logikgatter 3
es: Compuertas lógicas 3
fr: Portes logiques 3
it: Porte logiche 3
ru: Логические элементы 3
zh_hans: 逻辑门 3

source: Counters
de: Zähler
es: Contadores
fr: Compteurs
it: Contatori
ru: Счётчики
zh_hans: 计数器

source: Decoders
de: Decoder
es: Decodificadores
fr: Décodeurs
it: Decodificatori
ru: Декодеры
zh_hans: 解码器

source: Multiplexers
de: Multiplexer
es: Multiplexores
fr: Multiplexeurs
it: Multiplexer
ru: Мультиплексоры
zh_hans: 多路复用器

source: Transceivers
de: Transceiver
es: Transceptores
fr: Émetteurs-récepteurs
it: Ricetransmettitore
ru: Трансиверы
zh_hans: 收发器

source: Adders
de: Addierer
es: Sumadores
fr: Additionneurs
it: Sommatori
ru: Сумматоры
zh_hans: 加法器

source: Multipliers
de: Multiplikatoren
es: Multiplicadores
fr: Multiplicateurs
it: Moltiplicatori
ru: Умножители
zh_hans: 乘法器

source: Uncategorized
de: Nicht kategorisiert
es: Sin categoría
fr: Non classé
it: Non classificato
ru: Прочее
zh_hans: 未分类

source: Traces
de: Leiterbahnen
es: Pistas
it: Tracce
ru: Дорожки
zh_hans: 连线

source: Transistors
de: Transistoren
es: Transistores
it: Transistor
ru: Транзисторы
zh_hans: 晶体管

source: Inverter (NOT)
de: Invertierer (NOT)
es: Inversor (NOT)
fr: Inverseur (NOT)
it: Invertitore (NOT)
ru: Инвертор (логическое НЕ)
zh_hans: 反相器 (NOT)

source: Inverter Chip
de: Invertierer-Chip
es: Chip INVERTER
fr: Puce d'inversion
it: Chip invertitore
ru: Инвертор
zh_hans: 反相器芯片

source: Bypass Chip
es: Chip BYPASS
fr: Puce de contournement
it: Chip bypass
ru: BYPASS
zh_hans: 旁路芯片

source: Byte Register Chip
es: Chip Registro de Byte
fr: Puce registre 1octet
it: Chip registro byte
ru: Байтовый регистр
zh_hans: 字节寄存器芯片

# MemoryBit
source: Memory Cells
de: Speicherzellen
es: Celdas de memoria
fr: Cellules mémoire
it: Celle di memoria
ru: Ячейки памяти
zh_hans: 存储单元

# AdderChip
source: Byte Adder Chip
es: Chip Sumador de Bytes
fr: Puce Additionneur d'Octets
zh_hans: 字节加法器芯片

# ALUChip
source: Byte ALU Chip
es: Chip ALU de Bytes
fr: Puce ALU d'Octets
zh_hans: 字节 ALU 芯片
