Repository: Elorth-HC/hardchip-localization
Catalog: src/Areas/Tutorial/Texts/TutorialTexts.*.resx
Languages: de, es, fr, it, ja, ro, ru, zh_hans

source: Following the criteria: Input A must be connected to Output A but not to Output B nor C.
de: Gemäß den Kriterien muss Input A mit Output A verbunden sein, aber nicht mit Output B oder C.
es: Siguiendo los criterios: La Entrada A debe estar conectada a la Salida A, pero no a la Salida B ni C.
fr: Selon les critères : L'entrée A doit être connectée à la sortie A, mais pas à la sortie B ni à C.
it: Seguendo i criteri: L'input A deve essere connesso all'output A ma né all'output B né al C.
ja: 基準に従って： 入力Aは出力Aに接続されていなければなりませんが、 出力BおよびCには接続されていてはなりません。
ro: Urmând criteriile: Intrarea A trebuie conectată la Ieșirea A dar nu la Ieșirea B sau C.
ru: Согласно критериям: Вход A должен быть подключен к Выходу A, но не к Выходам B или C.
zh_hans: 按照条件： 输入 A 必须连接到输出 A 但不能连接到输出 B 或 C。

# AddTRACESUpByHoldingLEFTCLICKAndThenMOUSEMOVEUpWhileHoldingCTRLDOWN
source: Add METAL block up by holding LEFT CLICK and then MOUSE MOVE up while holding CTRL DOWN.
de: Füge METALL nach oben hinzu, indem du LINKSKLICK gedrückt hältst, die Maus nach oben bewegst und dabei CTRL hältst.
es: Añade bloques METÁLICOS hacia arriba manteniendo pulsado el CLIC IZQUIERDO y moviendo el ratón hacia arriba mientras mantienes CTRL pulsado.
fr: Ajoutez des block METAL vers le haut en maintenant le CLIC GAUCHE, puis déplacez la souris vers le haut tout en maintenant CTRL enfoncée.
it: Aggiungi blocchi di METALLO verso l'alto tenendo premuto il TASTO SINISTRO e poi muovi il MOUSE in alto tenendo premuto CTRL.
ja: 左クリックを押し続けてMETALブロックを上に追加し、 CTRLを押したままマウスを上に動かします。
ro: Adaugă blocuri METAL în sus ținând CLICK STÂNGA și apoi MIȘCĂ MOUSE-ul sus în timp ce ții CTRL APĂSAT.
ru: Добавьте МЕТАЛЛ вверх, для этого зажмите левую кнопку мыши и затем проведите курсором вверх при нажатой клавише CTRL.
zh_hans: 按住左键点击，然后 在按住 CTRL 的同时向上移动鼠标来向上添加金属块。

# SEPARATETRACEsABAndCThenVALIDATE
source: SEPARATE A, B and C connections. Then VALIDATE.
de: TRENN die Verbindungen A, B und C, dann VALIDIER.
es: SEPARA las conexiones A, B y C. Luego VALIDA.
fr: SÉPAREZ les connections A, B et C. Puis VALIDEZ.
it: SEPARA le connessioni A, B e C. Poi VERIFICA.
ja: 接続A、B、Cを分離してください。その後、検証してください。
ro: SEPARĂ conexiunile A, B și C. Apoi VALIDEAZĂ.
ru: РАЗЪЕДИНИТЕ соединения A, B и C. Затем ПРОВЕРЬТЕ.
zh_hans: 分离 A、B 和 C 连接。然后验证。

# LeftCTRLHoldLeftCLICKDownThenMoveUpToAddTracesVertically
source: Left CTRL + hold Left CLICK down, then move up to add METAL vertically.
de: STRG links gedrückt halten, Linksklick halten und nach oben ziehen, um METALL vertikal hinzuzufügen.
es: CTRL izquierdo + mantener pulsado CLIC IZQUIERDO y mover hacia arriba para añadir METAL verticalmente.
fr: CTRL gauche + maintenir le clic gauche, puis déplacer vers le haut pour ajouter des traces verticalement.
it: CTRL sinistro + tenendo premuto il tasto sinistro, poi muovi verso l'alto per aggiungere METALLO verticalmente.
ja: 左CTRLを押しながら左クリックを押し続け、 上に動かしてMETALを垂直に追加します。
ro: CTRL Stânga + ține Click Stânga apăsat, apoi mișcă sus pentru a adăuga METAL vertical.
ru: Зажмите левый CTRL и левую кнопку мыши, затем двигайте курсор вверх, чтобы добавить МЕТАЛЛ вертикально.
zh_hans: 左 CTRL + 按住左键点击， 然后向上移动以垂直添加金属。

# MetalTracesStartInTheGrayFloatingStateNNoEnergyFlows
source: Metal traces start in the gray floating state. No energy flows to/from a power source. They are basically disconnected pieces of wire.
de: Metallbahnen beginnen im grauen schwebenden Zustand.\nKeine Energie fließt zu/von einer Stromquelle. Sie\nsind im Grunde getrennte Drahtteile.
fr: Les pistes métalliques commencent dans l'état gris flottant.\nAucune énergie ne circule vers/depuis une source d'alimentation. Ce sont\nbasiquement des morceaux de fil déconnectés.
ja: 金属配線は灰色のフローティング状態から始まります。 電源から / 電源へはエネルギーが一切流れません。 基本的には切り離されたワイヤーの断片です。
ru: Металлические дорожки начинают в сером плавающем состоянии. Никакая энергия не течет к/от источника питания. Они по сути представляют собой отключенные куски провода.
zh_hans: 金属走线开始时处于灰色浮空状态。 没有能量从电源流入/流出。它们 基本上是断开的导线片段。
