Repository: Elorth-HC/hardchip-localization
Catalog: src/Areas/Tutorial/Texts/TutorialTexts.*.resx
Languages: de, es, fr, it, ja, ro, ru, zh_hans

# TestWithTheClickMeInputAtLeastOnceThenValidate
source: Test the 'Click Me!' input at least once then VALIDATE.
de: Teste den „Klick mich!“-Eingang mindestens einmal und VALIDIER anschließend.
es: Prueba la entrada «¡Haz clic!» al menos una vez y luego VALIDA.
fr: Testez une fois l'entrée « Click Me! » puis VALIDEZ.
it: Prova l'input 'Cliccami!' almeno una volta poi VERIFICA.
ja: 「Click Me!」入力を少なくとも一度テストしてから、VALIDATEしてください。
ro: Testează intrarea 'Click Me!' cel puțin o dată apoi VALIDEAZĂ.
ru: Протестируйте, нажав на ВХОД "Click Me!" хотя бы один раз, затем ПРОВЕРЬТЕ.
zh_hans: 至少测试一次"点击我！"输入，然后验证。

# TRACEINPUTAndOUTPUTBlocksCanHave3States1InRed0InBlue_KnownAsNEUTRALInGray
source: METAL and INPUT blocks can each be in one of three states: 1 (red) - connected to positive / VDD 0 (blue) - connected to ground / VSS _ (gray) - disconnected / floating / Hi-Z
de: METALL-, INPUT- und OUTPUT-Blöcke können 3 Zustände haben: 1 (rot), 0 (blau), _ (NEUTRAL, grau).
es: Los bloques METÁLICOS, de ENTRADA y SALIDA pueden tener 3 estados: 1 (en rojo), 0 (en azul), _ (conocido como NEUTRAL en gris).
fr: Les blocs METAL et INPUT peuvent chacun être dans l'un de trois états : 1 (rouge) - connecté au positif / VDD 0 (bleu) - connecté à la masse / VSS _ (gris) - déconnecté / flottant / Hi-Z
it: I blocchi di METALLO, INPUT e OUTPUT possono avere 3 stati: 1 (in rosso), 0 (in blu), _ (noto come NEUTRALE in grigio).
ja: METALブロックとINPUTブロックは、それぞれ次の3つの状態のいずれかになります： 1（赤）- 正極 / VDD に接続 0（青）- グランド / VSS に接続 _（灰）- 未接続 / フローティング / Hi-Z
ro: Blocurile METAL, INTRARE și IEȘIRE pot avea 3 stări: 1 (în roșu), 0 (în albastru), _ (cunoscut ca NEUTRU în gri).
ru: Блоки МЕТАЛЛ и ВХОД могут каждый находиться в одном из трех состояний: 1 (красный) - подключен к положительному / VDD 0 (синий) - подключен к земле / VSS _ (серый) - отключен / плавающий / Hi-Z
zh_hans: 金属块和输入块可以处于三种状态之一： 1（红色）- 连接到正极 / VDD 0（蓝色）- 连接到接地 / VSS _（灰色）- 断开 / 浮空 / 高阻态

# INPUTBlocksSends1Or0StatesToAdjacentTRACEBlocks
source: INPUT blocks can actively drive a signal, sending either a 1 or 0 into adjacent METAL blocks.
de: INPUT-Blöcke können aktiv ein Signal treiben und entweder eine 1 oder 0 in benachbarte METALL-Blöcke senden.
es: Los bloques de ENTRADA envían estados 1 o 0 a los bloques METÁLICOS adyacentes.
fr: Les blocs INPUT peuvent activement piloter un signal, envoyant soit un 1 soit un 0 dans les blocs METAL adjacents.
it: Il blocco di INPUT invia lo stato 1 o 0 ai blocchi di METALLO adiacenti.
ja: INPUTブロックは信号を能動的に駆動し、 隣接するMETALブロックに1または0を送信できます。
ro: Blocurile de INTRARE trimit stările 1 sau 0 către blocurile METAL adiacente.
ru: Блоки ВХОД могут активно управлять сигналом, отправляя 1 или 0 в соседние блоки МЕТАЛЛА.
zh_hans: 输入块可以主动驱动信号， 向相邻的金属块发送 1 或 0。

# OtherwiseALLBlockWillRevertToItsNaturalNEUTRALState
source: All other blocks simply propagate these signals along connected traces. If no INPUT continues to drive them, the signals eventually dissipate and the entire connected network of METAL returns to the floating state.
de: Alle anderen Blöcke leiten diese Signale einfach über verbundene Leitungen weiter. Wenn kein INPUT sie weiterhin treibt, lösen sich die Signale schließlich auf und das gesamte verbundene METALL-Netzwerk kehrt in den schwebenden Zustand zurück.
es: En caso contrario, TODOS los bloques volverán a su estado NEUTRAL natural.
fr: Tous les autres blocs propagent simplement ces signaux le long des connexions. Si aucun INPUT ne continue à les piloter, les signaux finissent par se dissiper et l'ensemble du réseau connecté de METAL retourne à l'état flottant.
it: Altrimenti TUTTI i blocchi torneranno al loro naturale stato NEUTRALE.
ja: 他のすべてのブロックは、接続された配線に沿ってこれらの信号を単に伝播させるだけです。 入力がそれらを駆動し続けない場合、信号は最終的に消散し、 接続された METAL のネットワーク全体がフローティング状態に戻ります。
ro: Altfel TOATE blocurile vor reveni la starea lor naturală NEUTRĂ.
ru: Все остальные блоки просто передают эти сигналы по соединениям. Если ни один ВХОД не продолжает их управлять, сигналы в конечном итоге рассеиваются, и вся соединенная сеть МЕТАЛЛА возвращается в плавающее состояние.
zh_hans: 所有其他方块只是沿着连接的走线传播这些信号。 如果没有输入继续驱动它们， 信号最终会消散，整个连接的 金属网络将返回浮空状态。

source: INPUTS are controlled by the validation process the moment you click on 'VALIDATE'.
de: Sobald du auf „VALIDIEREN“ klickst, werden INPUTS vom Validierungsprozess gesteuert.
es: Las ENTRADAS las controla el proceso de validación en el momento en que haces clic en «VALIDAR».
fr: Les INPUTS sont contrôlés par le processus de validation au moment où vous cliquez sur « VALIDATE ».
it: Gli INPUT sono controllati dal processo di verifica nel momento in cui premi 'VERIFICA'.
ja: 「VALIDATE」をクリックした瞬間に、 INPUTS はバリデーションプロセスによって制御されます。
ro: INTRĂRILE sunt controlate de procesul de validare în momentul când dai click pe 'VALIDEAZĂ'.
ru: ВХОДЫ управляются процессом проверки с момента как Вы нажмете "ПРОВЕРИТЬ".
zh_hans: 当你点击"验证"时， 输入由验证过程控制。

# BUTYouCanTestDifferentINPUTSSeedingStateByClickingOnIt
source: BUT you can test different INPUT's value by clicking on the label next to it.
de: Du kannst aber verschiedene Eingabewerte testen, indem du auf das Label neben dem INPUT klickst.
es: PERO puedes probar distintos valores de la ENTRADA haciendo clic en la etiqueta junto a ella.
fr: MAIS vous pouvez tester différents états d'INPUTS en cliquant dessus.
it: MA puoi provare valori in INPUT diversi cliccando sull'etichetta vicina ad esso.
ja: ただし、隣にあるラベルをクリックすることで、 INPUT のさまざまな値をテストできます。
ro: DAR poți testa diferite valori ale INTRĂRII dând click pe eticheta de lângă ea.
ru: НО Вы можете протестировать разные значения ВХОДА, кликнув по метке рядом с ним.
zh_hans: 但你可以通过点击旁边的标签 来测试不同的输入值。

source: Doing so will STOP the validation process.
de: Dadurch wird der Validierungsprozess ANGEHALTEN.
es: Hacerlo DETENDRÁ el proceso de validación.
fr: Faire cela ARRÊTERA le processus de validation.
it: Fare ciò FERMERÀ il processo di validazione.
ja: そうすると検証プロセスが停止します。
ro: Făcând așa va OPRI procesul de validare.
ru: Это действие ОСТАНОВИТ процесс проверки.
zh_hans: 这样做将停止验证过程。

source: Change the INPUT at least once, then VALIDATE.
de: Ändere den INPUT mindestens einmal und VALIDIER dann.
es: Cambia la ENTRADA al menos una vez y luego VALIDA.
fr: Changez l'INPUT au moins une fois, puis VALIDEZ.
it: Cambia l'INPUT almeno una volta, poi VERIFICA.
ja: INPUT を少なくとも一度変更してから、VALIDATE してください。
ro: Schimbă INTRAREA cel puțin o dată, apoi VALIDEAZĂ.
ru: Измените состояние ВХОД хотя бы один раз, затем ПРОВЕРЬТЕ.
zh_hans: 至少更改一次输入，然后验证。

source: MOS can take different shapes not limited to the 3x2x3 blocks.
de: MOS können verschiedene Formen annehmen und sind nicht auf 3×2×3-Blöcke beschränkt.
es: Los MOS pueden adoptar formas distintas, no se limitan a bloques de 3×2×3.
fr: Les MOS peuvent prendre différentes formes, non limitées aux blocs 3x2x3.
it: I MOS possono assumere diverse forme non limitate a 3x2x3 blocchi.
ja: MOS はさまざまな形状を取り得て、 3×2×3 のブロックに限定されません。
ro: MOS poate lua forme diferite nelimitat la blocurile 3x2x3.
ru: МОП может принимать различные формы и не ограничен блоками 3x2x3.
zh_hans: MOS 可以采用不同的形状， 不限于 3x2x3 方块。

source: Special shape MOS can have two gates and share the same channel.
de: Besonders geformte MOS können zwei Gates besitzen und sich denselben Kanal teilen.
es: Los MOS de forma especial pueden tener dos puertas y compartir el mismo canal.
fr: Les MOS à forme spéciale peuvent avoir deux portes et partager le même canal.
it: La forma speciale dei MOS ha due porte e condivide lo stesso canale.
ja: 特殊形状のMOSは2つのゲートを持ち、 同じチャネルを共有できます。
ro: MOS cu forme speciale pot avea două porți și pot împărți același canal.
ru: МОП особой формы может иметь два затвора и общий канал.
zh_hans: 特殊形状的 MOS 可以有两个栅极 并共享同一个通道。

# YouCantUseTraceHereOnlyPMOSFromTheBottomBuildMenu
source: You cant use METAL block here, only PMOS from the bottom build menu.
de: Hier kannst du keinen METALL-Block verwenden - nur PMOS aus dem unteren Baumenü.
es: No puedes usar bloques METÁLICOS aquí, solo PMOS del menú de construcción inferior.
fr: Vous ne pouvez pas utiliser de bloc METAL ici, seuls les PMOS du menu de construction du bas sont autorisés.
it: Puoi usare solo blocchi di METALLO qui, solo i PMOS dal menu di costruzione in basso.
ja: ここではMETALブロックは使用できません。 下部の建築メニューからPMOSのみ使用できます。
ro: Nu poți folosi blocul METAL aici, doar PMOS din meniul de construcție de jos.
ru: Здесь нельзя использовать МЕТАЛЛ - только ПМОП из нижнего меню построения.
zh_hans: 这里不能使用金属块，只能使用 底部构建菜单中的 PMOS。

source: Create a MERGED PMOS with 2 GATES then VALIDATE
de: Erstelle einen ZUSAMMENGEFASSTEN PMOS mit 2 GATES und VALIDIER anschließend.
es: Crea un PMOS COMBINADO con 2 PUERTAS y luego VALIDA
fr: Créez un PMOS FUSIONNÉ avec 2 PORTES puis VALIDEZ
it: Crea un POMS UNITO con 2 PORTE poi VERIFICA
ja: 2つのゲートを持つマージ済みPMOSを作成し、その後検証してください
ro: Creează un PMOS FUZIONAT cu 2 PORȚI apoi VALIDEAZĂ
ru: Создайте ОБЪЕДИНЁННЫЙ ПМОП с двумя ЗАТВОРАМИ, затем ПРОВЕРЬТЕ.
zh_hans: 创建一个带有 2 个栅极的合并 PMOS，然后验证

source: NMOS (Negative MOS) are the exact opposite of PMOS.
de: NMOS (Negative MOS) sind das genaue Gegenteil von PMOS.
es: Los NMOS (MOS negativos) son exactamente lo opuesto a los PMOS.
fr: Les NMOS (MOS négatifs) sont l'exact opposé des PMOS.
it: Gli NOMS (MOS Negativi) sono l'esatto opposto dei PMOS.
ja: NMOS（Negative MOS）はPMOSの正反対です。
ro: NMOS (MOS Negativ) sunt exact opusul PMOS.
ru: НМОП (МОП с Негативным каналом) - это полная противоположность ПМОП.
zh_hans: NMOS（负 MOS）与 PMOS 完全相反。

source: The blue strips help to differentiate the NMOS from a PMOS (which are red).
de: Die blauen Streifen helfen, NMOS (blau) von PMOS (rot) zu unterscheiden.
es: Las bandas azules ayudan a diferenciar el NMOS de un PMOS (que son rojos).
fr: Les bandes bleues aident à différencier les NMOS d'un PMOS (qui sont rouges).
it: Le strisce blu aiutano a distinguere il NMOS dal PMOS (che le ha rosse).
ja: 青いストライプは、NMOSをPMOS（赤）と区別するのに役立ちます。
ro: Benzile albastre ajută să diferențiezi NMOS de un PMOS (care sunt roșii).
ru: Синие полосы помогают отличить НМОП от ПМОП (у ПМОП полосы красные).
zh_hans: 蓝色条纹有助于区分 NMOS 和 PMOS（红色）。

source: Applying a 1 to the NMOS's gate activates it, allowing ONLY 0 going through it.
de: Wird dem Gate eines NMOS eine 1 angelegt, wird er aktiv und lässt NUR 0 passieren.
es: Aplicar un 1 a la puerta del NMOS lo activa, permitiendo que SOLO pase 0.
fr: Appliquer un 1 à la porte du NMOS l'active, en ne laissant passer QUE l'état 0.
it: Applicando 1 alla porta del NMOS lo attiverà, lasciando passare SOLO 0 attraverso.
ja: NMOSのゲートに1を印加すると有効になり、0だけを通します。
ro: Aplicarea unui 1 la poarta NMOS îl activează, permițând DOAR 0 să treacă prin el.
ru: Подача 1 на затвор НМОП активирует его, позволяя проходить ТОЛЬКО состоянию 0.
zh_hans: 向 NMOS 的栅极施加 1 会激活它， 只允许 0 通过。

source: Applying a 0 deactivates it, blocking ALL state going through it.
de: Eine 0 deaktiviert ihn und blockiert ALLE Zustände.
es: Aplicar un 0 lo desactiva, bloqueando que PASE CUALQUIER estado.
fr: Appliquer un 0 le désactive, bloquant TOUT état passant par lui.
it: Applicando 0 lo disattiverà, bloccando TUTTI gli stati che passano attraverso.
ja: 0を適用すると無効化され、あらゆる状態が通過するのをブロックします。
ro: Aplicarea unui 0 îl dezactivează, blocând TOATE stările care trec prin el.
ru: Подача 0 деактивирует его, блокируя прохождение ЛЮБОГО состояния через него.
zh_hans: 施加 0 会使其停用， 阻止所有状态通过。

source: Connect the NMOS properly then VALIDATE
de: Verbinde den NMOS korrekt und VALIDIER dann.
es: Conecta correctamente el NMOS y luego VALIDA
fr: Connectez correctement le NMOS puis VALIDEZ
it: Connetti il NMOS correttamente poi VERIFICA
ja: NMOSを正しく接続してから、検証してください
ro: Conectează NMOS corect apoi VALIDEAZĂ
ru: Подключите НМОП должным образом, затем ПРОВЕРЬТЕ.
zh_hans: 正确连接 NMOS，然后验证

source: A simple METAL connection can only transfer one state at a time. But MOSFET (Metal Oxide Semiconductors Field-effect Transistor) can react to states!
de: Eine einfache METALL-Verbindung kann immer nur einen Zustand übertragen. MOSFETs (Metal Oxide Semiconductor Field-effect Transistors) können jedoch auf Zustände reagieren!
es: Una conexión METÁLICA simple solo puede transferir un estado a la vez. Pero los MOSFET (Transistores de Efecto de Campo de Semiconductor de Óxido Metálico) pueden reaccionar a los estados!
fr: Une simple connections METAL ne peux transférer qu'un seul état à la fois. Mais les MOSFET (Metal Oxide Semiconductors Field-effect Transistor) peuvent réagir aux états!
it: Una semplice connessione di METALLO può trasferire solo uno stato. Ma i MOSFET (Transistor a Semiconduttori Ossido di Metallo con effetto-campo) possono reagire agli stati!
ja: 単純な金属接続では、一度に1つの状態しか伝送できません。 しかしMOSFET（金属酸化膜半導体電界効果トランジスタ）は状態に反応できます！
ro: O conexiune METAL simplă poate transfera doar o stare odată. Dar MOSFET (Metal Oxide Semiconductors Field-effect Transistor) poate reacționa la stări!
ru: МЕТАЛЛ может только передавать одно состояние за раз. Но МОП полевой транзистор (Металл Оксид Полупроводник) может реагировать на разные состояния!
zh_hans: 简单的金属连接一次只能传输一种状态。 但 MOSFET（金属氧化物半导体场效应晶体管） 可以对状态作出反应！

source: Here's a MOSFET, and moving forward we'll refer to it as MOS.
de: Hier siehst du einen MOSFET; im Folgenden nennen wir ihn kurz MOS.
es: Aquí hay un MOSFET, y de ahora en adelante lo llamaremos MOS.
fr: Voici un MOSFET, et dorénavant nous l'appellerons « MOS ».
it: Questo è un MOSFET, e d'ora in avanti ci riferiremo ad esso come MOS.
ja: こちらがMOSFETで、以降はMOSと呼びます。
ro: Aici este un MOSFET, și de acum înainte ne vom referi la el ca MOS.
ru: Вот МОП полевой транзистор, и далее мы будем называть его МОП.
zh_hans: 这是一个 MOSFET，今后 我们将称它为 MOS。

source: MOS has 2 major parts: the gate...
de: Ein MOS besteht aus zwei Hauptteilen: dem Gate...
es: Un MOS tiene 2 partes principales: la puerta...
fr: Le MOS possède 2 parties principales : la porte...
it: I MOS hanno 2 parti principali: la porta...
ja: MOSには2つの主要な部分があります：ゲート...
ro: MOS are 2 părți majore: poarta...
ru: У МОП есть 2 основные части: затвор...
zh_hans: MOS 有两个主要部分：栅极...

source: ... and the channel
de: ... und dem Kanal
es: ... y el canal
fr: ... et le canal
it: ... e il canale
ja: ... とチャンネル
ro: ... și canalul
ru: ... и канал.
zh_hans: ...以及通道

source: This one MOS is a PMOS (Positive-MOS). It acts like a switch that can be either 'activated' or 'deactivated' by any given state.
de: Dieser MOS ist ein PMOS (positiver MOS). Er funktioniert wie ein Schalter, der je nach Zustand aktiviert oder deaktiviert wird.
es: Este MOS es un PMOS (MOS positivo). Actúa como un interruptor que puede estar «activado» o «desactivado» según el estado aplicado.
fr: Ce MOS est un PMOS (MOS positif). Il agit comme un interrupteur qui peut être « activé » ou « désactivé » selon n'importe quel état donné.
it: Questo MOS è un PMOS (MOS Positivo). Funziona come un interruttore che può essere sia 'attivato' che 'disattivato' dato un qualsiasi stato.
ja: このMOSはPMOS（正のMOS）です。 任意の状態によって「有効化」または「無効化」されるスイッチのように動作します。
ro: Acest MOS este un PMOS (MOS-Pozitiv). Acționează ca un comutator care poate fi fie 'activat' sau 'dezactivat' de orice stare dată.
ru: Этот МОП - ПМОП (имеет Положительный канал). Он работает как переключатель, который может быть открыт или закрыт заданным состоянием.
zh_hans: 这个 MOS 是 PMOS（正 MOS）。它就像一个 开关，可以被任何给定的状态 "激活"或"停用"。

source: Applying 0 to the PMOS's gate activates it, allowing ONLY 1 going through it.
de: Legst du am Gate eines PMOS eine 0 an, wird er aktiv und lässt NUR 1 passieren.
es: Aplicar 0 a la puerta del PMOS lo activa, permitiendo que SOLO pase 1.
fr: Appliquer un 0 à la porte du PMOS l'active, en ne laissant passer QUE l'état 1.
it: Applicando 0 alla porta del PMOS lo attiverà, lasciando passare SOLO 1 attraverso.
ja: PMOSのゲートに0を加えると有効になり、1だけを通します。
ro: Aplicarea 0 la poarta PMOS îl activează, permițând DOAR 1 să treacă prin el.
ru: Подача 0 на затвор ПМОП активирует его, позволяя проходить ТОЛЬКО состоянию 1.
zh_hans: 向 PMOS 的栅极施加 0 会激活它， 只允许 1 通过。

source: Applying 1 deactivates it, blocking ALL state going through it.
de: Eine 1 deaktiviert ihn und blockiert ALLE Zustände.
es: Aplicar 1 lo desactiva, bloqueando que PASE CUALQUIER estado.
fr: Appliquer un 1 le désactive, bloquant TOUT état passant par lui.
it: Applicando 1 lo disattiverà, bloccando TUTTI gli stati che passano attraverso.
ja: 1を適用すると無効化され、あらゆる状態が通過するのをブロックします。
ro: Aplicarea 1 îl dezactivează, blocând TOATE stările care trec prin el.
ru: Подача 1 деактивирует его, блокируя прохождение ЛЮБОГО состояния через него.
zh_hans: 施加 1 会使其停用， 阻止所有状态通过。

source: Use the HELP button on top here or try wiring the PMOS by yourself
de: Nutze den HELP-Button hier oben oder versuche, den PMOS selbst zu verdrahten.
es: Usa el botón AYUDA de arriba o intenta cablear el PMOS tú mismo
fr: Utilisez le bouton HELP en haut ici ou essayez de câbler vous-même le PMOS.
it: Usa il pulsante AIUTO in alto qui o prova a collegare il PMOS da solo
ja: ここ上部のHELPボタンを使うか、PMOSを自分で配線してみてください
ro: Folosește butonul AJUTOR de sus aici sau încearcă să conectezi PMOS singur
ru: Используйте кнопку HELP наверху или попробуйте подключить ПМОП самостоятельно.
zh_hans: 使用顶部这里的帮助按钮，或尝试自己连接 PMOS

source: Connect the PMOS properly then VALIDATE
de: Verbinde den PMOS korrekt und VALIDIER dann.
es: Conecta correctamente el PMOS y luego VALIDA
fr: Connectez correctement le PMOS puis VALIDEZ
it: Connetti il PMOS correttamente poi VERIFICA
ja: PMOSを正しく接続してから、検証してください
ro: Conectează PMOS corect apoi VALIDEAZĂ
ru: Подключите ПМОП должным образом, затем ПРОВЕРЬТЕ.
zh_hans: 正确连接 PMOS，然后验证

source: Most of the time a SCHEMATIC is available with the Chip button on top here.
de: Meistens ist über den Chip-Button oben ein SCHALTPLAN verfügbar.
es: La mayoría de las veces hay un ESQUEMA disponible con el botón Chip de arriba.
fr: La plupart du temps, le bouton « Schémas » est disponible en haut ici.
it: La maggior parte delle volte uno SCHEMA è disponibile premendo il pulsante del chip qui in alto.
ja: ほとんどの場合、ここ上部の「Chip」ボタンから回路図を利用できます。
ro: De cele mai multe ori o SCHEMĂ este disponibilă cu butonul Chip de sus aici.
ru: Чаще всего есть СХЕМА, доступная по кнопке "чип" наверху.
zh_hans: 大多数时候，可以通过顶部这里的芯片按钮获得原理图。

source: It provides optional steps to build the chip for each level.
de: Er bietet optionale Schritte zum Aufbau des Chips für jedes Level.
es: Proporciona pasos opcionales para construir el chip en cada nivel.
fr: Il fournit des étapes facultatives pour construire la puce à chaque niveau.
it: Fornisce step opzionali per costruire il chip ogni livello.
ja: 各レベルごとにチップを構築するための任意の手順を提供します。
ro: Furnizează pași opționali pentru construirea chip-ului pentru fiecare nivel.
ru: Она предлагает вариант действий для сборки чипа на каждом уровне.
zh_hans: 它为每个关卡提供了构建芯片的可选步骤。

source: Use the SCHEMATIC (or not) to build an INVERTER, then VALIDATE
de: Nutze den SCHALTPLAN (oder auch nicht), um einen INVERTER zu bauen, und VALIDIER anschließend.
es: Usa el ESQUEMA (o no) para construir un INVERSOR y luego VALIDA
fr: Utilisez (ou non) le SCHÉMA pour construire un INVERTER, puis VALIDEZ
it: Usa lo SCHEMA (o no) per costruire un INVERTITORE, poi VERIFICA
ja: 回路図（使っても使わなくても）を使ってインバータを作り、その後に検証してください
ro: Folosește SCHEMA (sau nu) pentru a construi un INVERTOR, apoi VALIDEAZĂ
ru: Используйте СХЕМУ (или нет), чтобы собрать ИНВЕРТОР, затем ПРОВЕРЬТЕ.
zh_hans: 使用原理图（或不使用）构建反相器，然后验证

source: You can use R to rotate PMOS/NMOS or any selection of blocks.
de: Mit R kannst du PMOS/NMOS oder jede Blockauswahl drehen.
es: Puedes usar R para rotar PMOS/NMOS o cualquier selección de bloques.
fr: Vous pouvez utiliser R pour faire pivoter un PMOS/NMOS ou n'importe quelle sélection de blocs.
it: Puoi usare R per ruotare i PMOS/NMOS o qualsiasi altra selezione di blocchi.
ja: 「R」を使用して PMOS/NMOS または 選択されたブロックを回転できます。
ro: Poți folosi R pentru a roti PMOS/NMOS sau orice selecție de blocuri.
ru: Вы можете использовать клавишу R, чтобы поворачивать ПМОП/НМОП или любую выделенную группу блоков.
zh_hans: 你可以使用 R 键旋转 PMOS/NMOS 或任何选中的方块。

source: Connecting 2 INPUTS with the OPPOSITE states 1 and 0 will result in a SHORT CIRCUIT.
de: Verbindest du zwei INPUTS mit entgegengesetzten Zuständen 1 und 0, entsteht ein KURZSCHLUSS.
es: Conectar 2 ENTRADAS con estados OPUESTOS 1 y 0 provocará un CORTOCIRCUITO.
fr: Connecter 2 INPUTS ayant des états OPPOSÉS (1 et 0) provoquera un COURT-CIRCUIT.
it: Connettendo 2 INPUTS con lo stato OPPOSTO 1 e 0 risulterà in CORTOCIRCUITO.
ja: 状態が互いに反対の 1 と 0 の 2 つの入力を接続すると、 短絡が発生します。
ro: Conectarea a 2 INTRĂRI cu stări OPUSE 1 și 0 va rezulta într-un SCURTCIRCUIT.
ru: Соединение двух ВХОДОВ с ПРОТИВОПОЛОЖНЫМИ состояниями 1 и 0 приведет к КОРОТКОМУ ЗАМЫКАНИЮ.
zh_hans: 连接两个状态相反（1 和 0）的输入 将导致短路。

source: A SHORT CIRCUIT will prevent the DIE from properly functioning in unexpected ways.
de: Ein KURZSCHLUSS verhindert, dass der DIE ordnungsgemäß funktioniert - oft auf unerwartete Weise.
es: Un CORTOCIRCUITO impedirá que la OBLEA funcione correctamente de forma inesperada.
fr: Un COURT-CIRCUIT empêchera le DIE de fonctionner correctement, d'une manière imprévisible.
it: Un CORTOCIRCUITO impedirà al CIRCUITO di funzionare correttamente in modi inaspettati.
ja: 短絡が発生すると、ダイが予期しない形で 正常に動作しなくなります。
ro: Un SCURTCIRCUIT va împiedica PLACA să funcționeze corespunzător în moduri neașteptate.
ru: КОРОТКОЕ ЗАМЫКАНИЕ предотвратит правильную работу КРИСТАЛЛА непредвиденным образом.
zh_hans: 短路将以意想不到的方式 阻止晶片正常工作。

# ToIsolateThe2INPUTSFromEachOtherHoldALTDownAndClickOnATRACEToRemoveIt
source: To isolate the 2 INPUTS from each other, hold 'ALT' down and click on a METAL block to remove it.
de: Um die beiden INPUTS voneinander zu isolieren, halte ALT gedrückt und klicke auf einen METALL-Block, um ihn zu entfernen.
es: Para aislar las 2 ENTRADAS entre sí, mantén pulsada ALT y haz clic en un bloque METÁLICO para eliminarlo.
fr: Pour isoler les 2 INPUTS l'une de l'autre, maintenez la touche ALT et cliquez sur un bloc METAL pour le retirer.
it: Per isolare i 2 INPUT l'uno dall'altro, tieni premuto 'ALT' e clicca su un blocco di METALLO per rimuoverlo.
ja: 2つのINPUTを互いに分離するには、 「ALT」を押しながらMETALブロックをクリックして削除します。
ro: Pentru a izola cele 2 INTRĂRI una de cealaltă, ține apăsat 'ALT' și click pe un bloc METAL pentru a-l elimina.
ru: Чтобы изолировать два ВХОДА друг от друга, удерживайте "ALT" и щелкните по блоку МЕТАЛЛА, чтобы его удалить.
zh_hans: 要将两个输入相互隔离，按住 ALT 并点击金属块将其移除。

source: Fix the SHORT CIRCUIT, then VALIDATE
de: Behebe den KURZSCHLUSS und VALIDIER dann.
es: Repara el CORTOCIRCUITO y luego VALIDA
fr: Corrigez le COURT-CIRCUIT, puis VALIDEZ
it: Ripara il CORTOCIRCUITO, poi VERIFICA
ja: 短絡を修理してから、検証してください
ro: Repară SCURTCIRCUITUL, apoi VALIDEAZĂ
ru: Устраните КОРОТКОЕ ЗАМЫКАНИЕ, затем ПРОВЕРЬТЕ.
zh_hans: 修复短路，然后验证

source: To isolate METAL pathways from each other, they must have at least 1 empty space between them in any direction. Otherwise they are connected.
de: Um METALL-Leitungen voneinander zu isolieren, muss in jeder Richtung mindestens ein Leerfeld Abstand bestehen - sonst sind sie verbunden.
es: Para aislar rutas METÁLICAS entre sí, deben tener al menos 1 espacio vacío entre ellas en cualquier dirección. De lo contrario, están conectadas.
fr: Pour isoler des voies métallique l'une de l'autre, il faut qu'il y ait au moins 1 espace vide entre elles dans toutes les directions. Sinon, elles sont connectées.
it: Per isolare una tracce di METALLO l'una dall'altra, devono avere almeno 1 spazio vuoto tra di loro in ogni direzione. Altrimenti sono connesse.
ja: METALの経路同士を互いに絶縁するには、 どの方向でも間に少なくとも空きマスが1つ必要です。 そうでない場合は接続されています。
ro: Pentru a izola căile METAL unele de altele, ele trebuie să aibă cel puțin 1 spațiu gol între ele în orice direcție. Altfel sunt conectate.
ru: Чтобы изолировать линии МЕТАЛЛА друг от друга, между ними должна быть хотя бы одна пустая ячейка в любом направлении. В противном случае они соединены.
zh_hans: 要将金属路径相互隔离，它们之间 在任何方向上必须至少有 1 个空格。 否则它们是连接的。
