Repository: Elorth-HC/hardchip-localization
Catalog: src/Areas/Tutorial/Texts/TutorialTexts.*.resx
Languages: de, es, fr, it, ja, ro, ru, zh_hans

source: Representing negative number (signed number) can't be done with the previous solutions as is.
de: Die Darstellung negativer Zahlen (Vorzeichen) ist mit den bisherigen Lösungen so nicht möglich.
es: Representar números negativos (con signo) no puede hacerse con las soluciones anteriores tal cual.
fr: Représenter un nombre négatif (nombre signé) n'est pas réalisable avec les solutions précédentes telles quelles.
it: Rappresentare i numeri negativi (numeri con segno) non può essere fatto con le soluzioni precedenti così come sono.
ja: 負の数（符号付き数）を表現することは、 これまでの解決策をそのままでは実現できません。
ro: Reprezentarea numerelor negative (numere cu semn) nu poate fi făcută cu soluțiile anterioare ca atare.
ru: Представление отрицательного числа (со знаком) нельзя выполнить с использованием предыдущих решений в их текущем виде.
zh_hans: 表示负数（有符号数） 无法直接使用之前的解决方案实现。

source: A small twist can bring that representation while still reusing all previous solutions.
de: Ein kleiner Kniff ermöglicht diese Darstellung, wobei alle bisherigen Lösungen weiterverwendet werden.
es: Un pequeño giro puede aportar esa representación y seguir reutilizando todas las soluciones anteriores.
fr: Un léger ajustement peut apporter cette représentation tout en réutilisant toutes les solutions précédentes.
it: Un piccolo aggiustamento può portare quella rappresentazione riutilizzando tutte le soluzioni precedenti.
ja: ちょっとした工夫でその表現が可能になり、 これまでの解決策をすべて引き続き再利用できます。
ro: O mică modificare poate aduce acea reprezentare reutilizând în continuare toate soluțiile anterioare.
ru: Небольшое изменение позволит получить это представление, все ещё используя все предыдущие решения.
zh_hans: 一个小技巧可以实现这种表示法， 同时仍然复用之前所有的解决方案。

source: This is the number representation used so far.
de: Das ist die bisher verwendete Zahlen­darstellung.
es: Esta es la representación numérica utilizada hasta ahora.
fr: Voici la représentation numérique utilisée jusqu'à présent.
it: Questa è la rappresentazione dei numeri usata fino ad ora.
ja: これはこれまで使用されてきた数値表現です。
ro: Aceasta este reprezentarea numerelor folosită până acum.
ru: Вот используемое до этого представление чисел.
zh_hans: 这是目前使用的数字表示法。

source: Here's the negative number representation compatible output.
de: Hier ist die mit negativen Zahlen kompatible Ausgabe.
es: Aquí está la salida compatible con la representación de números negativos.
fr: Voici la sortie compatible avec la représentation des nombres négatifs.
it: Questa è la rappresentazione negativa del numero compatibile con l'output.
ja: 負の数の表現に対応した出力はこちらです。
ro: Aici este ieșirea compatibilă cu reprezentarea numerelor negative.
ru: Вот вывод, совместимый с представлением отрицательных чисел.
zh_hans: 这是兼容负数表示法的输出。

source: Set INDIVIDUAL INPUT BITS to match the OUTPUT value, then MANUALLY VALIDATE step by step
de: Stelle die EINZELNEN EINGANGSBITS so ein, dass sie dem AUSGABEwert entsprechen, und VALIDIERE dann SCHRITT FÜR SCHRITT MANUELL.
es: Ajusta LOS BITS DE ENTRADA INDIVIDUALES para que coincidan con el valor de SALIDA, luego VALÍDALO MANUALMENTE paso a paso
fr: Réglez les BITS D'ENTRÉE INDIVIDUELS pour correspondre à la valeur de SORTIE, puis VALIDEZ MANUELLEMENT étape par étape
it: Imposta i SINGOLI BIT in INPUT in modo da uguagliare il valore di OUTPUT, poi VERIFICA MANUALMENTE passo per passo
ja: 個々の入力ビットを出力値に一致するように設定し、 次に手動でステップごとに検証してください
ro: Setează BIȚII DE INTRARE INDIVIDUALI pentru a se potrivi cu valoarea de IEȘIRE, apoi VALIDEAZĂ MANUAL pas cu pas
ru: Установите КАЖДЫЙ ВХОДНОЙ БИТ, чтобы соответствовать значению ВЫВОДА, затем ВРУЧНУЮ ПРОВЕРЬТЕ каждый этап.
zh_hans: 设置各个输入位以匹配输出值， 然后逐步手动验证

# TRACEsCanBeTrickyToPlaceWithoutTouchingEachOther
source: Sometime, connections can be tricky to place without touching other ones.
de: Manchmal ist es knifflig, Verbindungen zu platzieren, ohne dass sie sich berühren.
es: A veces, las conexiones pueden ser complicadas de colocar sin tocar otras.
fr: Certaines connections peuvent être délicates à placer sans qu'elles n'en touchent d'autres.
it: A volte, può essere complicato piazzare connessioni senza che si tocchino tra loro.
ja: ときどき、ほかの接続に触れずに接続を配置するのは難しいことがあります。
ro: Uneori, conexiunile pot fi dificil de plasat fără să se atingă unele de altele.
ru: Иногда соединения бывает непросто разместить так, чтобы они не соприкасались с другими.
zh_hans: 有时，连线放置时不触碰其他连线 可能会比较棘手。

source: Connect INPUT and OUTPUT without SHORT CIRCUIT, then VALIDATE.
de: Verbinde EINGANG und AUSGANG ohne KURZSCHLUSS und VALIDIER dann.
es: Conecta la ENTRADA y la SALIDA sin CORTOCIRCUITO y luego VALIDA.
fr: Connectez l'ENTRÉE et la SORTIE sans COURT-CIRCUIT, puis VALIDEZ.
it: Connetti INPUT e OUTPUT senza CORTOCIRCUITI, poi VERIFICA.
ja: 短絡させずにINPUTとOUTPUTを接続し、その後に検証してください。
ro: Conectează INTRAREA și IEȘIREA fără SCURTCIRCUIT, apoi VALIDEAZĂ.
ru: Подключите ВХОД и ВЫХОД без КОРОТКОГО ЗАМЫКАНИЯ, затем ПРОВЕРЬТЕ.
zh_hans: 连接输入和输出，避免短路，然后验证。

source: Use the 'Compacting the Inverter' blueprint then validate.
de: Verwende die Blaupause „Den Inverter komprimieren“ und validiere anschließend.
es: Usa el plano «Compactar el Inversor» y luego valida.
fr: Utilisez le plan « Compacter l'INVERTER » puis validez.
it: Usa il progetto 'Invertitore compattato', poi VERIFICA.
ja: 「Compacting the Inverter」ブループリントを使用してから、検証してください。
ro: Folosește planul 'Compacting the Inverter' apoi validează.
ru: Используйте чертеж "Compacting the Inverter", затем проверьте.
zh_hans: 使用"压缩反相器"蓝图然后验证。

source: It would be very inefficient to rebuild every circuit from scratch
de: Es wäre sehr ineffizient, jeden Schaltkreis komplett neu zu bauen.
es: Sería muy ineficiente reconstruir cada circuito desde cero
fr: Il serait très inefficace de reconstruire chaque circuit à partir de zéro
it: Sarebbe veramente inefficiente ricostruire ogni circuito da capo
ja: すべての回路をゼロから 作り直すのは非常に非効率です
ro: Ar fi foarte ineficient să reconstruiești fiecare circuit de la zero
ru: Было бы крайне неэффективно собирать каждую схему с нуля.
zh_hans: 每次从头重建电路 是非常低效的

source: To reuse what you already built, save any circuit as a BLUEPRINT and then just select it to get a copy for placement.
de: Um bereits Gebautes wiederzuverwenden, speichere jeden Schaltkreis als BLAUPAUSE und wähle ihn dann einfach aus, um eine Kopie zu platzieren.
es: Para reutilizar lo que ya construiste, guarda cualquier circuito como un PLANO y luego simplemente selecciónalo para obtener una copia y colocarla.
fr: Pour réutiliser ce que vous avez déjà construit, enregistrez n'importe quel circuit sous forme de BLUEPRINT, puis sélectionnez-le simplement pour en obtenir une copie à placer.
it: Per riutilizzare ciò che hai già costruito, salva un qualsiasi circuito come PROGETTO e poi selezionalo per ottenere una sua copia da piazzare.
ja: すでに作ったものを再利用するには、 任意の回路をブループリントとして保存し、 あとはそれを選択するだけで配置用のコピーを取得できます。
ro: Pentru a reutiliza ceea ce ai construit deja, salvează orice circuit ca PLAN și apoi doar selectează-l pentru a obține o copie pentru plasare.
ru: Чтобы повторно использовать то, что Вы уже собрали, сохраните схему как ЧЕРТЁЖ, а затем просто выберите её, чтобы получить копию для размещения.
zh_hans: 要复用已构建的电路， 将任何电路保存为蓝图， 然后选择它即可获得副本进行放置。

source: Each stage saves your passing circuit as a BLUEPRINT too for you to use. You can create/edit your own as well.
de: Jede Herausforderung speichert deinen bestandenen Schaltkreis ebenfalls als BLAUPAUSE, die du nutzen kannst. Du kannst auch eigene erstellen/bearbeiten.
es: Cada fase guarda tu circuito aprobado como PLANO para que lo uses. También puedes crear o editar los tuyos propios.
fr: Chaque niveau enregistre également votre circuit réussi sous forme de BLUEPRINT pour que vous puissiez l'utiliser. Vous pouvez créer/éditer les vôtres aussi.
it: Ogni fase salva anche i circuiti che passano come PROGETTI per poterli riutilizzare. Puoi anche creare/modificare i tuoi.
ja: 各ステージでは、合格した回路も使用できるようにブループリントとして保存されます。 自分のものも作成と編集できます。
ro: Fiecare etapă salvează circuitul tău de trecere ca PLAN de asemenea pentru ca tu să-l folosești. Poți crea/edita și pe ale tale.
ru: Каждый уровень также сохраняет Вашу последнюю схему как ЧЕРТЁЖ для Вашего использования. Вы также можете создавать и редактировать свои собственные чертежи.
zh_hans: 每个关卡也会将你通过的电路 保存为蓝图供你使用。 你也可以创建/编辑自己的蓝图。

source: Use the BLUEPRINT mode to place an INVERTER onto the DIE, then VALIDATE.
de: Benutze den BLAUPAUSEN-Modus, um einen INVERTER auf dem DIE zu platzieren, und VALIDIER danach.
es: Usa el modo PLANO para colocar un INVERSOR en la OBLEA y luego VALIDA.
fr: Utilisez le mode BLUEPRINT pour placer un INVERTER sur le DIE, puis VALIDEZ.
it: Usa la modalità PROGETTO per piazzare un INVERTITORE sul circuito, poi VERIFICA.
ja: ブループリントモードを使用してダイ上にINVERTERを配置し、その後VALIDATEしてください。
ro: Folosește modul PLAN pentru a plasa un INVERTOR pe PLACĂ, apoi VALIDEAZĂ.
ru: Используйте режим ЧЕРТЕЖИ, чтобы разместить ИНВЕРТОР на КРИСТАЛЛЕ, затем ПРОВЕРЬТЕ.
zh_hans: 使用蓝图模式将反相器放置到晶片上，然后验证。

source: The DIE size was fixed until now; now the size will be dynamic to the right and bottom direction.
de: Die DIE-Größe war bisher fest; ab jetzt passt sie sich dynamisch nach rechts und unten an.
es: El tamaño de la OBLEA era fijo hasta ahora; ahora será dinámico hacia la derecha y hacia abajo.
fr: La taille du DIE était fixe jusqu'à présent ; à présent, sa taille sera dynamique vers la droite et vers le bas.
it: La dimensione del CIRCUITO era fissa fino ad ora; adesso la dimensione sarà dinamica verso destra verso il basso.
ja: これまでダイサイズは固定でしたが、 今後は右方向および下方向に動的に変化します。
ro: Dimensiunea PLĂCII era fixă până acum; acum dimensiunea va fi dinamică în direcția dreaptă și de jos.
ru: До сих пор размер КРИСТАЛЛА был фиксирован; теперь он динамически расширяется вправо и вниз.
zh_hans: 到目前为止晶片尺寸是固定的；现在尺寸将 向右和向下方向动态变化。

source: If you need more space, just build outside the DIE to extend it.
de: Wenn du mehr Platz brauchst, baue einfach außerhalb des DIE, um ihn zu vergrößern.
es: Si necesitas más espacio, simplemente construye fuera de la OBLEA para ampliarla.
fr: Si vous avez besoin de plus d'espace, construisez simplement en dehors du DIE pour l'étendre.
it: Se hai bisogno di più spazio, costruisci semplicemente fuori dal CIRCUITO per estenderlo.
ja: もっとスペースが必要なら、ダイの外側に 作って拡張すればいいだけです。
ro: Dacă ai nevoie de mai mult spațiu, doar construiește în afara PLĂCII pentru a o extinde.
ru: Если вам нужно больше места, просто постройте за пределами КРИСТАЛЛА, чтобы его расширить.
zh_hans: 如果需要更多空间， 只需在晶片外部构建以扩展它。

source: When you validate, any empty contiguous spaces will AUTOMATICALY be removed.
de: Beim Validieren werden zusammenhängende Leerflächen AUTOMATISCH entfernt.
es: Cuando valides, los espacios vacíos contiguos se eliminarán AUTOMÁTICAMENTE.
fr: Lorsque vous validez, tout espace contigu vide est AUTOMATIQUEMENT supprimé.
it: Quando verifichi, ogni spazio vuoto adiacente verrà AUTOMATICAMENTE rimosso.
ja: 検証すると、連続する空白は自動的に削除されます。
ro: Când validezi, orice spații goale continue vor fi AUTOMAT eliminate.
ru: При ПРОВЕРКЕ все пустые смежные области будут АВТОМАТИЧЕСКИ удалены.
zh_hans: 验证时，任何空的连续空间 将自动被移除。

source: Doing so will shift any output to the new edge location.
de: Dadurch verschieben sich eventuell Ausgänge an die neue Kante.
es: Al hacerlo, cualquier salida se desplazará a la nueva posición del borde.
fr: Cela décalera toute sortie vers la nouvelle position de bordure.
it: Fare ciò farà spostare qualsiasi output su una nuova posizione sul bordo.
ja: そうすると、すべての出力が新しいエッジ位置へ移動します。
ro: Făcând așa va muta orice ieșire la noua locație de margine.
ru: При этом любые выходы сместятся к новому краю кристалла.
zh_hans: 这样做将把输出移动到新的边缘位置。

source: Try removing any block in this column and then validate to compact the die.
de: Entferne einen beliebigen Block in dieser Spalte und validiere dann, um den DIE zu verkleinern.
es: Prueba a quitar cualquier bloque de esta columna y luego valida para compactar la oblea.
fr: Essayez de retirer n'importe quel bloc dans cette colonne, puis validez pour compacter le DIE.
it: Prova a rimuovere un qualsiasi blocco in questa colonna e poi verifica per compattare questo circuito.
ja: この列の任意のブロックを削除してから、 検証してダイをコンパクトにしてみてください。
ro: Încearcă să elimini orice bloc din această coloană și apoi validează pentru a compacta placa.
ru: Попробуйте убрать любой блок в этом столбце, а затем выполните проверку, чтобы уплотнить кристалл.
zh_hans: 尝试移除此列中的任何方块， 然后验证以压缩晶片。

source: INFO: FULL REPORT UNLOCKED.
de: INFO: VOLLSTÄNDIGER BERICHT FREIGESCHALTET.
es: INFO: INFORME COMPLETO DESBLOQUEADO.
fr: INFO : RAPPORT COMPLET DÉVERROUILLÉ.
it: INFO: RAPPORTO COMPLETO SBLOCCATO.
ja: 情報: 完全なレポートが解除されました。
ro: INFO: RAPORT COMPLET DEBLOCAT.
ru: ИНФО: ПОЛНЫЙ ОТЧЕТ РАЗБЛОКИРОВАН.
zh_hans: 信息：完整报告已解锁。

source: COMPACT and OPTIMIZE the INVERTER, then VALIDATE.
de: KOMPRIMIERE und OPTIMIERE den INVERTER und VALIDIER anschließend.
es: COMPACTA y OPTIMIZA el INVERSOR, luego VALIDA.
fr: COMPACTEZ et OPTIMISEZ l'INVERTER, puis VALIDEZ.
it: COMPATTA e OTTIMIZZA l'INVERTITORE, poi VERIFICA.
ja: インバータをコンパクト化して最適化し、その後に検証してください。
ro: COMPACTEAZĂ și OPTIMIZEAZĂ INVERTORUL, apoi VALIDEAZĂ.
ru: УПЛОТНИТЕ и ОПТИМИЗИРУЙТЕ ИНВЕРТОР, затем ПРОВЕРЬТЕ.
zh_hans: 压缩并优化反相器，然后验证。

source: Tip: To do a cuboid select, hold left CTRL while selecting or deleting.
de: Tipp: Um einen Quader auszuwählen, halte STRG links gedrückt, während du auswählst oder löschst.
es: Consejo: Para hacer una selección cúbica, mantén pulsado CTRL izquierdo mientras seleccionas o eliminas.
fr: Astuce : pour effectuer une sélection cuboïde, maintenez la touche CTRL gauche enfoncée tout en sélectionnant ou en supprimant.
it: Consiglio: Per fare una selezione cubica, tieni premuto CTRL sinistro mentre selezioni o cancelli.
ja: ヒント: 直方体選択を行うには、選択または削除中に 左CTRLを押し続けてください。
ro: Sfat: Pentru a face o selecție cuboidă, ține apăsat CTRL stânga în timp ce selectezi sau ștergi.
ru: Совет: чтобы выделять кубоидом, удерживайте левый CTRL при выборе или удалении.
zh_hans: 提示：要进行立方体选择，请在选择 或删除时按住左 CTRL。

source: Area too large
de: Bereich zu groß
es: Área demasiado grande
fr: Zone trop grande
it: Area troppo grande
ja: 領域が大きすぎます
ro: Zonă prea mare
ru: Площадь слишком велика
zh_hans: 区域过大

source: Validation usually requires multiple steps. Each step has its own requirement. All are listed on top here.
de: Manche Validierungen erfordern mehrere Schritte. Jeder Schritt hat eigene Anforderungen - sie sind hier oben aufgelistet.
es: La validación suele requerir varios pasos. Cada paso tiene su propio requisito. Todos se enumeran arriba.
fr: Certaines validations nécessitent plusieurs étapes. Chaque étape a ses propres exigences. Elles sont toutes listées ci-dessus.
it: La verifica di solito richiede più passi. Ogni passo ha il suo requisito. Sono tutti elencati in alto qui.
ja: 検証には通常、複数の手順が必要です。 各手順にはそれぞれ要件があります。 すべて上部に一覧表示されています。
ro: Validarea necesită de obicei mai mulți pași. Fiecare pas are propria cerință. Toate sunt enumerate sus aici.
ru: Проверки обычно требуют нескольких шагов. Каждый шаг имеет свои требования. Все перечислены вверху экрана.
zh_hans: 验证通常需要多个步骤。 每个步骤都有自己的要求。 所有要求都列在顶部这里。

source: Each step is verified in order, one after the other. If a step fails to be verified, the validation stops.
de: Die Schritte werden der Reihe nach geprüft. Scheitert ein Schritt, bricht die Validierung ab.
es: Cada paso se verifica en orden, uno tras otro. Si un paso falla, la validación se detiene.
fr: Chaque étape est vérifiée dans l'ordre, l'une après l'autre. Si une étape n'est pas validée, le processus de validation s'arrête.
it: Ogni passo è verificato in ordine, uno dopo l'altro. Se un passo fallisce la verifica, la validazione si interromperà.
ja: 各ステップは順番に、1つずつ検証されます。 いずれかのステップの検証に失敗した場合、 検証は停止します。
ro: Fiecare pas este verificat în ordine, unul după celălalt. Dacă un pas eșuează să fie verificat, validarea se oprește.
ru: Каждый шаг проверяется по порядку один за другим. Если какой-то шаг не проходит проверку, процесс проверки останавливается.
zh_hans: 每个步骤按顺序逐一验证。 如果某个步骤验证失败， 验证将停止。

source: Build a solution that meets the CRITERIA, then VALIDATE.
de: Baue eine Lösung, die die KRITERIEN erfüllt, und VALIDIER dann.
es: Construye una solución que cumpla los CRITERIOS y luego VALIDA.
fr: Construisez une solution qui respecte les CRITÈRES, puis VALIDEZ.
it: Costruisci una soluzione che rispetti i CRITERI, poi VERIFICA.
ja: 基準を満たすソリューションを構築し、その後に検証してください。
ro: Construiește o soluție care îndeplinește CRITERIILE, apoi VALIDEAZĂ.
ru: Постройте решение, соответствующее КРИТЕРИЯМ, затем ПРОВЕРЬТЕ.
zh_hans: 构建一个满足条件的解决方案，然后验证。

source: I'm here to help. Trust in the guidance I offer, for my only aim is to lead you to resolution.
de: Ich bin hier, um zu helfen. Vertraue meiner Anleitung - ich möchte dich nur zur Lösung führen.
es: Estoy aquí para ayudar. Confía en la guía que te ofrezco, pues mi único objetivo es llevarte a la resolución.
fr: Je suis là pour vous aider. Ayez confiance dans les conseils que je vous donne, car mon seul objectif est de vous mener à la résolution.
it: Sono qui per aiutarti. Fidati delle istruzioni che ti darò, il mio solo scopo è portarti alla risoluzione.
ja: 私はあなたを助けるためにここにいます。私が示す案内を信じてください。 私の唯一の目的は、あなたを解決へ導くことです。
ro: Sunt aici să ajut. Ai încredere în îndrumarea pe care o ofer, căci singurul meu scop este să te conduc către rezolvare.
ru: Я здесь, чтобы помочь. Доверьтесь моим советам, ведь моя единственная цель - привести Вас к разрешению.
zh_hans: 我在这里帮助你。相信我提供的指导， 因为我的唯一目的是带领你解决问题。

source: This one block is a SUBSTRATE block, see it as the support for everything else.
de: Dieser einzelne Block ist ein SUBSTRAT-Block - er dient als Grundlage für alles andere.
es: Este bloque es un bloque de SUSTRATO, considéralo el soporte para todo lo demás.
fr: Ce bloc est un bloc SUBSTRAT ; voyez-le comme le support de tout le reste.
it: Questo blocco è un blocco SUBSTRATO, vedilo come un supporto per tutto il resto.
ja: この1つのブロックはSUBSTRATEブロックで、 他のすべてを支える土台だと考えてください。
ro: Acest bloc este un bloc SUBSTRAT, vezi-l ca suportul pentru tot restul.
ru: Этот блок - ПОДЛОЖКА. Воспринимайте его, как основа для всего остального.
zh_hans: 这个方块是基底块， 把它看作是其他一切的支撑。

source: This is the DIE, it is composed of the entire set of all blocks.
de: Dies ist der DIE: Er besteht aus allen Blöcken zusammen.
es: Esta es la OBLEA; está compuesta por el conjunto completo de bloques.
fr: Ceci est le DIE, il est composé de l'ensemble de tous les blocs.
it: Questo è il CIRCUITO, è composto dall'insieme di tutti i blocchi.
ja: これはダイであり、すべてのブロックの 全体集合で構成されています。
ro: Aceasta este PLACA, este compusă din întregul set al tuturor blocurilor.
ru: Это - КРИСТАЛЛ, он является совокупностью всех блоков.
zh_hans: 这是晶片，它由所有方块的 完整集合组成。

source: This is an INPUT block, it provides signal to the DIE to process it.
de: Das ist ein INPUT-Block; er liefert das Signal, das der DIE verarbeitet.
es: Este es un bloque de ENTRADA; proporciona señal a la OBLEA para procesarla.
fr: Voici un bloc INPUT, il fournit le signal au DIE pour le traiter.
it: Questo è un blocco di INPUT, fornisce il segnale al circuito per essere processato.
ja: これはINPUTブロックで、 ダイが処理するための信号を提供します。
ro: Acesta este un bloc de INTRARE, furnizează semnal către PLACĂ pentru a-l procesa.
ru: Этот блок - ВХОД, он предоставляет сигнал КРИСТАЛЛУ для обработки.
zh_hans: 这是一个输入块，它向晶片 提供信号进行处理。

source: This is an OUTPUT block, it receives the signal processed by the DIE.
de: Das ist ein OUTPUT-Block; er erhält das Signal, das der DIE ausgibt.
es: Este es un bloque de SALIDA; recibe la señal procesada por la OBLEA.
fr: Voici un bloc OUTPUT, il reçoit le signal traité par le DIE.
it: Questo è un blocco di OUTPUT, riceve il segnale processato dal circuito.
ja: これはOUTPUTブロックで、 ダイによって処理された信号を受け取ります。
ro: Acesta este un bloc de IEȘIRE, primește semnalul procesat de PLACĂ.
ru: Этот блок - ВЫХОД, он принимает сигнал, обработанный КРИСТАЛЛОМ.
zh_hans: 这是一个输出块，它接收 晶片处理后的信号。

source: This DIE needs to fullfill a simple task: outputing what it receives on the input.
de: Dieser DIE hat eine einfache Aufgabe: Er soll das am Eingang empfangene Signal ausgeben.
es: Esta OBLEA debe cumplir una tarea sencilla: emitir lo que recibe por la entrada.
fr: Ce DIE doit accomplir une tâche simple : sortir ce qu'il reçoit en entrée.
it: Questo circuito deve soddisfare questa semplice richiesta: mandare in output ciò che riceve in input.
ja: このダイは単純なタスクを果たす必要がある: 入力で受け取ったものを出力すること。
ro: Această PLACĂ trebuie să îndeplinească o sarcină simplă: să transmită la ieșire ceea ce primește la intrare.
ru: Этот КРИСТАЛЛ должен осуществить простую задачу: передавать на ВЫХОД то, что получает на ВХОД.
zh_hans: 这个晶片需要完成一个简单的任务： 将输入收到的内容输出。

source: To connect the INPUT and the OUTPUT use a METAL block, and then click on any SUBSTRATE block to place it.
de: Um INPUT und OUTPUT zu verbinden, wähle im Baumenü einen METALL-Block und klicke dann auf einen SUBSTRAT-Block, um ihn zu platzieren.
es: Para conectar la ENTRADA y la SALIDA usa un bloque METÁLICO y luego haz clic en cualquier bloque de SUSTRATO para colocarlo.
fr: Pour connecter l'INPUT et l'OUTPUT, utilisez un bloc METAL, puis cliquez sur n'importe quel bloc SUBSTRAT pour le placer.
it: Per connettere l'INPUT e l'OUTPUT usa un blocco di METALLO, e poi premi su qualsiasi blocco del SUBSTRATO per posizionarlo.
ja: INPUT と OUTPUT を接続するには METAL ブロックを使用し、 その後、任意の SUBSTRATE ブロックをクリックして配置してください。
ro: Pentru a conecta INTRAREA și IEȘIREA folosește un bloc METAL, și apoi click pe orice bloc SUBSTRAT pentru a-l plasa.
ru: Чтобы соединить ВХОД и ВЫХОД, используйте блок МЕТАЛЛА, и затем щелкните по любому блоку ПОДЛОЖКИ, чтобы разместить его.
zh_hans: 要连接输入和输出，使用金属块， 然后点击任何基底块来放置。

source: When you have completed your DIE, launch the verification with the 'VALIDATE' button.
de: Wenn dein DIE fertig ist, starte die Prüfung mit dem Button „VALIDIEREN“.
es: Cuando hayas completado tu OBLEA, inicia la verificación con el botón «VALIDAR».
fr: Lorsque vous avez terminé votre DIE, lancez la vérification avec le bouton « VALIDATE ».
it: Quando hai completato il tuo CIRCUITO, fai partire la verifica premendo sul pulsante 'VERIFICA'.
ja: ダイの作成が完了したら、「VALIDATE」ボタンで検証を開始してください。
ro: Când ai terminat PLACA, lansează verificarea cu butonul 'VALIDEAZĂ'.
ru: Когда Вы закончите Ваш КРИСТАЛЛ, запустите проверку, нажав кнопку "ПРОВЕРИТЬ".
zh_hans: 完成晶片后， 使用"验证"按钮启动验证。

source: At any point you can get hints and help from the '?' button.
de: Über den „?“-Button erhältst du jederzeit Hinweise und Hilfe.
es: En cualquier momento puedes obtener pistas y ayuda con el botón «?».
fr: À tout moment, vous pouvez obtenir des indices et de l'aide depuis le bouton « ? ».
it: In qualsiasi momento puoi ottenere indizi e aiuto dal pulsante '?'.
ja: いつでも「?」ボタンからヒントやヘルプを確認できます。
ro: În orice moment poți obține indicii și ajutor de la butonul '?'.
ru: В любой момент вы можете получить подсказки и помощь через кнопку '?'.
zh_hans: 你可以随时从"?" 按钮获取提示和帮助。

source: Connect the INPUT to the OUTPUT, then VALIDATE
de: Verbinde den INPUT mit dem OUTPUT und VALIDIER dann.
es: Conecta la ENTRADA a la SALIDA y luego VALIDA
fr: Connectez l'INPUT à l'OUTPUT, puis VALIDEZ
it: Connetti INPUT e OUTPUT, poi VERIFICA
ja: INPUT を OUTPUT に接続し、その後 VALIDATE してください
ro: Conectează INTRAREA la IEȘIRE, apoi VALIDEAZĂ
ru: Подключите ВХОД к ВЫХОДУ, затем ПРОВЕРЬТЕ.
zh_hans: 将输入连接到输出，然后验证
