Repository: Elorth-HC/hardchip-localization
Catalog: src/Areas/ComponentEditor/Texts/CEditorTexts.*.resx
Languages: de, es, fr, it, ja, ro, ru, zh_hans

source: Shrink 5 blocks from the front
de: 5 Blöcke von vorne verkleinern
es: Reducir 5 bloques desde el frente
fr: Réduire de 5 blocs depuis l'avant
it: Riduci di 5 blocchi dal davanti
ja: 前方から5ブロック縮小する
ro: Micșorează 5 blocuri din față
ru: Уменьшить на 5 блоков спереди
zh_hans: 从前方收缩 5 格

source: Shrink the die to fit the minimum size
de: Chip auf minimale Größe verkleinern
es: Reducir la oblea al tamaño mínimo
fr: Réduire le die à la taille minimale
it: Riduci il circuito per farlo entrare nella dimensione minima
ja: ダイを最小サイズに収まるように縮小する
ro: Micșorează placa la dimensiunea minimă
ru: Уменьшить кристалл до минимального подходящего размера
zh_hans: 将晶片收缩到最小尺寸

source: Extend 5 blocks from the back
de: 5 Blöcke hinten erweitern
es: Extender 5 bloques hacia atrás
fr: Étendre de 5 blocs depuis l'arrière
it: Estendi di 5 blocchi indietro
ja: 背面から5ブロック拡張する
ro: Extinde 5 blocuri din spate
ru: Расширить на 5 блоков сзади
zh_hans: 从后方扩展 5 格

source: Extend 1 block from the back
de: 1 Block hinten erweitern
es: Extender 1 bloque hacia atrás
fr: Étendre de 1 bloc depuis l'arrière
it: Estendi di 1 blocco indietro
ja: 背面から1ブロック拡張する
ro: Extinde 1 bloc din spate
ru: Расширить на 1 блок сзади
zh_hans: 从后方扩展 1 格

source: Extend 5 blocks from the right
de: 5 Blöcke nach rechts erweitern
es: Extender 5 bloques hacia la derecha
fr: Étendre de 5 blocs depuis la droite
it: Estendi di 5 blocchi a destra
ja: 右から5ブロック拡張する
ro: Extinde 5 blocuri din dreapta
ru: Расширить на 5 блоков справа
zh_hans: 从右侧扩展 5 格

source: Extend 5 blocks from the top
de: 5 Blöcke nach oben erweitern
es: Extender 5 bloques hacia arriba
fr: Étendre de 5 blocs depuis le haut
it: Estendi di 5 blocchi in alto
ja: 上から5ブロック拡張する
ro: Extinde 5 blocuri de sus
ru: Расширить на 5 блоков сверху
zh_hans: 从顶部扩展 5 格

source: Extend 1 block from the left
de: 1 Block nach links erweitern
es: Extender 1 bloque desde la izquierda
fr: Étendre de 1 bloc depuis la gauche
it: Estendi di 1 blocco a sinistra
ja: 左から1ブロック拡張する
ro: Extinde 1 bloc din stânga
ru: Расширить на 1 блок слева
zh_hans: 从左侧扩展 1 格

source: Switch to shrink mode
de: In den Verkleinerungsmodus wechseln
es: Cambiar a modo reducir
fr: Passer en mode réduction
ja: 縮小モードに切り替える
ro: Comută la modul micșorare
ru: Переключиться в режим уменьшения
zh_hans: 切换到收缩模式

source: Extend 1 block from the right
de: 1 Block nach rechts erweitern
es: Extender 1 bloque hacia la derecha
fr: Étendre de 1 bloc depuis la droite
it: Estendi di 1 blocco a destra
ja: 右に1ブロック拡張する
ro: Extinde 1 bloc din dreapta
ru: Расширить на 1 блок справа
zh_hans: 从右侧扩展 1 格

source: Extend 1 block from the top
de: 1 Block nach oben erweitern
es: Extender 1 bloque hacia arriba
fr: Étendre de 1 bloc depuis le haut
it: Estendi di 1 blocco in alto
ja: 上から1ブロック拡張する
ro: Extinde 1 bloc de sus
ru: Расширить на 1 блок сверху
zh_hans: 从顶部扩展 1 格

source: Extend 5 blocks from the left
de: 5 Blöcke nach links erweitern
es: Extender 5 bloques desde la izquierda
fr: Étendre de 5 blocs depuis la gauche
it: Estendi di 5 blocchi a sinistra
ja: 左から5ブロック拡張する
ro: Extinde 5 blocuri din stânga
ru: Расширить на 5 блоков слева
zh_hans: 从左侧扩展 5 格

source: Extend 1 block from the front
de: 1 Block nach vorne erweitern
es: Extender 1 bloque hacia el frente
fr: Étendre de 1 bloc depuis l'avant
it: Estendi di 1 blocco avanti
ja: 前方に1ブロック拡張する
ro: Extinde 1 bloc din față
ru: Расширить на 1 блок спереди
zh_hans: 从前方扩展 1 格

source: Extend 5 blocks from the front
de: 5 Blöcke nach vorne erweitern
es: Extender 5 bloques hacia el frente
fr: Étendre de 5 blocs depuis l'avant
it: Estendi di 5 blocchi avanti
ja: 前方に5ブロック拡張する
ro: Extinde 5 blocuri din față
ru: Расширить на 5 блоков спереди
zh_hans: 从前方扩展 5 格

source: Copy (Ctrl+C)
de: Kopieren (Strg+C)
es: Copiar (Ctrl+C)
fr: Copier (Ctrl+C)
it: Copia (Ctrl+C)
ja: コピー（Ctrl+C）
ro: Copiază (Ctrl+C)
ru: Скопировать (Ctrl+C)
zh_hans: 复制 (Ctrl+C)

source: Cut (Ctrl+X)
de: Ausschneiden (Strg+X)
es: Cortar (Ctrl+X)
fr: Couper (Ctrl+X)
it: Taglia (Ctrl+X)
ja: 切り取り（Ctrl+X）
ro: Taie (Ctrl+X)
ru: Вырезать (Ctrl+X)
zh_hans: 剪切 (Ctrl+X)

source: Paste (Ctrl+V)
de: Einfügen (Strg+V)
es: Pegar (Ctrl+V)
fr: Coller (Ctrl+V)
it: Incolla (Ctrl+V)
ja: 貼り付け（Ctrl+V）
ro: Lipește (Ctrl+V)
ru: Вставить (Ctrl+V)
zh_hans: 粘贴 (Ctrl+V)

source: Delete (Del)
de: Löschen (Entf)
es: Eliminar (Del)
fr: Supprimer (Del)
it: Cancella (Del)
ja: 削除（Del）
ro: Șterge (Del)
ru: Удалить (Del)
zh_hans: 删除 (Del)

source: Remove Probes
de: Sonden entfernen
es: Quitar sondas
fr: Retirer les sondes
it: Rimuovi sonde
ja: プローブを削除
ro: Elimină sondele
ru: Убрать точки измерения
zh_hans: 移除探针

source: No name
de: Kein Name
es: Sin nombre
fr: Sans nom
it: Senza nome
ja: 名前なし
ro: Fără nume
ru: Без имени
zh_hans: 无名称

source: Slot selection
de: Slot-Auswahl
es: Selección de ranura
fr: Sélection de slot
it: Selezione slot
ja: スロット選択
ro: Selecție slot
ru: Выбор слота
zh_hans: 槽位选择

source: Undo (Ctrl+Z)
de: Rückgängig (Strg+Z)
es: Deshacer (Ctrl+Z)
fr: Annuler (Ctrl+Z)
ja: 元に戻す（Ctrl+Z）
ro: Anulează (Ctrl+Z)
ru: Отменить (Ctrl+Z)
zh_hans: 撤销 (Ctrl+Z)

source: Redo (Ctrl+Y)
de: Wiederholen (Strg+Y)
es: Rehacer (Ctrl+Y)
fr: Rétablir (Ctrl+Y)
it: Ripeti (Ctrl+Y)
ja: やり直し（Ctrl+Y）
ro: Refă (Ctrl+Y)
ru: Повторить (Ctrl+Y)
zh_hans: 重做 (Ctrl+Y)

source: Restart level
de: Level neu starten
es: Reiniciar nivel
fr: Redémarrer le niveau
it: Ricomicia il livello
ja: レベルを再開する
ro: Restart nivel
ru: Начать уровень заново
zh_hans: 重新开始关卡

source: Modes
de: Modi
es: Modos
it: Modalità
ja: モード
ro: Moduri
ru: Режимы
zh_hans: 模式

source: Probe
de: Sonde
es: Sonda
fr: Sonde
it: Sonda
ja: プローブ
ro: Sondă
ru: Точки измерения
zh_hans: 探针

source: Save as a blueprint
de: Als Blaupause speichern
es: Guardar como plano
fr: Enregistrer comme plan
it: Salva come progetto
ja: ブループリントとして保存
ro: Salvează ca plan
ru: Сохранить как чертёж
zh_hans: 保存为蓝图

source: Creating a new blueprint:
de: Erstelle eine neue Blaupause:
es: Creando un nuevo plano:
fr: Création d'un nouveau plan :
it: Crea un nuovo progetto:
ja: 新しいブループリントを作成中:
ro: Creare plan nou:
ru: Создать новый чертеж:
zh_hans: 创建新蓝图：

source: NewComponent
de: NeueKomponente
es: NuevoComponente
fr: NouvelleComposante
it: Nuovo componente
ja: 新しいコンポーネント
ro: ComponentNou
ru: НовыйКомпонент
zh_hans: 新组件

# CameraPedestalDown
source: Pedestal Down
de: Sockel absenken
es: Pedestal abajo
fr: Relever la caméra
it: Piedistallo verso il basso
ja: ペデスタルを下げる
ro: Coborâre
ru: Опустить камеру
zh_hans: 下降

# CameraPedestalUp
source: Pedestal Up
de: Sockel anheben
es: Pedestal arriba
fr: Abaisser la caméra
it: Piedistallo verso l'alto
ja: 台座を上げる
ro: Ridicare
ru: Поднять камеру
zh_hans: 上升

source: Take Photo
de: Foto aufnehmen
es: Tomar foto
fr: Prendre une photo
ja: 写真を撮る
ro: Fă fotografia
ru: Сделать снимок
zh_hans: 拍照

# HideUIForASplitSecondTakeAScreenshotNputInTheClipboardAndSteamScreenshotFolder
source: Hide UI for a split second, take a screenshot, put in the clipboard and Steam Screenshot Folder.
de: Blende die Benutzeroberfläche für einen kurzen Moment aus, mache einen Screenshot, und lege ihn in die Zwischenablage sowie den Steam-Screenshot-Ordner ab.
es: Ocultar la IU por un instante, tomar una captura, colocarla en el portapapeles y en la carpeta de capturas de Steam.
fr: Masque l'interface un court instant, prend une capture d'écran, et la place dans le presse-papiers ainsi que dans le dossier de captures Steam.
it: Nascondi interfaccia per un istante, cattura un istantanea, la posiziona negli appunti e nella cartella delle istantanee di Steam.
ja: 一瞬だけUIを非表示にしてスクリーンショットを撮り、クリップボードとSteamのスクリーンショットフォルダーに保存します。
ro: Ascunde UI pentru o fracțiune de secundă, fă o captură de ecran, pune în clipboard și în dosarul Steam Screenshot.
ru: Скрыть интерфейс на мгновение, сделать снимок, и сохранить его в буфер обмена и Папку Скриншотов Steam.
zh_hans: 短暂隐藏界面，截取屏幕截图， 放入剪贴板和 Steam 截图文件夹。

# ReportShape
source: Scores shape
de: Form melden
es: Forma de puntuaciones
fr: Format des scores
it: Forma del punteggio
ja: スコアの形式
ro: Forma scorurilor
ru: Форма отчёта
zh_hans: 分数形状

# ReportBackground
source: Scores background
de: Hintergrund melden
es: Fondo de puntuaciones
fr: Fond des scores
it: Sfondo del punteggio
ja: スコアの背景
ro: Fondul scorurilor
ru: Фон отчёта
zh_hans: 分数背景

# ReportText
source: Scores text
de: Text melden
es: Texto de puntuaciones
fr: Texte des scores
it: Testo del punteggio
ja: スコアのテキスト
ro: Textul scorurilor
ru: Текст отчёта
zh_hans: 分数文本

source: Exit photo mode
de: Fotomodus verlassen
es: Salir del modo foto
fr: Quitter le mode photo
it: Esci dalla modalità foto
ja: フォトモードを終了する
ro: Ieși din modul foto
ru: Выйти из фото-режима
zh_hans: 退出拍照模式

source: Clock Frequency
de: Taktfrequenz
es: Frecuencia de reloj
fr: Fréquence d'horloge
it: Frequenza orologio
ja: クロック周波数
ro: Frecvența ceasului
ru: Частота таймера
zh_hans: 时钟频率

# _ShouldBeRightNowIs
source: {0} should be {1} {2} right now is {3}
de: {0} sollte {1} {2} sein, aber aktuell ist es {3}
es: {0} debería ser {1} {2} ahora es {3}
fr: {0} devrait être {1} {2} actuellement {3}
it: {0} dovrebbe essere {1}, {2} ora è {3}
ja: {0} は {1} {2} であるべきですが、現在は {3} です
ro: {0} ar trebui să fie {1} {2} acum este {3}
ru: {0} должно быть {1}, {2} сейчас {3}
zh_hans: {0} 应该是 {1} {2} 当前是 {3}

source: , now=
de: , jetzt=
es: , ahora=
fr: , maintenant=
ja: 、現在=
ro: , acum=
ru: , сейчас:
zh_hans: ，当前=

# SimulationTicksAt
source: Ticks {0} at {1}
de: Ticks {0} bei {1}
es: Ticks {0} en {1}
fr: Ticks {0} à {1}
it: Tick {0} a {1}
ja: ティック {0} ({1})
ro: Tick-uri {0} la {1}
ru: Такт {0} на скорости {1}
zh_hans: 时钟周期 {0} 于 {1}

# SimulationClockAt
source: Clock {0} ({1})
de: Takt {0} ({1})
es: Reloj {0} ({1})
fr: Horloge {0} ({1})
it: Orologio {0} ({1})
ja: クロック {0} ({1})
ro: Ceas {0} ({1})
ru: Таймер {0} ({1})
zh_hans: 时钟 {0} ({1})

source: Blocks should be
de: Blöcke sollten
es: Los bloques deberían ser
fr: Les blocs devraient être
it: I blocchi dovrebbero essere
ja: ブロックは次のようにするべき
ro: Blocurile ar trebui să fie
ru: Блоки должны быть
zh_hans: 方块应该是

source: at position
de: an Position
es: en la posición
fr: à la position
it: alla posizione
ja: 位置にて
ro: la poziția
ru: в позиции
zh_hans: 在位置

source: Pending...
de: Ausstehend...
es: Pendiente...
fr: En attente...
it: In attesa...
ja: 保留中...
ro: În așteptare...
ru: Ожидайте...
zh_hans: 等待中...

source: Validating...
de: Validiere...
es: Validando...
fr: Validation...
ja: 検証中...
ro: Validare...
ru: Проверка...
zh_hans: 验证中...

source: Truth table
de: Wahrheitstabelle
es: Tabla de verdad
fr: Table de vérité
ja: 真理値表
ro: Tabel de adevăr
ru: Таблица истинности
zh_hans: 真值表

source: Input named
de: Eingabe benannt
es: Entrada llamada
fr: Entrée nommée
it: Input rinominato
ja: 名前付き入力
ro: Intrarea numită
ru: Вход
zh_hans: 名为

source: Output to match named
de: Ausgabe soll übereinstimmen mit
es: Salida a coincidir llamada
fr: Sortie à faire correspondre nommée
ja: 指定された名前に一致する出力
ro: Ieșirea de potrivit numită
ru: Требуемые значения для выхода
zh_hans: 要匹配的输出名为

source: Initial power up phase, doesn't count toward tick score.
de: Anfängliche Hochfahrphase, zählt nicht zum Tick-Score.
es: Fase inicial de encendido, no cuenta para la puntuación de ticks.
fr: Phase d'initialisation, ne compte pas dans le score en ticks.
it: Fase di accensione, non viene contata nel punteggio tick.
ja: 初期電源投入フェーズ。ティックスコアにはカウントされません。
ro: Faza inițială de pornire nu se consideră pentru scorul de tick.
ru: Этап включения питания не влияет на оценку тактов.
zh_hans: 初始上电阶段，不计入时钟周期分数。

source: Any
de: Beliebig
es: Cualquiera
fr: Tout
it: Qualsiasi
ja: 任意
ro: Oricare
ru: Любое
zh_hans: 任意

# AnyLowercase
source: any
de: beliebig
es: cualquiera
fr: tout
it: qualsiasi
ja: 任意
ro: oricare
ru: любое
zh_hans: 任意

# ButtonLabelUnresponsive
source: Unresponsive
de: Keine Antwort
es: Sin respuesta
fr: Non réactif
it: Non risponde
ja: 応答なし
ro: Nereactiv
ru: Нет активности
zh_hans: 无响应

# ButtonLabelMissedGoal
source: Missed goal
de: Ziel verfehlt
es: Objetivo fallido
fr: Objectif manqué
it: Obiettivo mancato
ja: 目標未達成
ro: Obiectiv ratat
ru: Задание непонято
zh_hans: 未达目标

# ButtonLabelChecked
source: Checked!
de: Überprüft!
es: ¡Comprobado!
fr: Vérifié !
it: VERIFICATO!
ja: 確認済み！
ro: Verificat!
ru: Проверено!
zh_hans: 已通过！

# ButtonLabelValidating
source: Validating...
de: Validiere...
es: Validando...
fr: Validation...
it: Validazione...
ja: 検証中...
ro: Validare...
ru: Проверка...
zh_hans: 验证中...

# ButtonLabelValidate
source: Validate
de: Validieren
es: Validar
fr: Valider
it: Valida
ja: 検証
ro: Validează
ru: Проверить
zh_hans: 验证

# ButtonLabelStepByStep
source: Manual
de: Schritt für Schritt
fr: Manuel
it: Manuale
ja: 手動
ru: Вручную
zh_hans: 手动

# ButtonLabelModified
source: Modified
de: Geändert
es: Modificado
fr: Modifié
it: Modificato
ja: 変更済み
ro: Modificat
ru: Изменен
zh_hans: 已修改

source: Reset validation
de: Validierung zurücksetzen
es: Reiniciar validación
fr: Réinitialiser la validation
it: Ripristina verifica
ja: 検証をリセット
ro: Resetează validarea
ru: Остановить проверку
zh_hans: 重置验证

# EditModeSummary
source: Edit (Upward:{0}/Delete{1}/Select{2})
de: Bearbeiten (Oben:{0}/Löschen:{1}/Auswählen:{2})
es: Editar (Subir:{0}/Eliminar{1}/Seleccionar{2})
fr: Éditer (Vers le haut:{0}/Suppr:{1}/Sélection:{2})
it: Modifica (In alto:{0}/Cancella:{1}/Seleziona:{2})
ja: 編集（上へ:{0}/削除:{1}/選択:{2}）
ro: Editare (Sus:{0}/Șterge{1}/Selectează{2})
ru: Редактор (вертикально:{0} / удаление:{1} / выделение:{2})
zh_hans: 编辑 (向上:{0}/删除{1}/选择{2})

# DieOperationsModeSummary
source: Extend/Shrink die
de: Chip erweitern/verkleinern
es: Extender/Reducir oblea
fr: Extension/Réduction du die
it: Estendi/riduci il circuito
ja: ダイを拡大/縮小
ro: Extinde/Micșorează placa
ru: Расширить/уменьшить кристалл
zh_hans: 扩展/收缩晶片

# ProbeModeSummary
source: Probes
de: Sonden
es: Sondas
fr: Sondes
it: Sonde
ja: プローブ
ro: Sonde
ru: Точки измерения
zh_hans: 探针

# BluePrintModeSummary
source: Blueprints ({0}/{1}:Flip Blueprint)
de: Blaupausen ({0}/{1}: Blaupause umdrehen)
es: Planos ({0}/{1}:Voltear plano)
fr: Plans ({0}/{1} : retourner le plan)
it: Progetto ({0}/{1}:Capovolgi progetto)
ja: ブループリント ({0}/{1}: ブループリントを反転)
ro: Planuri ({0}/{1}:Întoarce planul)
ru: Чертежы ({0}/{1}: Отобразить Чертеж)
zh_hans: 蓝图 ({0}/{1}:翻转蓝图)

# SelectPinModeSummary
source: Relocate Pins ({0}/{1}:In/Decrease spacing)
de: Pin-Auswahl ({0}/{1}:Abstände vergrößern/verkleinern)
es: Reubicar pines ({0}/{1}:Aum/Dismin espaciado)
fr: Sélection de broche ({0}/{1}:Augmenter/diminuer l'espacement)
it: Riposiziona pin ({0}/{1}:Aumenta/Diminuisci spaziatura)
ja: ピンを再配置（{0}/{1}:間隔を狭める/広げる）
ro: Mută pinii ({0}/{1}:În/Micșorează spațierea)
ru: Перемещение выводов ({0}/{1}:сблизить/разнести выводы)
zh_hans: 重定位引脚 ({0}/{1}:增加/减少间距)

# DebugModeSummary
source: Tools
de: Werkzeuge
es: Herramientas
fr: Outils
it: Strumenti
ja: ツール
ro: Unelte
ru: Инструменты
zh_hans: 工具

# ComparerModeSummary
source: Comparer
de: Vergleicher
es: Comparador
fr: Comparateur
it: Comparatore
ja: 比較ツール
ro: Comparator
ru: Сравнение
zh_hans: 比较器

source: Simulation speed
de: Simulationsgeschwindigkeit
es: Velocidad de simulación
fr: Vitesse de simulation
it: Velocità di simulazione
ja: シミュレーション速度
ro: Viteza simulării
ru: Скорость симуляции
zh_hans: 模拟速度
