Repository: Elorth-HC/hardchip-localization
Catalog: src/Areas/ComponentEditor/Texts/CEditorTexts.*.resx
Languages: de, es, fr, it, ja, ro, ru, zh_hans

source: filter
es: Filtro
fr: filtrer
it: filtro
ja: フィルター
ro: filtru
ru: фильтровать
zh_hans: 筛选

source: Schematics
de: Schaltpläne
es: Esquemas
fr: Schémas
it: Schemi
ja: 回路図
ro: Scheme
ru: Схема
zh_hans: 原理图

source: Open schematic
de: Schaltplan öffnen
es: Abrir esquema
fr: Ouvrir un schéma
it: Apri schema
ja: 回路図を開く
ro: Deschide schema
ru: Открыть схему
zh_hans: 打开原理图

source: Enter new name for this blueprint:
de: Neuen Namen für diese Blaupause eingeben:
es: Introduce un nuevo nombre para este plano:
fr: Entrez un nouveau nom pour ce plan :
it: Inserisci un nuovo nome per questo progetto:
ja: このブループリントの新しい名前を入力してください:
ro: Introduceți un nume nou pentru acest plan:
ru: Введите новое имя для этого чертежа:
zh_hans: 为此蓝图输入新名称：

source: Are you sure you want to delete this blueprint?
de: Möchten Sie diese Blaupause wirklich löschen?
es: ¿Seguro que deseas eliminar este plano?
fr: Êtes-vous sûr de vouloir supprimer ce plan ?
it: Sei sicuro di voler cancellare questo progetto?
ja: このブループリントを削除してもよろしいですか？
ro: Sigur doriți să ștergeți acest plan?
ru: Вы действительно хотите удалить этот чертёж?
zh_hans: 确定要删除此蓝图吗？

source: Rename blueprint:
de: Blaupause umbenennen:
es: Renombrar plano:
fr: Renommer le plan :
it: Rinomina progetto:
ja: ブループリントの名前を変更:
ro: Redenumire plan:
ru: Переименовать чертёж:
zh_hans: 重命名蓝图：

source: Delete blueprint:
de: Blaupause löschen:
es: Eliminar plano:
fr: Supprimer le plan :
it: Cancella progetto:
ja: ブループリントを削除:
ro: Ștergere plan:
ru: Удалить чертёж:
zh_hans: 删除蓝图：

source: Probes
de: Sonden
es: Sondas
fr: Sondes
it: Sonde
ja: プローブ
ro: Sonde
ru: Точки измерения
zh_hans: 探针

source: Pick bits positions one at a time. Right click to cancel.
de: Wähle Bit-Positionen nacheinander aus. Rechtsklick zum Abbrechen.
es: Selecciona posiciones de bits una a la vez. Clic derecho para cancelar.
fr: Sélectionnez les positions des bits une par une. Clic droit pour annuler.
it: Scegli la posizione dei bit uno alla volta. Premi il tasto destro per annullare.
ja: ビット位置を1つずつ選択してください。右クリックでキャンセルします。
ro: Selectați pozițiile biților una câte una. Click dreapta pentru anulare.
ru: Выбирайте позиции бит по одному. Нажмите правой кнопкой мыши, чтобы отменить.
zh_hans: 逐个选择位位置。右键点击取消。

source: Label
de: Bezeichnung
es: Etiqueta
fr: Étiquette
it: Etichetta
ja: ラベル
ro: Etichetă
ru: Название
zh_hans: 标签

source: Add
de: Hinzufügen
es: Añadir
fr: Ajouter
it: Aggiungi
ja: 追加
ro: Adaugă
ru: Добавить
zh_hans: 添加

source: Click to select position
de: Klicken, um Position auszuwählen
es: Haz clic para seleccionar posición
fr: Cliquez pour sélectionner la position
it: Clicca per selezionare la posizione
ja: クリックして位置を選択
ro: Click pentru a selecta poziția
ru: Нажмите, чтобы выбрать позицию
zh_hans: 点击选择位置

source: Click to reset position
de: Klicken, um Position zurückzusetzen
es: Haz clic para restablecer posición
fr: Cliquez pour réinitialiser la position
it: Clicca per resettare la posizione
ja: クリックして位置をリセット
ro: Click pentru a reseta poziția
ru: Нажмите, чтобы сбросить позицию
zh_hans: 点击重置位置

source: Relocate input
de: Eingabe verlegen
es: Reubicar entrada
fr: Déplacer l'entrée
it: Riposiziona input
ja: 入力を移動
ro: Mută intrarea
ru: Переместить вход
zh_hans: 重定位输入

# AndLinkWordForTruthTable
source: and
de: und
es: y
fr: et
it: e
ja: と
ro: și
ru: и
zh_hans: 和

# ButLinkWordForTruthTable
source: but
de: aber
es: pero
fr: mais
it: ma
ja: しかし
ro: dar
ru: но
zh_hans: 但

source: Relocate output
de: Ausgabe verlegen
es: Reubicar salida
fr: Déplacer la sortie
it: Riposiziona output
ja: 出力を移動する
ro: Mută ieșirea
ru: Переместить выход
zh_hans: 重定位输出

source: Stick to screen
de: Am Bildschirm fixieren
es: Fijar a pantalla
fr: Coller à l'écran
ja: 画面に固定する
ro: Fixează pe ecran
ru: Сохранять позицию на экране
zh_hans: 固定到屏幕

source: Neutral allowed
de: Neutral erlaubt
es: Neutro permitido
fr: Neutre autorisé
it: Neutro autorizzato
ja: ニュートラル許可
ro: Neutru permis
ru: Нейтральный разрешён
zh_hans: 允许中性状态

source: Stick to block
de: Am Block fixieren
es: Fijar a bloque
fr: Coller au bloc
ja: ブロックに固定する
ro: Fixează pe bloc
ru: Сохранять позицию относительно блока
zh_hans: 固定到方块

source: Neutral not allowed
de: Neutral nicht erlaubt
es: Neutro no permitido
fr: Neutre non autorisé
it: Neutro non autorizzato
ja: ニュートラル禁止
ro: Neutru interzis
ru: Нейтральный не разрешён
zh_hans: 不允许中性状态

source: Stop at 1
de: Bei 1 anhalten
es: Detener en 1
fr: Arrêter à 1
ja: 1で停止
ro: Oprește la 1
ru: Остановиться, если 1
zh_hans: 在 1 时停止

source: Stop at 0
de: Bei 0 anhalten
es: Detener en 0
fr: Arrêter à 0
ja: 0で停止
ro: Oprește la 0
ru: Остановиться, если 0
zh_hans: 在 0 时停止

source: Stop at _
de: Bei _ anhalten
es: Detener en _
fr: Arrêter à _
ja: _ で停止
ro: Oprește la _
ru: Остановиться, если _
zh_hans: 在 _ 时停止

source: Stop at Error
de: Bei Fehler anhalten
es: Detener en Error
fr: Arrêter en cas d'erreur
ja: エラー時に停止
ro: Oprește la eroare
ru: Остановиться при ошибке
zh_hans: 在错误时停止

source: Don't stop
de: Nicht anhalten
es: No detener
fr: Ne pas s'arrêter
it: Non fermare
ja: 止まらないで
ro: Nu te opri
ru: Не останавливаться
zh_hans: 不停止

source: Blueprint Saved
de: Blaupause gespeichert
es: Plano guardado
fr: Plan enregistré
it: Progetti salvati
ja: ブループリントを保存しました
ro: Plan salvat
ru: Чертёж сохранён
zh_hans: 蓝图已保存

source: Save all as a blueprint
de: Alles als Blaupause speichern
es: Guardar todo como plano
fr: Tout enregistrer en tant que plan
it: Salva tutto come progetto
ja: すべてをブループリントとして保存
ro: Salvează totul ca plan
ru: Сохранить всё как чертёж
zh_hans: 全部保存为蓝图

source: Open Blueprint library
de: Blaupausenbibliothek öffnen
es: Abrir biblioteca de planos
fr: Ouvrir la bibliothèque de plans
it: Apri libreria dei progetti
ja: ブループリントライブラリを開く
ro: Deschide biblioteca de planuri
ru: Открыть библиотеку чертежей
zh_hans: 打开蓝图库

source: Show only bests by block blueprints
de: Nur die besten Blaupausen nach Blockanzahl anzeigen
es: Mostrar solo los mejores por bloques
fr: Afficher uniquement les meilleurs plans par blocs
it: Mostra solo i progetti migliori per blocchi
ja: ブロックブループリントごとに最良のもののみを表示する
ro: Arată doar cele mai bune planuri după bloc
ru: Показывать только лучшие по блокам чертежи
zh_hans: 仅显示按方块数最优的蓝图

source: Show only bests by volume blueprints
de: Nur die besten Blaupausen nach Volumen anzeigen
es: Mostrar solo los mejores por volumen
fr: Afficher uniquement les meilleurs plans par volume
it: Mostra solo i progetti migliori per volume
ja: 出来高別に最良のブループリントのみを表示
ro: Arată doar cele mai bune planuri după volum
ru: Показывать только лучшие по объёму чертежи
zh_hans: 仅显示按体积最优的蓝图

source: Show only bests by tick blueprints
de: Nur die besten Blaupausen nach Ticks anzeigen
es: Mostrar solo los mejores por ticks
fr: Afficher uniquement les meilleurs plans par tick
it: Mostra solo i progetti migliori per tick
ja: ティックごとの最良のブループリントのみを表示
ro: Arată doar cele mai bune planuri după tick
ru: Показывать только лучшие по тактам чертежи
zh_hans: 仅显示按时钟周期最优的蓝图

source: Show only bests by MOS blueprints
de: Nur die besten Blaupausen nach MOS anzeigen
es: Mostrar solo los mejores por MOS
fr: Afficher uniquement les meilleurs plans par MOS
it: Mostra solo i progetti migliori per MOS
ja: MOSブループリントのうち最良のもののみを表示する
ro: Arată doar cele mai bune planuri după MOS
ru: Показывать только лучшие по количеству МОП чертежи
zh_hans: 仅显示按 MOS 数最优的蓝图

source: Save selection as blueprint
de: Auswahl als Blaupause speichern
es: Guardar selección como plano
fr: Enregistrer la sélection en tant que plan
it: Salva selezione come progetto
ja: 選択範囲をブループリントとして保存
ro: Salvează selecția ca plan
ru: Сохранить выделение как чертёж
zh_hans: 将选择保存为蓝图

source: Blocks
de: Blöcke
es: Bloques
fr: Blocs
it: Blocchi
ja: ブロック
ro: Blocuri
ru: Блоки
zh_hans: 方块

source: Comparer
de: Vergleicher
es: Comparador
fr: Comparateur
it: Comparatore
ja: 比較ツール
ro: Comparator
ru: Сравнение
zh_hans: 比较器

source: Reuse best solution
de: Beste Lösung wiederverwenden
es: Reutilizar mejor solución
fr: Réutiliser la meilleure solution
it: Riusa la soluzione migliore
ja: 最適な解決策を再利用する
ro: Refolosește cea mai bună soluție
ru: Использовать лучшее решение
zh_hans: 复用最佳方案

source: Now - - - - - - - - - - - Best
de: Aktuell - - - - - - - - - - - Beste
es: Ahora - - - - - - - - - - - Mejor
fr: Maintenant - - - - - - - - - - - Meilleur
it: Ora - - - - - - - - - - - Migliore
ja: 現在 - - - - - - - - - - - 最高
ro: Acum - - - - - - - - - - - Cel mai bun
ru: Текущий - - - - - - - - - - - Лучший
zh_hans: 当前 - - - - - - - - - - - 最佳

source: Toolbox
de: Werkzeugkasten
es: Caja de herramientas
fr: Boîte à outils
ja: ツールボックス
ro: Casetă de unelte
ru: Инструменты
zh_hans: 工具箱

source: Photo Mode
de: Fotomodus
es: Modo foto
fr: Mode Photo
it: Modalità foto
ja: フォトモード
ro: Mod foto
ru: Фото-режим
zh_hans: 拍照模式

source: Auto shrink on validate
de: Automatisches Verkleinern bei Validierung
es: Reducción automática al validar
fr: Réduire automatiquement lors de la validation
it: Riduzione automatica alla validazione
ja: 検証時に自動縮小
ro: Micșorare automată la validare
ru: Авто-уменьшение при проверке
zh_hans: 验证时自动收缩

source: Turn on/off the auto shrink of the die when validating the level. The die will be shrinked to the smallest size possible to fit the blocks.
de: Schaltet das automatische Verkleinern des Chips beim Validieren des Levels ein oder aus. Der Chip wird auf die kleinstmögliche Größe verkleinert, um die Blöcke aufzunehmen.
es: Activar/desactivar la reducción automática de la oblea al validar el nivel. La oblea se reducirá al tamaño mínimo posible para encajar los bloques.
fr: Active/désactive la réduction automatique du die lors de la validation. Le die sera réduit à la taille minimale permettant d'inclure tous les blocs.
ja: レベルの検証時にダイの自動縮小をオン/オフします。 ダイはブロックが収まる最小サイズまで縮小されます。
ro: Activează/dezactivează micșorarea automată a plăcii la validarea nivelului. Placa va fi micșorată la cea mai mică dimensiune posibilă pentru a încăpea blocurile.
ru: Включить/Выключить автоматическое уменьшение кристалла при проверке уровня. Кристалл будет уменьшен до минимально возможного размера, при котором умещаются все блоки.
zh_hans: 开启/关闭验证关卡时晶片的自动收缩。 晶片将被收缩到能容纳所有方块的 最小尺寸。

source: Edit die size
de: Chipgröße bearbeiten
es: Editar tamaño de la oblea
fr: Modifier la taille du die
it: Modifica la dimensione del circuito
ja: ダイサイズを編集
ro: Editează dimensiunea plăcii
ru: Редактировать размер кристалла
zh_hans: 编辑晶片尺寸

# EditManuallyTheDieSizeShrinkingTheDieWillRemoveNtheBlocksOutsideTheNewDieSize
source: Edit manually the die size. Shrinking the die will remove the blocks outside the new die size.
de: Bearbeite die Chipgröße manuell. Das Verkleinern des Chips entfernt alle Blöcke außerhalb der neuen Chipgröße.
es: Editar manualmente el tamaño de la oblea. Reducir la oblea eliminará los bloques fuera del nuevo tamaño.
fr: Modifiez manuellement la taille du die. Réduire le die supprimera les blocs hors de la nouvelle dimension du die.
it: Modifica la dimensione del circuito manualmente. Riducendo il circuito rimuoverà i blocchi al di fuori della nuova dimensione del circuito.
ja: ダイのサイズを手動で編集します。ダイを縮小すると、 新しいダイサイズの外側にあるブロックが削除されます。
ro: Editează manual dimensiunea plăcii. Micșorarea plăcii va elimina blocurile din afara noii dimensiuni a plăcii.
ru: Вручную редактировать размер кристалла. Уменьшая кристалл, блоки, находящиеся вне новых границ кристалла, пропадут.
zh_hans: 手动编辑晶片尺寸。收缩晶片将移除 新晶片尺寸之外的方块。

source: Export a level file to clipboard. Pastable in File Explorer, Discord, and every programs supporting pasted file.
de: Exportiere eine Leveldatei in die Zwischenablage. Kann in den Datei-Explorer, Discord und alle Programme, die eingefügte Dateien unterstützen, eingefügt werden.
es: Exportar un archivo de nivel al portapapeles. Pegable en el Explorador, Discord y cualquier programa compatible con archivos pegados.
fr: Exporte un fichier de niveau dans le presse-papiers. Collable dans l'Explorateur Windows, Discord et tout programme qui supporte le collage de fichiers.
it: Esporta il file di un livello negli appunti. Incollalo su File Explorer, Discord, e ogni programma che supporti l'incollaggio di file.
ja: レベルファイルをクリップボードにエクスポートします。 ファイルエクスプローラー、Discord、およびファイルの貼り付けに 対応したすべてのプログラムに貼り付けできます。
ro: Exportă un fișier de nivel în clipboard. Poate fi lipit în File Explorer, Discord și orice program care suportă fișiere lipite.
ru: Экспортировать уровень в буфер обмена. Можно вставить в Проводник, Discord, и любые другие программы, поддерживающие вставку файлов.
zh_hans: 将关卡文件导出到剪贴板。可粘贴到文件资源管理器、 Discord 和所有支持粘贴文件的程序中。

source: Export to clipboard
de: In Zwischenablage exportieren
es: Exportar al portapapeles
fr: Exporter vers le presse-papiers
it: Esporta negli appunti
ja: クリップボードにエクスポート
ro: Exportă în clipboard
ru: Экспортировать в буфер обмена
zh_hans: 导出到剪贴板

source: Import from clipboard
de: Aus Zwischenablage importieren
es: Importar desde portapapeles
fr: Importer depuis le presse-papiers
it: Importa dagli appunti
ja: クリップボードからインポート
ro: Importă din clipboard
ru: Импортировать из буфера обмена
zh_hans: 从剪贴板导入

source: Try to read a level from the clipboard. Supports .wt, .ct, .wtb and .ctb files. Supports direct files and URL of files.
de: Versuche, ein Level aus der Zwischenablage zu lesen. Unterstützt .wt, .ct, .wtb und .ctb-Dateien. Unterstützt Direktdateien und Datei-URLs.
es: Intentar leer un nivel desde el portapapeles. Compatible con archivos .wt, .ct, .wtb y .ctb, así como con archivos directos y URL de archivos.
fr: Tente de lire un niveau depuis le presse-papiers. Compatible avec les fichiers .wt, .ct, .wtb et .ctb. Gère les fichiers directs et les URLs pointant vers des fichiers.
ja: クリップボードからレベルを読み取ろうとします。 .wt、.ct、.wtb、.ctb ファイルに対応しています。 直接ファイルおよびファイルの URL に対応しています。
ro: Încearcă să citească un nivel din clipboard. Suportă fișiere .wt, .ct, .wtb și .ctb. Suportă fișiere directe și URL-uri ale fișierelor.
ru: Попытаться загрузить уровень из буфера обмена. Поддерживает форматы файлов .wt, .ct, .wtb и .ctb. Поддерживает файлы, а также интернет-ссылки на файлы.
zh_hans: 尝试从剪贴板读取关卡。支持 .wt、.ct、 .wtb 和 .ctb 文件。支持直接文件和文件 URL。

source: Show change indicators
de: Änderungsindikatoren anzeigen
es: Mostrar indicadores de cambios
fr: Montrer les indicateurs de changement
it: Mostra gli indicatori di cambiamento
ja: 変更インジケーターを表示
ro: Arată indicatorii de schimbare
ru: Показать индикаторы изменений
zh_hans: 显示更改指示器

source: Show indicators on the blocks that have been changed since the last simulation update. Indicators are removed when after a few seconds or when the simulation is stepped.
de: Zeige Indikatoren auf den Blöcken, die seit dem letzten Simulationsupdate geändert wurden. Die Indikatoren werden nach einigen Sekunden oder beim Schritt in der Simulation entfernt.
es: Mostrar indicadores en los bloques que hayan cambiado desde la última actualización de la simulación. Los indicadores se eliminan tras unos segundos o al avanzar la simulación.
fr: Affiche des indicateurs sur les blocs qui ont été modifiés depuis la dernière mise à jour de la simulation. Les indicateurs disparaissent au bout de quelques secondes ou lors d'un pas de simulation.
it: Mostra indicatori sui blocchi che sono cambiati dall'ultimo aggiornamento della simulazione. Gli indicatori sono rimossi dopo qualche secondo o quando la simulazione è fatta avanzare.
ja: 最後のシミュレーション更新以降に変更されたブロックにインジケーターを表示します。 インジケーターは数秒後、またはシミュレーションをステップ実行したときに消えます。
ro: Arată indicatori pe blocurile care au fost modificate de la ultima actualizare a simulării. Indicatorii sunt eliminați după câteva secunde sau când simularea este avansată.
ru: Показывать индикаторы на блоках, которые изменились после предыдущего шага симулятора. Индикаторы исчезают через несколько секунд или когда симуляция продолжается.
zh_hans: 显示自上次模拟更新以来已更改的方块上的指示器。 指示器会在几秒后或模拟步进时移除。

# TracesGroupsColors
source: Colored segments
de: Farben der Leitungsgruppen
es: Segmentos coloreados
fr: Colorer les segments
ja: 色付きセグメント
ro: Segmente colorate
ru: Цветные сегменты
zh_hans: 彩色分段

source: Color all interconnected metal traces with the same color and partially hide metal traces always connected to 0/1 constant blocks.
de: Färbt alle verbundenen Leitungen in derselben Farbe und blendet Leitungen aus, die immer mit 0/1-Block verbunden sind.
es: Colorea todas las pistas metálicas interconectadas con el mismo color y oculta parcialmente las pistas siempre conectadas a bloques constantes 0/1.
fr: Colorie toutes les traces interconnectées avec la même couleur et masque partiellement les traces toujours connectées aux blocs 0/1 constants.
it: Colora tutte le tracce di metallo interconnesse con lo stesso colore e nascondi parzialmente le tracce di metallo connesse ad un blocco costante 0/1.
ja: 相互接続されたすべての金属配線を同じ色で着色し、 常に 0/1 定数ブロックに接続されている金属配線を部分的に非表示にします。
ro: Colorează toate urmele metalice interconectate cu aceeași culoare și ascunde parțial urmele metalice conectate mereu la blocurile constante 0/1.
ru: Окрасить все соединённые друг с другом дорожки одинаковым цветом, и частично скрыть дорожки, которые всегда подключены к блокам 0/1.
zh_hans: 用相同颜色标记所有互连的金属走线，并部分 隐藏始终连接到 0/1 常量块的金属走线。

source: Auto Clock Stop
de: Automatischer Taktstopp
es: Parada automática del reloj
fr: Arrêt automatique de l'horloge
it: Blocco automatico dell'orologio
ja: 自動クロック停止
ro: Oprire automată ceas
ru: Авто-остановка по таймеру
zh_hans: 自动时钟停止

# RemoveNextClockSwitchStopStopSimulationWhenClockSwitchesItsSignal
source: Stop simulation when clock switches its signal.
de: Beendet die Simulation, wenn der Takt sein Signal wechselt.
es: Detener la simulación cuando el reloj cambie su señal.
fr: Arrête la simulation lorsque l'horloge bascule son signal.
it: Ferma la simulazione quando l'orologio cambia il suo segnale.
ja: クロックが信号を切り替えたときにシミュレーションを停止します。
ro: Oprește simularea când ceasul își schimbă semnalul.
ru: Остановить симуляцию, когда таймер меняет своё значение.
zh_hans: 当时钟信号切换时停止模拟。

# CameraDramaticCameraMoves
source: Dramatic camera moves
de: Dramatische Kamerabewegungen
es: Movimientos de cámara dramáticos
fr: Mouvements de caméra spectaculaires
it: Movimenti fotocamera dinamici
ja: ドラマチックなカメラワーク
ro: Mișcări dramatice de cameră
ru: Драматическое движение камеры
zh_hans: 戏剧性镜头移动

# CameraRotateLeft
source: Rotate Left
de: Nach links drehen
es: Rotar izquierda
fr: Pivoter à gauche
it: Ruota a sinistra
ja: 左に回転
ro: Rotește stânga
ru: Повернуть влево
zh_hans: 向左旋转

# CameraForward
source: Forward
de: Vorwärts
es: Avanzar
fr: Avancer
it: Avanti
ja: 進む
ro: Înainte
ru: Вперёд
zh_hans: 向前

# CameraRotateRightE
source: Rotate Right
de: Nach rechts drehen
es: Rotar derecha
fr: Pivoter à droite
it: Ruota a destra
ja: 右に回転
ro: Rotește dreapta
ru: Повернуть вправо
zh_hans: 向右旋转

# CameraCycleUIElements
source: Hide UI ({0})
de: UI ausblenden ({0})
es: Ocultar IU ({0})
fr: Cacher UI ({0})
it: Nascondi interfaccia ({0})
ja: UI を非表示 ({0})
ro: Ascunde UI ({0})
ru: Скрыть интерфейс ({0})
zh_hans: 隐藏界面 ({0})

# CameraStrafeLeft
source: Strafe Left
de: Nach links strafen
es: Desplazarse izquierda
fr: Déplacement latéral à gauche
it: Muovi a sinistra
ja: 左にストレイフ
ro: Deplasare stânga
ru: Смещение влево
zh_hans: 向左平移

source: Editor Cam/Free Cam (SHIFT/CTRL/WASD/LEFT CLICK)
de: Editor-Kamera/Freie Kamera (SHIFT/STRG/WASD/Linksklick)
es: Cámara editor/Cámara libre (SHIFT/CTRL/WASD/CLIC IZQ.)
fr: Cam. Éditeur/Cam. Libre (SHIFT/CTRL/ZQSD/CLIC GAUCHE)
it: Editor fotocamera/fotocamera libera (SHIFT/CTRL/WASD/CLICL TASTO SINISTRO)
ja: エディターカメラ/フリーカメラ（SPACE/CTRL/WASD/左クリック）
ro: Cameră editor/Cameră liberă (SHIFT/CTRL/WASD/CLICK STÂNGA)
ru: Камера редактора/Свободная камера (SHIFT/CTRL/WASD/ЛКМ)
zh_hans: 编辑器相机/自由相机 (SPACE/CTRL/WASD/左键点击)

source: Editor Cam/Free Cam
de: Editor-Kamera/Freie Kamera
es: Cámara editor/Cámara libre
fr: Caméra Éditeur/Caméra Libre
it: Editor fotocamera/fotocamera libera
ja: エディターカメラ/フリーカメラ
ro: Cameră editor/Cameră liberă
ru: Камера редактора/Свободная камера
zh_hans: 编辑器相机/自由相机

# CameraStrafeRight
source: Strafe Right
de: Nach rechts strafen
es: Desplazarse derecha
fr: Déplacement latéral à droite
it: Muovi a destra
ja: 右にストレイフ
ro: Deplasare dreapta
ru: Смещение вправо
zh_hans: 向右平移

source: Center camera
de: Kamera zentrieren
es: Centrar cámara
fr: Centrer la caméra
it: Centra fotocamera
ja: カメラを中央に配置
ro: Centrează camera
ru: Отцентровать камеру
zh_hans: 居中相机

# CameraZoomIn
source: Zoom In
de: Heranzoomen
es: Acercar
fr: Zoom avant
it: Ingrandisci
ja: ズームイン
ro: Apropie
ru: Приблизить
zh_hans: 放大

# CameraBackward
source: Backward
de: Rückwärts
es: Retroceder
fr: Reculer
it: Indietro
ja: 戻る
ro: Înapoi
ru: Назад
zh_hans: 向后

# CameraZoomOut
source: Zoom Out
de: Rauszoomen
es: Alejar
fr: Zoom arrière
it: Riduci
ja: ズームアウト
ro: Depărtează
ru: Отдалить
zh_hans: 缩小

source: Die Operations
de: Chip-Operationen
es: Operaciones de oblea
fr: Opérations sur le die
it: Operazioni sul circuito
ja: ダイ操作
ro: Operațiuni placă
ru: Редактирование кристалла
zh_hans: 晶片操作

source: Shrink 5 blocks from the back
de: 5 Blöcke von hinten verkleinern
es: Reducir 5 bloques desde atrás
fr: Réduire de 5 blocs depuis l'arrière
it: Riduci di 5 blocchi dal dietro
ja: 後ろから5ブロック縮小する
ro: Micșorează 5 blocuri din spate
ru: Уменьшить на 5 блоков сзади
zh_hans: 从后方收缩 5 格

source: Shrink 1 block from the back
de: 1 Block von hinten verkleinern
es: Reducir 1 bloque desde atrás
fr: Réduire de 1 bloc depuis l'arrière
it: Riduci di un blocco dal dietro
ja: 後ろから1ブロック縮小する
ro: Micșorează 1 bloc din spate
ru: Уменьшить на 1 блок сзади
zh_hans: 从后方收缩 1 格

source: Shrink 5 blocks from the right
de: 5 Blöcke von rechts verkleinern
es: Reducir 5 bloques desde la derecha
fr: Réduire de 5 blocs depuis la droite
it: Riduci di 5 blocchi da destra
ja: 右側から5ブロック縮小する
ro: Micșorează 5 blocuri din dreapta
ru: Уменьшить на 5 блоков справа
zh_hans: 从右侧收缩 5 格

source: Shrink 5 blocks from the top
de: 5 Blöcke von oben verkleinern
es: Reducir 5 bloques desde arriba
fr: Réduire de 5 blocs depuis le haut
it: Riduci di 5 blocchi dall'alto
ja: 上から5ブロック縮小する
ro: Micșorează 5 blocuri de sus
ru: Уменьшить на 5 блоков сверху
zh_hans: 从顶部收缩 5 格

source: Shrink 1 block from the left
de: 1 Block von links verkleinern
es: Reducir 1 bloque desde la izquierda
fr: Réduire de 1 bloc depuis la gauche
it: Riduci di un blocco da sinistra
ja: 左から1ブロック縮小
ro: Micșorează 1 bloc din stânga
ru: Уменьшить на 1 блок слева
zh_hans: 从左侧收缩 1 格

source: Switch to extend mode
de: In den Erweiterungsmodus wechseln
es: Cambiar a modo extender
fr: Passer en mode extension
ja: 拡張モードに切り替える
ro: Comută la modul extindere
ru: Перейти в режим расширения
zh_hans: 切换到扩展模式

source: Shrink 1 block from the right
de: 1 Block von rechts verkleinern
es: Reducir 1 bloque desde la derecha
fr: Réduire de 1 bloc depuis la droite
it: Riduci di un blocco da destra
ja: 右側から1ブロック縮小
ro: Micșorează 1 bloc din dreapta
ru: Уменьшить на 1 блок справа
zh_hans: 从右侧收缩 1 格

source: Shrink 1 block from the top
de: 1 Block von oben verkleinern
es: Reducir 1 bloque desde arriba
fr: Réduire de 1 bloc depuis le haut
it: Riduci di un blocco dall'alto
ja: 上から1ブロック縮小
ro: Micșorează 1 bloc de sus
ru: Уменьшить на 1 блок сверху
zh_hans: 从顶部收缩 1 格

source: Shrink 5 blocks from the left
de: 5 Blöcke von links verkleinern
es: Reducir 5 bloques desde la izquierda
fr: Réduire de 5 blocs depuis la gauche
it: Riduci di 5 blocchi da sinistra
ja: 左から5ブロック縮小する
ro: Micșorează 5 blocuri din stânga
ru: Уменьшить на 5 блоков слева
zh_hans: 从左侧收缩 5 格

source: Shrink 1 block from the front
de: 1 Block von vorne verkleinern
es: Reducir 1 bloque desde el frente
fr: Réduire de 1 bloc depuis l'avant
it: Riduci di un blocco dal davanti
ja: 先頭から1ブロック縮小
ro: Micșorează 1 bloc din față
ru: Уменьшить на 1 блок спереди
zh_hans: 从前方收缩 1 格
