Repository: Elorth-HC/hardchip-localization
Catalog: src/Areas/MainMenu/Texts/MainMenuTexts.*.resx
Languages: de, es, fr, it, ja, ro, ru, zh_hans

source: Bonus Stages
de: Bonus-Level
es: Fases extra
fr: Stages Bonus
it: Fasi aggiuntive
ja: ボーナスステージ
ro: Etape bonus
ru: Дополнительные уровни
zh_hans: 额外关卡

source: Finish the Byte Adder Chip to unlock.
de: Schließe den Byte-Adder-Chip ab, um ihn freizuschalten.
es: Termina el chip Sumador de Byte para desbloquear.
fr: Terminez la puce de l'additionneur d'octet pour la déverrouiller.
it: Finisci il chip SOMMATORE 8BIT per sbloccare.
ja: アンロックするには、バイト加算器チップを完成させてください。
ro: Finalizează chip-ul de adunare byte pentru a debloca.
ru: Завершите сумматор, чтобы разблокировать.
zh_hans: 完成字节加法器芯片以解锁。

source: Coming soon.
de: Bald verfügbar.
es: Próximamente.
fr: À venir.
it: In arrivo a breve.
ja: 近日公開。
ro: În curând.
ru: Скоро появится.
zh_hans: 即将推出。

source: Reach the ALU chip map to unlock.
de: Erreiche die ALU-Chip-Karte, um sie freizuschalten.
es: Llega al mapa del chip ALU para desbloquear.
fr: Atteignez la carte de la puce ALU pour la déverrouiller.
it: Raggiungi la mappa del chip ALU per sbloccare.
ja: 解除するにはALUチップマップに到達してください。
ro: Ajunge la harta chip-ului ALU pentru a debloca.
ru: Дойдите до уровня АЛУ, чтобы разблокировать.
zh_hans: 到达 ALU 芯片地图以解锁。

source: Finish the Inverter chip map to unlock.
de: Schließe die Inverter-Chip-Karte ab, um sie freizuschalten.
es: Termina el mapa del chip Inversor para desbloquear.
fr: Terminez la carte de la puce Inverseur pour la déverrouiller.
it: Finisci il chip INVERTITORE per sbloccare.
ja: 解除するには、インバーターチップマップを完了してください。
ro: Finalizează harta chip-ului inversor pentru a debloca.
ru: Завершите инвертор, чтобы разблокировать.
zh_hans: 完成反相器芯片地图以解锁。

source: Links: bugs, comments or feedback?
de: Links: Bugs, Kommentare oder Feedback?
es: Enlaces: ¿errores, comentarios o sugerencias?
fr: Liens: bugs, commentaires ou retours ?
it: Link: bug, commenti o opinioni?
ja: リンク：バグ、コメント、またはフィードバック？
ro: Link-uri: erori, comentarii sau feedback?
ru: Ссылки: баги, комментарии или обратная связь?
zh_hans: 链接：报告漏洞、评论或反馈？

source: Comments/Suggestions/BugReport on Hard Chip's discord!
de: Kommentare/Vorschläge/Bug-Report auf dem Hard-Chip-Discord!
es: ¡Comentarios/Sugerencias/Informe de errores en el Discord de Hard Chip!
fr: Commentaires/Suggestions/Rapport de bug sur le Discord d'Hard Chip !
it: Commenti/Consigli/Segnalazione di bug sul canale Discord di Hard Chip!
ja: Hard ChipのDiscordでコメント／提案／バグ報告を！
ro: Comentarii/Sugestii/Rapoarte de erori pe Discord-ul Hard Chip!
ru: Комментарии/Предложения/Сообщить об ошибках - на Discord сервере Hard Chip!
zh_hans: 在 Hard Chip 的 Discord 上发表评论/建议/漏洞报告！

source: Share your creation on Twitter with #hardchipgame or @hardchipgame!
de: Teile deine Kreation auf Twitter mit #hardchipgame oder @hardchipgame!
es: ¡Comparte tu creación en Twitter con #hardchipgame o @hardchipgame!
fr: Partagez votre création sur Twitter avec #hardchipgame ou @hardchipgame !
it: Condividi la tua creazione su Twitter con #hardchipgame o @hardchipgame!
ja: #hardchipgame または @hardchipgame を付けて、あなたの作品をTwitterで共有しよう！
ro: Împărtășește creația ta pe Twitter cu #hardchipgame sau @hardchipgame!
ru: Поделитесь Вашими проектами в Twitter используя #hardchipgame или @hardchipgame !
zh_hans: 在 Twitter 上使用 #hardchipgame 或 @hardchipgame 分享你的作品！

source: Post your creation on Hard Chip's subreddit!
de: Poste deine Kreation im Hard-Chip-Subreddit!
es: ¡Publica tu creación en el subreddit de Hard Chip!
fr: Postez votre création sur le subreddit d'Hard Chip !
it: Pubblica la tua creazione sul subreddit di Hard Chip!
ja: Hard Chipのsubredditにあなたの作品を投稿しよう！
ro: Postează creația ta pe subreddit-ul Hard Chip!
ru: Размещайте Ваши проекты в сабреддите Hard Chip!
zh_hans: 在 Hard Chip 的 subreddit 上发布你的作品！

source: Join Hard Chip's Steam community!
de: Tritt der Hard-Chip-Steam-Community bei!
es: ¡Únete a la comunidad de Hard Chip en Steam!
fr: Rejoignez la communauté Steam d'Hard Chip !
it: Unisciti alla community Steam di Hard Chip!
ja: Hard ChipのSteamコミュニティに参加しよう！
ro: Alătură-te comunității Steam Hard Chip!
ru: Присоединяйтесь к сообществу Hard Chip в Steam!
zh_hans: 加入 Hard Chip 的 Steam 社区！

source: Music: MEGAS
de: Musik: MEGAS
es: Música: MEGAS
fr: Musique : MEGAS
it: Musica: MEGAS
ja: 音楽：MEGAS
ro: Muzică: MEGAS
ru: Музыка: MEGAS
zh_hans: 音乐：MEGAS

source: Quick updates
de: Kurz-Updates
es: Actualizaciones rápidas
fr: Mises à jour rapides
it: Aggiornamenti rapidi
ja: クイックアップデート
ro: Actualizări rapide
ru: Краткие новости
zh_hans: 快速更新

source: All patch notes
de: Alle Patch-Notes
es: Todas las notas de parche
fr: Toutes les notes de mise à jour
it: Tutte le note di aggiornamento
ja: すべてのパッチノート
ro: Toate notele de actualizare
ru: Все новости об игре
zh_hans: 所有更新日志

source: All the updates on Steam!
de: Alle Updates auf Steam!
es: ¡Todas las actualizaciones en Steam!
fr: Toutes les mises à jour sur Steam !
it: Tutti gli aggiornamenti su Steam!
ja: Steamのすべてのアップデート！
ro: Toate actualizările pe Steam!
ru: Все новости об игре в Steam!
zh_hans: Steam 上的所有更新！

source: Wishlist Hard Chip on Steam!
de: Setz Hard Chip auf deine Steam-Wunschliste!
es: ¡Añade Hard Chip a tu lista de deseados en Steam!
fr: Wishlistez Hard Chip sur Steam!
it: Aggiungi Hard Chip alla lista dei desideri su Steam!
ja: SteamでHard Chipをウィッシュリストに追加しよう！
ro: Adaugă Hard Chip la lista de dorințe pe Steam!
ru: Добавьте Hard Chip в список желаемого в Steam!
zh_hans: 在 Steam 上将 Hard Chip 加入愿望单！

source: Unavailable in the demo.
de: In der Demo nicht verfügbar.
es: No disponible en la demo.
fr: Indisponible dans la démo.
it: Non disponibile nella demo.
ja: デモでは利用できません。
ro: Indisponibil în demo.
ru: Недоступно в демо-версии.
zh_hans: 演示版中不可用。
