Repository: Elorth-HC/hardchip-localization
Catalog: src/Areas/Settings/Texts/ControlBindingTexts.*.resx
Languages: de, fr, it, ja, ru, zh_hans

source: Interact
de: Interagieren
fr: Interagir
it: Interagisci
ja: 操作する
ru: Взаимодействовать
zh_hans: 交互

source: Misc
de: Verschiedenes
fr: Divers
it: Altro
ja: その他
ru: Другое
zh_hans: 杂项

source: Switch Modes
de: Modi wechseln
fr: Basculer entre les modes
it: Cambia modalità
ja: モードを切り替える
ru: Переключить режим
zh_hans: 切换模式

source: Hide UI
de: UI ausblenden
fr: Masquer
it: Nascondi interfaccia
ja: UIを非表示にする
ru: Скрыть интерфейс
zh_hans: 隐藏界面

source: Editor
fr: Éditeur
ja: エディター
ru: Редактор
zh_hans: 编辑器

source: Select Mode
de: Auswahlmodus
fr: Sélectionner le mode
it: Modalità di modifica
ja: モードを選択
ru: Выбрать режим
zh_hans: 选择模式

source: Delete Block
de: Block löschen
fr: Supprimer le bloc
it: Cancella blocchi
ja: ブロックを削除
ru: Удалить блок
zh_hans: 删除方块

source: Flip Part X Axis
de: Teil an X-Achse spiegeln
fr: Inverser la pièce sur l'axe X
it: Inverti parte sull'asse X
ja: 部品をX軸で反転
ru: Отобразить по оси X
zh_hans: 沿 X 轴翻转部件

source: Flip Part Z Axis
de: Teil an Z-Achse spiegeln
fr: Inverser la pièce sur l'axe Z
it: Inverti parte sull'asse Z
ja: 部品をZ軸で反転
ru: Отобразить по оси Z
zh_hans: 沿 Z 轴翻转部件

source: Rotate Part
de: Teil drehen
fr: Pivoter la pièce
it: Ruota la parte
ja: 部品を回転する
ru: Повернуть деталь
zh_hans: 旋转部件

source: Undo
de: Rückgängig
fr: Annuler
it: Annulla
ja: 元に戻す
ru: Отменить
zh_hans: 撤销

source: Redo
de: Wiederholen
fr: Rétablir
it: Ripeti
ja: やり直す
ru: Повторить
zh_hans: 重做

source: Select All
de: Alles auswählen
fr: Tout sélectionner
it: Seleziona tutto
ja: すべて選択
ru: Выделить всё
zh_hans: 全选

source: Copy
de: Kopieren
fr: Copier
it: Copia
ja: コピー
ru: Копировать
zh_hans: 复制

source: Cut
de: Ausschneiden
fr: Couper
it: Taglia
ja: 切り取り
ru: Вырезать
zh_hans: 剪切

source: Paste
de: Einfügen
fr: Coller
it: Incolla
ja: 貼り付け
ru: Вставить
zh_hans: 粘贴

source: Select Segment
de: Segment auswählen
fr: Sélectionner le segment
it: Seleziona segmento
ja: セグメントを選択
ru: Выделить сегмент
zh_hans: 选择段

source: Next Slot
de: Nächster Slot
fr: Emplacement suivant
it: Slot successivo
ja: 次のスロット
ru: Следующий слот
zh_hans: 下一个槽位

source: Previous Slot
de: Vorheriger Slot
fr: Emplacement précédent
it: Slot precedente
ja: 前のスロット
ru: Предыдущий слот
zh_hans: 上一个槽位

source: Slot 0
fr: Emplacement 0
ja: スロット 0
ru: Слот 0
zh_hans: 槽位 0

source: Slot 1
fr: Emplacement 1
ja: スロット 1
ru: Слот 1
zh_hans: 槽位 1

source: Slot 2
fr: Emplacement 2
ja: スロット 2
ru: Слот 2
zh_hans: 槽位 2

source: Slot 3
fr: Emplacement 3
ja: スロット 3
ru: Слот 3
zh_hans: 槽位 3

source: Slot 4
fr: Emplacement 4
ja: スロット 4
ru: Слот 4
zh_hans: 槽位 4

source: Space out In/Output bits
de: Ein/Ausgangs-Bits auseinanderziehen
fr: Écarter les bits d'entrée/sortie
it: Separa i bit di input/output
ja: 入出力ビットを分離する
ru: Разнести биты входа/выхода
zh_hans: 分散输入/输出位

source: Close in In/Output bits
de: Ein/Ausgangs-Bits zusammenziehen
fr: Rapprocher les bits d'entrée/sortie
it: Avvicina i bit di input/output
ja: 入出力ビットを詰める
ru: Сблизить биты входа/выхода
zh_hans: 收拢输入/输出位

source: Simulation
it: Simulazione
ja: シミュレーション
ru: Симуляция
zh_hans: 模拟

source: Run Validation
de: Validierung ausführen
fr: Lancer la validation
it: Inizia verifica
ja: 検証を実行
ru: Начать проверку
zh_hans: 运行验证

source: Start Pause
fr: Démarrer / Mettre en pause
ja: 開始／一時停止
ru: Продолжить/Приостановить
zh_hans: 开始暂停

source: Reset
de: Zurücksetzen
fr: Réinitialiser
it: Resetta
ja: リセット
ru: Сбросить
zh_hans: 重置

source: Step
de: Schritt
fr: Avancer d'un pas
it: Passo
ja: ステップ
ru: Шаг
zh_hans: 步进

source: Faster Simulation
de: Simulation beschleunigen
fr: Accélérer la simulation
it: Velocizza la simulazione
ja: シミュレーションを高速化
ru: Ускорить
zh_hans: 加快模拟

source: Slower Simulation
de: Simulation verlangsamen
fr: Ralentir la simulation
it: Rallenta la simulazione
ja: シミュレーションを遅くする
ru: Замедлить
zh_hans: 减慢模拟

source: Camera Controls
de: Kamerasteuerung
fr: Contrôles de la caméra
it: Controlli della fotocamera
ja: カメラコントロール
ru: Камера
zh_hans: 相机控制

source: Move Around
de: Bewegen
fr: Se déplacer
it: Muoviti attorno
ja: 移動
ru: Перемещение
zh_hans: 移动

source: Look Around
de: Umschauen
fr: Regarder autour
it: Guardati attorno
ja: 周囲を見る
ru: Поворот камеры
zh_hans: 环顾

source: Rotate View Left
de: Ansicht nach links drehen
fr: Pivoter la vue à gauche
it: Ruota vista a sinistra
ja: ビューを左に回転
ru: Повернуть влево
zh_hans: 向左旋转视图

source: Rotate View Right
de: Ansicht nach rechts drehen
fr: Pivoter la vue à droite
it: Ruota vista a destra
ja: ビューを右に回転
ru: Повернуть вправо
zh_hans: 向右旋转视图

source: Center Camera
de: Kamera zentrieren
fr: Centrer la caméra
it: Centra fotocamera
ja: カメラを中央に配置
ru: Отцентровать камеру
zh_hans: 居中相机

source: Pedestal View Up
de: Ansicht nach oben verschieben
fr: Élever la caméra
it: Piedistallo vista verso l'alto
ja: 台座ビューを上に移動
ru: Поднять камеру
zh_hans: 视图上升

source: Pedestal View Down
de: Ansicht nach unten verschieben
fr: Abaisser la caméra
it: Piedistallo vista verso il basso
ja: カメラを下げる
ru: Опустить камеру
zh_hans: 视图下降

source: Switch Free Cam
de: Free-Cam umschalten
fr: Basculer en caméra libre
it: Passa alla fotocamera libera
ja: フリーカメラに切り替え
ru: Cвободная камера
zh_hans: 切换自由相机

source: Toggle Cam Movements
de: Kamerabewegungen umschalten
fr: Activer/désactiver les mouvements de la caméra
it: Abilita/Disabilita movimenti della fotocamera
ja: カメラの動きを切り替え
ru: Включить покачивания камеры
zh_hans: 切换相机移动

source: Unknown
de: Unbekannt
fr: Inconnu
it: Sconosciuto
ja: 不明
ru: Неизвестно
zh_hans: 未知

source: Build upward
de: Nach oben bauen
fr: Construire vers le haut
it: Costruisci verso l'alto
ja: 上に向かって建てる
ru: Строить вверх
zh_hans: 向上构建

# PressAKeyToSetNLeftClickToClear
source: Press a key to set. Left click to clear.
de: Taste drücken, um festzulegen. Linksklick, um zu löschen.
fr: Appuyez sur une touche pour définir. Clic gauche pour effacer.
it: Premi un tasto da assegnare. Tasto sinistro del mouse per eliminare.
ja: キーを押して設定します。 左クリックでクリアします。
ru: Нажмите клавишу, чтобы задать. Кликните, чтобы очистить.
zh_hans: 按键设置。 左键点击清除。

source: Setting key input...
de: Tasteingabe wird festgelegt...
fr: Réglage de l'entrée de la clé ...
it: Assegnando tasto in input...
ja: キー入力を設定しています…
ru: Нажмите клавишу...
zh_hans: 正在设置按键输入...

source: Permanently pressed keys ignored:
de: Dauerhaft gedrückte Tasten ignoriert:
fr: Touches pressées en permanence ignorées:
it: Tasti premuti continuamente ingorati:
ja: 押しっぱなしのキーは無視されました:
ru: Постоянно нажатые клавиши проигнорированы:
zh_hans: 永久按下的按键已忽略：

# DetectedKeysPermanentlyPressedAndIgnoredByHardChip
source: Detected keys permanently pressed and ignored by Hard Chip. This can be due to specific keyboard input layouts using modifier keys (Ex:IME Japanese input).
de: Von Hard Chip erkannte dauerhaft gedrückte Tasten werden ignoriert. Dies kann durch bestimmte Tastaturlayouts mit Modifikatortasten (z. B. IME-japanische Eingabe) verursacht sein.
fr: Touches détectées pressées en permanence sont ignorées. Cela peut être dû aux dispositions spécifiques des entrées du clavier (Ex: IME Entrée japonaise).
it: Tasti premuti permanentemente sono rilevati e ignorati da Hard Chip. Questo può essere causato da alcune tastiere specifiche che utilizzano un modificatore di tasti (Es: Input giapponese).
ja: Hard Chip により、押しっぱなしと検出されたキーは無視されます。これは、修飾キーを使用する特定のキーボード入力レイアウト（例：IME 日本語入力）が原因である可能性があります。
ru: Обнаружены постоянно нажатые клавиши или клавиши игнорируемые игрой. Это может происхрдить из-за специфической расскладки клавиатуры (например, IME Японский).
zh_hans: 检测到永久按下的按键，已被 Hard Chip 忽略。 这可能是由于特定的键盘输入布局使用了修饰键 （例如：IME 日语输入）。

source: Reset Bindings
de: Belegungen zurücksetzen
fr: Tout réinitialiser
it: Ripristina le associazioni
ja: 割り当てをリセット
ru: Восстановить значения по умолчанию
zh_hans: 重置按键绑定

source: Can't use {0}
de: {0} kann nicht verwendet werden
fr: Impossible d'utiliser {0}
it: Non puoi usare {0}
ja: {0} を使用できません
ru: Нельзя использовать {0}
zh_hans: 无法使用 {0}

source: {0} already used
de: {0} bereits verwendet
fr: {0} déjà utilisé
it: {0} è già stato utilizzato
ja: {0} はすでに使用されています
ru: {0} уже используется
zh_hans: {0} 已被使用

source: * Right click to edit
ja: * 右クリックして編集
zh_hans: * 右键点击编辑
