Repository: Elorth-HC/hardchip-localization
Catalog: src/Areas/Settings/Texts/SettingsTexts.*.resx
Languages: de, es, fr, it, ja, ro, ru, zh_hans

# MouseHorizontalScrollingTooltip
source: Rotate the camera on mouse horizontal scroll.
de: Dreht die Kamera beim horizontalen Scrollen.
es: Rota la cámara al desplazar horizontalmente la rueda del ratón.
fr: Pivote la caméra sur défilement horizontal de la souris.
it: Ruota la visuale allo scorrere orizzontale della rotella del mouse.
ja: マウスホイールの水平スクロールでカメラを回転します。
ro: Rotește camera la derularea orizontală cu mouse-ul.
ru: Поворачивать камеру используя горизонтальную прокрутку колёсиком мыши.
zh_hans: 使用鼠标水平滚动来旋转相机。

# ThisAllowsYourSteamUsernameToAppearOnTheLeaderboardsReplacingTheCurrent
source: This allows your Steam username to appear on the leaderboards, replacing the current autogenerated name. By enabling this, you consent to Hard Chip using your Steam username for leaderboard display purposes.
de: Dies ermöglicht es, dass dein Steam-Benutzername in den Bestenlisten erscheint und den aktuell automatisch generierten Namen ersetzt. Durch die Aktivierung stimmst du zu, dass Hard Chip deinen Steam- Benutzername für die Anzeige in Bestenlisten verwendet.
es: Esto permite que tu nombre de usuario de Steam aparezca en las tablas de clasificación, reemplazando el nombre autogenerado actual. Al habilitar esto, consientes que Hard Chip use tu nombre de usuario de Steam para mostrar en las tablas de clasificación.
it: Questo permette al tuo nome utente di Steam di apparire sulle classifiche al posto dell'attuale nome autogenerato. Attivando questo, consentirai ad Hard Chip di usare il tuo nome utente per la visualizzazione della classifica.
ja: これにより、Steamのユーザー名がリーダーボードに表示され、現在の自動生成された名前に置き換わります。 これを有効にすると、Hard Chipがリーダーボード表示の目的であなたのSteamユーザー名を使用することに同意したことになります。
ro: Aceasta permite ca numele tău de utilizator Steam să apară în clasamente, înlocuind numele curent generat automat. Prin activarea acestei opțiuni, consimți ca Hard Chip să folosească numele tău de utilizator Steam pentru afișarea în clasamente.
ru: Это позволяет вашему имени пользователя Steam отображаться в таблицах лидеров, заменяя текущее автогенерируемое имя. Включив это, вы соглашаетесь на то, что Hard Chip будет использовать ваше имя пользователя Steam для отображения в таблицах лидеров.
zh_hans: 这允许你的 Steam 用户名显示在排行榜上， 替换当前自动生成的名称。 启用此选项即表示你同意 Hard Chip 使用你的 Steam 用户名用于排行榜显示。

source: Steam name:
es: Nombre de Steam:
it: Nome di Steam:
ja: Steam名:
ro: Nume Steam:
ru: Имя Steam:
zh_hans: Steam 名称：

source: Use Steam Name
de: Steam-Namen verwenden
es: Usar nombre de Steam
it: Usa il nome di Steam
ja: Steam名を使用する
ro: Folosește numele Steam
ru: Использовать имя Steam
zh_hans: 使用 Steam 名称

source: Use HC Name
de: HC-Namen verwenden
es: Usar nombre HC
it: Usa il nome di Hard Chip
ja: HC名を使用する
ro: Folosește numele HC
ru: Использовать имя HC
zh_hans: 使用 HC 名称

source: Leaderboard ID:
de: Bestenlisten-ID:
es: ID de clasificación:
it: ID classifica:
ja: リーダーボードID:
ro: ID clasament:
ru: ID таблицы лидеров:
zh_hans: 排行榜 ID：

source: Editor
fr: Éditeur
