Repository: Elorth-HC/hardchip-localization
Catalog: src/Areas/Settings/Texts/SettingsTexts.*.resx
Languages: de, es, fr, it, ja, ro, ru, zh_hans

source: Undo/Redo stack size
de: Undo/Redo-Stack-Größe
es: Tamaño de pila Deshacer/Rehacer
fr: Taille de la pile Annuler/Rétablir
it: Numero annulla/ripeti in memoria
ja: 元に戻す/やり直しスタックのサイズ
ro: Dimensiunea stivei Anulare/Refacere
ru: Размер стека истории действий
zh_hans: 撤销/重做堆栈大小

source: Can be increased to allow more undos, but will consume more memory.
de: Kann erhöht werden, um mehr Rückgängig-Schritte zuzulassen, verbraucht jedoch mehr Speicher.
es: Se puede aumentar para permitir más deshacer, pero consumirá más memoria.
fr: Peut être augmenté pour autoriser davantage d'annulations, mais cela consomme plus de mémoire.
it: Può essere incrementato per permettere più annulla, ma consumerà più memoria.
ja: 元に戻す回数を増やすために増やすことはできますが、メモリ消費量が増えます。
ro: Poate fi mărită pentru a permite mai multe anulări, dar va consuma mai multă memorie.
ru: Может быть увеличен, чтобы можно было отменять большее количество раз, но будет задействовать больше памяти.
zh_hans: 可以增加以允许更多撤销操作，但会消耗更多内存。

source: Reset settings
de: Einstellungen zurücksetzen
es: Restablecer ajustes
fr: Réinitialiser les paramètres
it: Ripristina impostazioni
ja: 設定をリセット
ro: Resetează setările
ru: Сбросить настройки
zh_hans: 重置设置

source: Reset all settings?
de: Alle Einstellungen zurücksetzen?
es: ¿Restablecer todos los ajustes?
fr: Réinitialiser tous les paramètres ?
it: Ripristinare tutte le impostazioni?
ja: すべての設定をリセットしますか？
ro: Resetează toate setările?
ru: Сбросить все настройки?
zh_hans: 重置所有设置？

source: All settings will be reset to default. Restarting the game could be necessary to fully apply.
de: Alle Einstellungen werden auf Standardwerte zurückgesetzt. Ein Neustart des Spiels kann erforderlich sein, damit alles angewendet wird.
es: Todos los ajustes se restablecerán a los valores predeterminados. Puede ser necesario reiniciar el juego para aplicarlos completamente.
fr: Tous les paramètres seront réinitialisés par défaut. Un redémarrage du jeu peut être nécessaire pour appliquer entièrement.
it: Tutte le impostazione saranno ripristinate ai valori iniziali. È necessario il riavvio del gioco per applicare tutte le modifiche.
ja: すべての設定がデフォルトにリセットされます。完全に適用するには、ゲームの再起動が必要になる場合があります。
ro: Toate setările vor fi resetate la valorile implicite. Repornirea jocului ar putea fi necesară pentru aplicarea completă.
ru: Все настройки будут сброшены до значений по умолчанию. Чтобы настройки полностью применились, может потребоваться перезапуск игры.
zh_hans: 所有设置将重置为默认值。可能需要重启游戏才能完全应用。

source: Campaign
de: Kampagne
es: Campaña
fr: Campagne
it: Campagna
ja: キャンペーン
ro: Campanie
ru: Кампания
zh_hans: 剧情

source: Reset campaign only
de: Nur Kampagne zurücksetzen
es: Restablecer solo la campaña
fr: Réinitialiser uniquement la campagne
it: Ripristina solo la campagna
ja: キャンペーンのみをリセット
ro: Resetează doar campania
ru: Сбросить только кампанию
zh_hans: 仅重置剧情

source: Reset campaign progression?
de: Kampagnenfortschritt zurücksetzen?
es: ¿Restablecer la progresión de la campaña?
fr: Réinitialiser la progression de la campagne ?
it: Ripristinare i progressi nella campagna?
ja: キャンペーンの進行状況をリセットしますか？
ro: Resetează progresul campaniei?
ru: Сбросить прогресс кампании?
zh_hans: 重置剧情进度？

source: This will reset your campaign progression, but WON'T remove solved solutions.
de: Dies setzt deinen Kampagnenfortschritt zurück, entfernt aber NICHT gelöste Lösungen.
es: Esto restablecerá tu progresión en la campaña, pero NO eliminará las soluciones completadas.
fr: Cela réinitialisera votre progression de campagne, mais NE supprimera PAS les solutions déjà résolues.
it: Questo ripristinerà i tuoi progressi nella campagna, ma NON rimuoverà le soluzioni risolte.
ja: これによりキャンペーンの進行状況はリセットされますが、解決済みのソリューションは削除されません。
ro: Aceasta va reseta progresul campaniei, dar NU va elimina soluțiile rezolvate.
ru: Это сбросит прогресс Вашей кампании, но не удалит решённые уровни.
zh_hans: 这将重置你的剧情进度，但不会删除已完成的解决方案。

# AreYouSureYouWantToResetYourCampaignProgressionNSolvedSolutionsWonTBeRemoved
source: Are you sure you want to reset your campaign progression? Solved solutions won't be removed.
de: Bist du sicher, dass du deinen Kampagnenfortschritt zurücksetzen möchtest? Gelöste Lösungen bleiben erhalten.
es: ¿Seguro que deseas restablecer tu progresión en la campaña? Las soluciones completadas no se eliminarán.
fr: Êtes-vous sûr de vouloir réinitialiser votre progression de campagne Les solutions résolues ne seront pas supprimées.
it: Sei sicuro di voler ripristinare i tuoi progressi nella campagna? Le soluzioni non verranno cancellate.
ja: キャンペーンの進行状況をリセットしてもよろしいですか？ 解決済みの解法は削除されません。
ro: Ești sigur că vrei să resetezi progresul campaniei? Soluțiile rezolvate nu vor fi eliminate.
ru: Вы уверены, что хотите сбросить прогресс Вашей кампании? Решённые уровни не будут удалены.
zh_hans: 确定要重置你的剧情进度吗？ 已完成的解决方案不会被删除。

source: Hard reset
es: Restablecimiento total
fr: Réinitialisation complète
it: Reset completo
ja: ハードリセット
ro: Resetare completă
ru: Полный сброс
zh_hans: 硬重置

source: Reset everything
de: Alles zurücksetzen
es: Restablecer todo
fr: Tout réinitialiser
it: Ripristina tutto
ja: すべてをリセット
ro: Resetează totul
ru: Сбросить всё
zh_hans: 重置所有

# ResetEVERYTHINGUppercase
source: Reset EVERYTHING?
de: WIRKLICH ALLES ZURÜCKSETZEN?
es: ¿Restablecer TODO?
fr: RÉINITIALISER TOUT ?
it: Ripristinare TUTTO?
ja: すべてをリセットしますか？
ro: Resetează TOTUL?
ru: Сбросить ВСЁ?
zh_hans: 重置所有内容？

source: This will reset EVERY settings, solutions and campaign progression.
de: Dies setzt ALLE Einstellungen, Lösungen und den Kampagnenfortschritt zurück.
es: Esto restablecerá TODOS los ajustes, soluciones y la progresión de la campaña.
fr: Cette action réinitialisera TOUS les paramètres, les solutions et la progression de la campagne.
it: Questo ripristinerà OGNI impostazione, soluzione e progresso nella campagna.
ja: これにより、すべての設定、解決状況、キャンペーンの進行状況がリセットされます。
ro: Aceasta va reseta TOATE setările, soluțiile și progresul campaniei.
ru: Это сбросит ВСЕ настройки, решения, и прогресс кампании.
zh_hans: 这将重置所有设置、解决方案和剧情进度。

source: Are you sure you want to reset EVERY solutions and campaign progression? THIS DELETE EVERYTHING, BE SURE WHAT YOU ARE DOING!
de: Bist du absolut sicher, dass du ALLE Lösungen und den Kampagnenfortschritt löschen willst? DAS LÖSCHT ALLES - überlege dir das gut!
es: ¿Seguro que deseas restablecer TODAS las soluciones y la progresión de la campaña? ¡ESTO BORRARÁ TODO, ASEGÚRATE DE LO QUE HACES!
fr: Êtes-vous sûr de vouloir réinitialiser TOUTES les solutions et la progression de la campagne; CETTE ACTION SUPPRIME TOUT, ASSUREZ-VOUS DE CE QUE VOUS FAITES !
it: Sei sicuro di voler cancellare OGNI soluzione e i progressi nella campagna? QUESTO CANCELLERÀ TUTTO, ASSICURATI DI QUELLO CHE STAI FACENDO!
ja: 本当に、すべての解法とキャンペーンの進行状況をリセットしますか？ これによりすべてが削除されます。実行してよいか、よく確認してください！
ro: Ești sigur că vrei să resetezi TOATE soluțiile și progresul campaniei? ACEASTA ȘTERGE TOTUL, FII SIGUR CE FACI!
ru: Вы уверены, что хотите сбросить ВСЕ решения и прогресс кампании? ЭТО УДАЛИТ ВСЁ! БУДЬТЕ УВЕРЕНЫ В ТОМ, ЧТО ВЫ ДЕЛАЕТЕ!
zh_hans: 确定要重置所有解决方案和剧情进度吗？ 这将删除所有内容，请确认你的操作！

source: *Music and ambiance licences allow monetized content.
de: *Musik- und Ambiente-Lizenzen erlauben monetarisierten Content.
es: *Las licencias de música y ambientación permiten contenido monetizado.
fr: *Les licences de musique et d'ambiance autorisent un contenu monétisé.
it: *Le licenze della musica e dell'ambiente consentono contenuto monetizzato.
ja: *音楽およびアンビエンスのライセンスにより、収益化コンテンツが可能になります。
ro: *Licențele pentru muzică și ambianță permit conținut monetizat.
ru: *Лицензии на музыку и фоновые треки разрешают коммерческое использование.
zh_hans: *音乐和环境音许可证允许用于盈利内容。

source: Master volume
de: Master-Lautstärke
es: Volumen maestro
fr: Volume principal
it: Volume principale
ja: マスター音量
ro: Volum principal
ru: Общaя громкость звука
zh_hans: 主音量

# GameplayVolume
source: Gameplay
es: Jugabilidad
fr: Volume gameplay
it: Gioco
ja: ゲームプレイ
ru: Громкость эффектов
zh_hans: 游戏音量

source: Mode
de: Modus
es: Modo
it: Modalità
ja: モード
ro: Mod
ru: Режим
zh_hans: 模式

source: Online
es: En línea
fr: En ligne
ja: オンライン
ru: Онлайн
zh_hans: 在线

source: Charts are calculated with the latest solutions from around the world and your scores update charts.
de: Charts werden mit den neuesten Lösungen aus aller Welt berechnet; deine Ergebnisse aktualisieren die Charts.
es: Las tablas se calculan con las últimas soluciones de todo el mundo y tus puntuaciones actualizan las tablas.
fr: Les classements sont calculés avec les dernières solutions provenant du monde entier, et vos scores mettent à jour ces classements.
it: I grafici sono calcolati con le ultime soluzioni da tutto il mondo e i tuoi punteggi aggiorneranno i grafici.
ja: チャートは世界中の最新の解答をもとに算出され、あなたのスコアがチャートを更新します。
ro: Graficele sunt calculate cu cele mai recente soluții din întreaga lume și scorurile tale actualizează graficele.
ru: Диаграммы рассчитываются на основе самых последних решений со всего мира, оценки Ваших решений обновляют диаграммы.
zh_hans: 排行榜根据来自世界各地的最新解决方案计算， 你的分数会更新排行榜。

source: Charts are calculated from a fixed and local snapshot of the latest solutions from around the world. Your scores don't update charts.
de: Charts basieren auf einem lokalen Schnappschuss der neuesten Lösungen. Deine Ergebnisse ändern die Charts nicht.
es: Las tablas se calculan a partir de una instantánea local fija de las últimas soluciones globales. Tus puntuaciones no actualizan las tablas.
fr: Les classements sont calculés à partir d'un instantané local figé des dernières solutions venues du monde entier. Vos scores ne mettent pas à jour ces classements.
it: I grafici sono calcolati sulla base dei dati salvati in locale delle ultime soluzione da tutto il mondo. I tuoi punteggi non aggiorneranno i grafici.
ja: チャートは、世界中の最新の解答の固定されたローカルスナップショットに基づいて算出されます。あなたのスコアはチャートを更新しません。
ro: Graficele sunt calculate dintr-o captură fixă și locală a celor mai recente soluții din întreaga lume. Scorurile tale nu actualizează graficele.
ru: Диаграммы рассчитываются на основе локальной фиксированной копии оценок решений со всего мира. Оценки Ваших решений не обновляют диаграммы.
zh_hans: 排行榜根据来自世界各地最新解决方案的 固定本地快照计算。你的分数不会更新排行榜。

source: Ray precision
de: Ray-Präzision
es: Precisión de rayo
fr: Précision du lancer de rayons
it: Precisione dei raggi
ja: レイ精度
ro: Precizia razelor
ru: Точность лучей
zh_hans: 光线精度

source: Use Cubic when nothing else works. Will render cubes instead of complex shapes, fast but ugly.
de: „Kubisch“ verwenden, wenn nichts anderes funktioniert. Rendert Würfel statt komplexer Formen - schnell, aber hässlich.
es: Usa «Cúbico» cuando nada más funcione. Representará cubos en lugar de formas complejas: rápido pero feo.
fr: Utilisez Cubic lorsque rien d'autre ne fonctionne. Cela affichera des cubes au lieu de formes complexes, rapide mais inesthétique.
it: Usa 'cubico' quando nient'altro funziona. Mostrerà cubi invece che di forme complesse, veloce ma brutto.
ja: 他に何も機能しない場合は「Cubic」を使用してください。複雑な形状の代わりにキューブを描画します。高速ですが見た目は悪いです。
ro: Folosește Cubic când nimic altceva nu funcționează. Va reda cuburi în loc de forme complexe, rapid dar urât.
ru: Используйте 'Кубичский', если больше ничего не работает. Будет рисовать кубики вместо сложных форм. Быстро, но некрасиво.
zh_hans: 当其他方法都不起作用时使用立方体。将渲染立方体而不是复杂形状，速度快但不美观。

source: Ray precision is the number of steps each ray perform. Higher values will increase quality, but will decrease performance.
de: Ray-Präzision ist die Anzahl der Schritte pro Ray. Höhere Werte verbessern die Qualität, verringern aber die Performance.
es: La precisión de rayo es el número de pasos que realiza cada rayo. Valores más altos aumentan la calidad, pero reducen el rendimiento.
fr: La précision du rayon correspond au nombre d'étapes effectuées par chaque rayon. Des valeurs plus élevées amélioreront la qualité, mais réduiront les performances.
it: La precisione dei raggi è il numero di passi che ogni raggio compie. Valori più alti aumenteranno la qualità, ma diminuiranno la performance.
ja: レイ精度は、各レイが実行するステップ数です。 値を高くすると品質は向上しますが、パフォーマンスは低下します。
ro: Precizia razelor este numărul de pași pe care îi efectuează fiecare rază. Valori mai mari vor crește calitatea, dar vor scădea performanța.
ru: Точность лучей - это количество шагов, которые выполняет каждый луч. Более высокие значения увеличат качество, но снизят производительность.
zh_hans: 光线精度是每条光线执行的步数。 数值越高质量越好，但会降低性能。

source: Likely performance cost: 10-30 percent.
de: Geschätzter Performance-Verlust: 10-30 %.
es: Coste de rendimiento aproximado: 10-30 %.
fr: Impact probable sur les performances : 10 % à 30 %.
it: Costo performance probabile: 10-30 percento.
ja: 推定されるパフォーマンス低下：10～30％。
ro: Costul probabil al performanței: 10-30 procente.
ru: Вероятное понижение производительности: 10-30 процентов.
zh_hans: 可能的性能损耗：10-30%。

source: Chromatic Aberration
de: Chromatische Aberration
es: Aberración cromática
fr: Aberration chromatique
it: Aberrazione cromatica
ja: 色収差
ro: Aberație cromatică
ru: Хроматическая аберрация
zh_hans: 色差

source: No performance cost, but may cause discomfort to some users.
de: Keine Performance-Kosten, kann aber einige Nutzer stören.
es: Sin coste de rendimiento, pero puede causar molestias a algunos usuarios.
fr: Aucun impact sur les performances, mais peut gêner certains utilisateurs.
it: Nessun costo sulla performance, ma potrebbe causare fastidio ad alcuni utenti.
ja: パフォーマンスへの影響はありませんが、一部のユーザーには不快感を与える可能性があります。
ro: Fără cost de performanță, dar poate cauza disconfort unor utilizatori.
ru: Не влияет на производительность, но может вызвать дискомфорт у некоторых пользователей.
zh_hans: 无性能损耗，但可能会给部分用户带来不适。

source: UI Text Scale
de: UI-Textskalierung
es: Escala de texto de la IU
fr: Taille du texte de l'interface
it: Dimensioni testo nell'interfaccia
ja: UIテキストのスケール
ro: Scala textului UI
ru: Размер текста интерфейса
zh_hans: 界面文字缩放

source: Benchmark
ja: ベンチマーク
ro: Test de performanță
ru: Тест производительности
zh_hans: 基准测试

# ApplySettings
source: Apply
de: Anwenden
es: Aplicar
fr: Appliquer
it: Applica
ja: 適用
ro: Aplică
ru: Применить
zh_hans: 应用

source: Won't be applied if VSync is enabled.
de: Wird nicht angewendet, wenn VSync aktiviert ist.
es: No se aplicará si VSync está activado.
fr: Ne sera pas appliqué si la VSync est activée.
it: Non verrà applicato se il VSync è attivo.
ja: VSync が有効になっている場合は適用されません。
ro: Nu va fi aplicat dacă VSync este activat.
ru: Не будет применено, если включена вертикальная синхронизация.
zh_hans: 如果启用了垂直同步，则不会应用。

source: FPS limit
es: Límite de FPS
fr: Limite de FPS
it: Limite FPS
ja: FPS制限
ro: Limită FPS
ru: Ограничение частоты кадров
zh_hans: 帧率限制

source: Restart to apply changes
de: Zum Übernehmen neu starten
es: Reinicia para aplicar los cambios
fr: Redémarrer pour appliquer
it: Riavvia per applicare i cambiamenti
ja: 変更を適用するには再起動してください
ro: Repornește pentru a aplica modificările
ru: Перезапустить, чтобы применить изменения
zh_hans: 重启以应用更改

source: Editor Render Scale
de: Editor-Render-Skalierung
es: Escala de renderizado del editor
fr: Échelle de rendu de l'éditeur
it: Scala renderizzazione nell'editor
ja: エディターのレンダリングスケール
ro: Scala de redare a editorului
ru: Разрешение в редакторе
zh_hans: 编辑器渲染缩放

source: Lower values will increase performance, but will decrease quality. Higher values will strongly decrease performance, but will increase quality.
de: Niedrigere Werte erhöhen die Performance, verringern aber die Qualität. Höhere Werte verringern die Performance stark, erhöhen jedoch die Qualität.
es: Valores bajos mejoran el rendimiento pero reducen la calidad. Valores altos reducen mucho el rendimiento pero aumentan la calidad.
fr: Des valeurs plus basses amélioreront les performances, mais réduiront la qualité. Des valeurs plus élevées réduiront fortement les performances, mais augmenteront la qualité.
it: Valori minori aumenteranno la performance, ma diminuiranno la qualità. Valori maggiori diminuiranno la performance, ma aumenteranno la qualità.
ja: 低い値にするとパフォーマンスは向上しますが、品質は低下します。 高い値にするとパフォーマンスは大幅に低下しますが、品質は向上します。
ro: Valorile mai mici vor crește performanța, dar vor scădea calitatea. Valorile mai mari vor scădea puternic performanța, dar vor crește calitatea.
ru: Более низкие значения увеличат производительность, но снизят качество. Более высокие значения сильно снизят производительность, но повысят качество.
zh_hans: 较低的值会提高性能，但会降低质量。 较高的值会大幅降低性能，但会提高质量。

source: Field of view used during first-person phases. No performance cost.
de: Sichtfeld in Ego-Phasen. Keine Performance-Kosten.
es: Campo de visión usado en fases en primera persona. Sin coste de rendimiento.
fr: Champ de vision utilisé pendant les phases en vue à la première personne. Aucun impact sur les performances.
it: Campo visivo usato durante la fasi in prima persona. Nessun costo sulla performance.
ja: 一人称視点の場面で使用される視野角。パフォーマンスへの影響はありません。
ro: Câmpul vizual folosit în fazele din perspectiva întâi. Fără cost de performanță.
ru: Угол обзора во время игры от первого лица. Не влияет на производительность.
zh_hans: 第一人称阶段使用的视野。无性能损耗。

source: Field of view used during editor phases. No performance cost.
de: Sichtfeld in Editor-Phasen. Keine Performance-Kosten.
es: Campo de visión usado en el editor. Sin coste de rendimiento.
fr: Champ de vision utilisé pendant les phases d'édition. Aucun impact sur les performances.
it: Campo visivo usato durante le fasi di modifica. Nessun costo sulla performance.
ja: エディタのフェーズ中に使用される視野角。パフォーマンスへの影響はありません。
ro: Câmpul vizual folosit în fazele editorului. Fără cost de performanță.
ru: Угол обзора в редакторе. Не влияет на производительность.
zh_hans: 编辑器阶段使用的视野。无性能损耗。

source: Render Method
de: Render-Methode
es: Método de renderizado
fr: Méthode de rendu
it: Metodo di rendering
ja: レンダリング方法
ro: Metoda de redare
ru: Метод отрисовки
zh_hans: 渲染方法

source: Mouse Wheel Sensitivity
de: Mausrad-Empfindlichkeit
es: Sensibilidad rueda del ratón
fr: Sensibilité de la molette de la souris
it: Sensibilità rotella del mouse
ja: マウスホイールの感度
ro: Sensibilitatea rotii mouse-ului
ru: Чувствительность колёсика мыши
zh_hans: 鼠标滚轮灵敏度

source: Flip vertical mouse movement during FPS phases.
de: Vertikale Mausbewegung in Ego-Phasen invertieren
es: Invertir movimiento vertical del ratón en fases FPS.
fr: Inverser le mouvement vertical de la souris pendant les phases en vue à la première personne.
it: Inverti il movimento verticale del mouse durante le fasi FPS.
ja: FPS視点中のマウスの縦方向の動きを反転する。
ro: Inversează mișcarea verticală a mouse-ului în fazele FPS.
ru: Инвертировать движение мыши по вертикали во время игры от первого лица.
zh_hans: 在第一人称阶段翻转垂直鼠标移动。

source: Mouse Edge Scrolling
de: Mausrand-Scrollen
es: Desplazamiento en borde
fr: Défilement à la périphérie
it: Scorrimento mouse sul bordo
ja: マウスの端スクロール
ro: Derularea de la marginea mouse-ului
ru: Перемещение по краю экрана
zh_hans: 鼠标边缘滚动

# DoubleClickToEdit
source: Edit mode on double-right click
de: Edit-Modus bei Doppel-Rechtsklick
es: Modo edición con doble clic derecho
fr: Mode édition sur double-click droit
it: Modalità modifica con doppio clic sul tasto destro
ja: 右クリックをダブルクリックすると編集モードになります
ro: Mod editare la dublu-clic dreapta
ru: Режим редактирования по двойному щелчку ПКМ
zh_hans: 双击右键进入编辑模式

source: If enabled, double right mouse click will switch to edit mode. Metal block will be automatically selected.
de: Wenn aktiviert, schaltet ein doppelter Rechtsklick in den Edit-Modus. Ein Metallblock wird automatisch ausgewählt.
es: Si está habilitado, un doble clic derecho cambiará al modo edición. El bloque metálico se seleccionará automáticamente.
fr: Si activé, un double-clic gauche passera en mode édition. Le block Metal sera automatiquement sélectionné.
it: Se attivato, fare doppio clic sul tasto destro per passare alla modalità modifica. I blocchi di metallo verranno selezionati automaticamente.
ja: 有効にすると、マウスの右ボタンをダブルクリックすると編集モードに切り替わります。 金属ブロックが自動的に選択されます。
ro: Dacă este activat, dublu-clic dreapta va comuta în modul de editare. Blocul de metal va fi selectat automat.
ru: Если включено, используйте двойной щелчок правой кнопкой мыши для перехода в режим редактирования. Блок МЕТАЛЛА будет автоматически выбран.
zh_hans: 如果启用，双击鼠标右键将切换到编辑模式。 将自动选择金属块。

source: World FOV
de: Welt-FOV
es: FOV del mundo
fr: FOV du monde
it: Campo visivo mondo
ja: ワールドFOV
ro: FOV lumea
ru: Угол обзора в мире
zh_hans: 世界视野

source: General
de: Allgemein
fr: Général
it: Generale
ja: 一般
ru: Общие
zh_hans: 通用

source: Windowed
de: Fenster
es: Ventana
fr: Fenêtré
it: In finestra
ja: ウィンドウ表示
ro: În fereastră
ru: Оконный
zh_hans: 窗口化

source: Borderless
de: Randlos
es: Sin bordes
fr: Sans bordure
it: Senza bordi
ja: ボーダーレス
ro: Fără margini
ru: Оконный (без рамки)
zh_hans: 无边框

source: Auto-detect
de: Auto-Erkennung
es: Detección automática
fr: Auto-détection
it: Rilevazione automatica
ja: 自動検出
ro: Detectare automată
ru: Авто-определение
zh_hans: 自动检测

source: Unlimited (or VSync)
de: Unbegrenzt (oder VSync)
es: Ilimitado (o VSync)
fr: Illimité (ou VSync)
it: Illimitato (o VSync)
ja: 無制限（またはVSync）
ro: Nelimitat (sau VSync)
ru: Не ограничено (или Вертикальная синхронизация)
zh_hans: 无限制（或垂直同步）

source: Ray Marching
ja: レイマーチング
ru: Трассировка лучей
zh_hans: 光线步进

source: Cubic
de: Kubisch
es: Cúbico
fr: Cubique
it: Cubico
ja: 立方体の
ru: Кубичский
zh_hans: 立方体

source: Action
de: Aktion
es: Acción
it: Azione
ja: アクション
ro: Acțiune
ru: Действие
zh_hans: 操作

source: Dark background
de: Dunkler Hintergrund
es: Fondo oscuro
fr: Arrière plan sombre
it: Sfondo scuro
ja: ダークな背景
ro: Fundal întunecat
ru: Тёмный фон
zh_hans: 深色背景

# ReduceVisualStrainOnTheEditorSBackgroundForSensitivityToBrightness
source: May reduce visual strain from the editor's background for some users.
de: Kann die Augenbelastung durch den Editor-Hintergrund verringern.
es: Puede reducir la fatiga visual del fondo del editor para usuarios sensibles al brillo.
fr: Réduit la fatigue visuel dans l'éditeur pour la sensibilité à la luminosité.
it: Può ridurre lo sforzo visivo derivato dallo sfondo dell'editor per alcuni utenti.
ja: 一部のユーザーにとって、エディターの背景による視覚的な負担を軽減できる場合があります。
ro: Poate reduce oboseala vizuală de la fundalul editorului pentru unii utilizatori.
ru: Может уменьшить зрительный дискомфорт от фона редактора у некоторых пользователей.
zh_hans: 可能会减轻部分用户对编辑器背景的视觉疲劳。

# FPSInvertYAxis
source: Invert Y axis during first-person phases
de: Y-Achse in Ego-Ansicht invertieren
es: Invertir eje Y en fases FPS
fr: Inverser l'axe Y en première personne
it: Inverti l'asse Y durante le fase in prima persona
ja: 一人称視点中にY軸を反転する
ro: Inversează axa Y în fazele din perspectiva întâi
ru: Инвертировать ось Y в режиме от первого лица.
zh_hans: 在第一人称阶段反转 Y 轴

# MouseEdgeScrollingTooltip
source: Move the camera around when the mouse is on the edge of the screen.
de: Bewege die Kamera, wenn der Mauszeiger am Bildschirmrand ist.
es: Mueve la cámara cuando el cursor está en el borde de la pantalla.
fr: Défile lorsque la souris est à la périphérie de l'écran.
it: Muovi la visuale quando il mouse è vicino al bordo dello schermo.
ja: マウスカーソルが画面の端にあるときにカメラを移動します。
ro: Mută camera când mouse-ul este la marginea ecranului.
ru: Перемещать камеру, когда мышь находится на краю экрана.
zh_hans: 当鼠标在屏幕边缘时移动相机。

source: Mouse horizontal scrolling
de: Maus-Horizontal-Scrollen
es: Desplazamiento horizontal del ratón
fr: Défilement horizontal souris
it: Scorrimento mouse orizzontale
ja: マウスの水平スクロール
ro: Derularea orizontală cu mouse-ul
ru: Горизонтальная прокрутка мышью
zh_hans: 鼠标水平滚动
